{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Tuiste",
        "about": "Oor my",
        "portfolio": "Portefeulje",
        "projects": "Webwerfprojekte",
        "tiger": "Tiger taal",
        "portfolio_translator": "Portefeulje vertaler",
        "formatter": "JSON & YAML Formatter",
        "cube_solver": "Rubix Cube Solver",
        "contact": "Kontak my"
    },
    "home": {
        "title": "Tuiste",
        "animated": {
            "first": "Volledige stapel sagteware -ingenieur",
            "second": "Webontwikkelaar",
            "third": "Wildontwikkelaar",
            "fourth": "Inhoudskepper"
        },
        "footer": "Webwerf nou vertaal en beskikbaar in 100+ tale!",
        "descriptionA": "Ervare volledige sagteware-ingenieur en webontwikkelaar met 'n gedemonstreerde geskiedenis van suksesvolle toonaangewende ontwikkelingsprojekte, van die skep van Java-modifikasies vir Minecraft tot die verbetering van gebruikerservaring in react.js en die implementering van veilige REST-API's, terwyl hulle konsekwent gebruik maak van ratse metodologieë en effektiewe spandamewerking.",
        "descriptionB": "Boonop is ek 'n geografie -inhoudskepper wat die algoritmes van verskeie sosiale media -platforms, insluitend Instagram, YouTube en Tiktok, suksesvol benut het om 'n eerbiedige en aangrypende volgelingbasis te kry.",
        "portfolio_button": "My portefeulje",
        "contact_button": "Kontak my",
        "about_button": "Oor my"
    },
    "about": {
        "title": "Oor my",
        "personal_summary": {
            "title": "Persoonlike opsomming",
            "text": "As 'n ervare volledige stapelprogrammatuurontwikkelaar in Orlando, FL, het ek kundigheid in verskillende tegnologieë getoon, van Java en C ++ tot react.js en node.js. Met 'n goeie rekord van spieskopprojekte, insluitend die ontwikkeling van 'n Java -modifikasieprogram vir Minecraft en 'n lonende webwerf vir vragmotorbestuurders, het ek leierskap en innovasie ten toon gestel. My toewyding aan uitnemendheid is duidelik in my vermoë om projekbestuur te stroomlyn, ingewikkelde probleme op te los en oplossings van hoë gehalte te lewer wat gebruikerservaring verhoog en organisatoriese sukses dryf."
        },
        "professional_experience": {
            "title": "Professionele ervaring",
            "entries": [
                {
                    "jobtitle": "Junior sagteware -ingenieur",
                    "where": "Orion180 Versekering",
                    "date": "2024 - Huidig"
                },
                {
                    "jobtitle": "Stigter en Full Stack Software Developer",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Volledige stapel sagteware -ingenieur",
                    "where": "Versnel leer",
                    "date": "2023"
                },
                {
                    "jobtitle": "Loodwebontwikkelaar (studenteprogram)",
                    "where": "Clemson University GDI -program",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Lessenaar toesighouer",
                    "where": "Clemson Universiteit",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Lessenaar toesighouer",
                    "where": "Clemson Universiteit",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Tegniese vaardighede",
            "header1": "Programmeringstale",
            "header2": "Raamwerke en biblioteke",
            "header3": "Gereedskap en tegnologieë"
        },
        "services": {
            "title": "My dienste",
            "entries": [
                {
                    "title": "Volle stapelingenieurswese",
                    "text": "Ek bied omvattende oplossings oor sowel die voorkant as die agterkant-ontwikkeling, wat naatlose integrasie en funksionaliteit deur die hele sagtewarestapel verseker."
                },
                {
                    "title": "Webontwikkeling",
                    "text": "Met kundigheid in HTML-, CSS- en JavaScript-raamwerke soos React.js, vervaardig ek visueel aantreklike en gebruikersvriendelike webwerwe wat aangepas is om aan die spesifieke behoeftes en voorkeure van kliënte te voldoen."
                },
                {
                    "title": "Wildontwikkeling",
                    "text": "As ek tale soos Java en C ++ gebruik, spesialiseer ek in die skep van opwindende spelervarings, van konsep en ontwerp tot implementering en optimalisering, om aangrypende spel en gladde werkverrigting te verseker."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portefeulje",
        "filter_by": "Filter portefeulje deur:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca JSON",
                "text": "'N Python -projek wat taalvertalings stroomlyn. Laat toe dat my webwerf -portefeulje in 70+ tale vertaal word, insluitend Spaans, Frans, Chinees, Arabies en vele ander. Hierdie projek word gebruik om 'n veeltalige webwerf -portefeulje te skep, wat baie nuttig is om 'n groter gehoor te bereik. Met hierdie projek kan meer as 99% van die wêreld my portefeulje in 'n vlot taal lees.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Verbind vier",
                "text": "Massiewe familie van meer as 50+ implementasies van die Connect Four -spel. Hierdie projek bevat implementasies in meer as 30 verskillende programmeertale, insluitend Java, C ++, Python, JavaScript en meer. Daarbenewens bevat dit ook meer as 20+ verskillende raamwerke of ander formate, insluitend React.js, Ruby on Rails, ASP.NET en meer.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "Kruideniersware -app",
                "text": "'N Volledige volledige stapel .NET 9 Blazor Server-toepassing vir die bestuur van kruideniersware-items. Die toepassing volg op die beheerder/diens/bewaarplekpatroon met die kern van die entiteitsraamwerk vir volharding en bevat 'n omvattende toetssuite.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Interop Project",
                "text": "'N projek wat interoperabiliteit tussen verskillende programmeertale dokumenteer. Bevat tans 15 verskillende programmeertale en 18 uitvoeringspatrone.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Voorraadregister",
                "text": "'N Volle-stapel-demo-verkooppunt (POS) -register met voorraadbestuurstelsel gebou met Angular 17+ en Node.js. Hierdie toepassing demonstreer 'n POS-stelsel met 'n professionele graad met gebruikersverifikasie, rolgebaseerde toegangsbeheer, voorraadopsporing en bespotlike betalingsverwerking.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "JSON & YAML Auto Formatter",
                "text": "'N Linter & Autoformatter vir JSON & YAML -lêers. Hierdie projek word gebruik om JSON & YAML -lêers te formateer, wat baie nuttig is om kode skoon en georganiseerd te hou. Gebou met GO, saamgestel met webAssembly, en in my portefeulje ingebed as 'n webwerfprojek. Meer formate om in die toekoms te kom.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft json -kragopwekker",
                "text": "Liggewig JSON Generator gebou in Python vir Minecraft Resource & Data Packs. Hierdie projek word gebruik om JSON -lêers vir Minecraft -mods te genereer, insluitend pasgemaakte items, blokke en entiteite. Baie nuttig om nie net aangepaste datapakke te skep nie, maar ook vir mods via die MOD Name Switching -funksie.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "My opvoedkundige ervaring",
                "text": "Behalwe my persoonlike projekte, het ek ook talle vaardighede uit opvoedkundige ervaring verwerf. Klik hier om my LinkedIn -profiel te sien vir meer inligting.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "My professionele ervaring",
                "text": "Behalwe my persoonlike projekte, het ek ook talle vaardighede uit professionele ervaring verwerf. Klik hier om my LinkedIn -profiel te sien vir meer inligting.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Goodwin Portefeulje webwerf",
                "text": "Hierdie webwerf is my persoonlike portefeulje -webwerf, gebou met react.js. Hierdie projek word gebruik om my vaardighede en projekte ten toon te stel, sowel as om 'n platform te bied vir potensiële werkgewers om my te kontak. Hierdie projek word gebruik om 'n professionele aanlyn -teenwoordigheid te skep.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patrick se Lua -skrifbiblioteek",
                "text": "'N Nuttige biblioteek van Lua -skrifte vir toekomstige verwysing. Hierdie biblioteek word gebruik om take in Lua-skrifte te outomatiseer, wat handig te pas kan kom vir prestasie-behoeftige take, aangesien Lua gewoonlik 'n vinniger skriftaal is as beide Python en Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrick se Microsoft Excel -sigbladskripte (VBA)",
                "text": "'N Nuttige biblioteek met VBA -skrifte vir Microsoft Excel. Hierdie biblioteek word gebruik om take in Excel -sigblaaie te outomatiseer.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Patrick se neovim config",
                "text": "My persoonlike neovim -konfigurasie. Hierdie projek word gebruik om Neovim na my smaak op te stel, insluitend pasgemaakte sleutelbindings, temas en plugins. Hierdie projek word gebruik om Neovim gebruikersvriendelik en doeltreffender te maak vir my persoonlike gebruik.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patrick se kaartgenerator",
                "text": "'N Verenigde State County & State Map Generator, gebou met Python met behulp van die Geopandas- en Matplotlib -biblioteke. Hierdie projek word gebruik om kaarte van die Verenigde State, insluitend provinsiale en staatskaarte, te genereer. Hierdie projek word gebruik om pasgemaakte kaarte vir datavisualisering en -analise te skep.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patrick se PowerShell -skrifbiblioteek",
                "text": "'N Nuttige biblioteek met PowerShell -skrifte vir toekomstige verwysing. Nuttig met die $ profiel -skripfunksie, vind ek dit baie nuttig om take van die Windows -terminale te outomatiseer, aangesien ek 'n gereelde gebruiker van die Windows OS is.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patrick's Ruby Script Library",
                "text": "'N Nuttige biblioteek met robynskripte vir toekomstige verwysing. Nuttig vir toekomstige Ruby on Rails -ontwikkelingskonsepte.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF Vaardigheidsbouer",
                "text": "'N Pasgemaakte PDF -bouer wat met Python gebou is via die PDFKit- en Jinja2 -uitbreidings, saam met HTML en JSON -formatering. Hierdie projek word gebruik om PDF -lêers uit 'n lys van vaardighede en projekte te genereer. Hierdie projek kan gebruik word om 'n pasgemaakte PDF -CV te skep, wat baie nuttig is vir werkstoepassings.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandel -koderingsprojek",
                "text": "'N Gesin van 10+ implementerings van die Rijandel -koderingsalgoritme in 128, 192 en 256 stukkies. Hierdie projek word gebruik om die Rijandel -koderingsalgoritme in verskillende programmeertale te demonstreer. Hierdie projek word gebruik om 'n familie van implementerings van die Rijandel -koderingsalgoritme te skep.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc minecraft mod",
                "text": "'N Minecraft -mod wat pasgemaakte gereedskap, wapenrusting, skare, blokke, afmetings en vele meer funksies by die spel voeg. Gebou met Java-weergawes 8-17 vir Select Minecraft-weergawes tussen 1.16 en 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tiger -programmeringstaal",
                "text": "Pasgemaakte programmeringstaal wat in Go & Rust ingebou is om te eksperimenteer met tolkontwerp en -prestasie. Geïmplementeer op die portefeulje -webwerf met behulp van Web Assembly.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger Tailgating Pros webwerf",
                "text": "'N Webwerf wat ek in 2024 gebou het vir Tiger Tailgating Pros, 'n maatskaplike onderneming in Clemson, SC. Gebou met react.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing Machine Project",
                "text": "Gesin van meer as 30+ implementasies van die Turing -masjien. Word gebruik om die volledigheid van Turing vir verskillende programmeertale vir navorsing te demonstreer, veral vir die Tiger -programmeringstaal.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tiger -programmeringstaal"
    },
    "contact": {
        "title": "Kontak my",
        "header": "Kontakinligting",
        "email": "pattygsocials@gmail.com",
        "description": "Ek reageer op navrae van e -pos, LinkedIn -boodskappe en Instagram -boodskappe. Ek sal ook terugbel as my nommer via CV voorsien word, of andersins, alhoewel ek verkies om my telefoonnommer privaat te hou."
    },
    "formatter": {
        "title": "JSON & YAML Formatter",
        "description": "Die JSON & YAML Formatter is 'n instrument waarmee u JSON- en YAML -lêers kan formateer. Dit is gebou met Go en WebAssembly, en is ontwerp om vinnig en doeltreffend te wees. Die formatter is ontwerp om maklik te gebruik, met 'n eenvoudige koppelvlak waarmee u u JSON- of YAML -kode kan plak en dit met die klik van 'n knoppie formateer.",
        "more_info1": "Raadpleeg die ReadMe in die",
        "more_info2": "JSON/YAML Formatter Repository.",
        "format_as": "Formaat as:",
        "auto_detect": "Outo -opsporing",
        "format": "Formaat"
    },
    "cube_solver": {
        "title": "Rubix Cube Solver",
        "start": "Oplos"
    },
    "tiger": {
        "title": "Tiger taal",
        "description": "Die Tiger -programmeringstaal is 'n pasgemaakte programmeringstaal wat in beide Go en Rust gebou is om te eksperimenteer met tolkontwerp en -prestasie. Geïmplementeer op die portefeulje -webwerf met behulp van Web Assembly. Die Tiger -programmeringstaal is 'n pasgemaakte programmeringstaal wat in beide Go en Rust gebou is om te eksperimenteer met tolkontwerp en -prestasie. Geïmplementeer op die portefeulje -webwerf met behulp van Web Assembly.",
        "more_info1": "Raadpleeg die ReadMe in die",
        "more_info2": "Tiger Programmeringstaal GitHub Repository.",
        "select_engine": "Kies enjin:",
        "tiger_code": "Tiger -kode:",
        "run_tiger": "Hardloop tier",
        "output": "Uitset:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Volledige stapel -sagteware -ingenieur in Sentraal -Florida"
    },
    "copy": {
        "text": "Kopieër",
        "copied": "Gekopieër!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Volg my"
    },
    "languages": {
        "title": "Portefeulje vertaler",
        "description": "Ontdek hoe my portefeulje toeganklik is vir besoekers van regoor die wêreld met ondersteuning vir meer as 100 tale.",
        "global_accessibility": {
            "title": "Globale toeganklikheid",
            "description": "My portefeulje is beskikbaar in meer as {tel} tale, wat dit toeganklik maak vir besoekers van regoor die wêreld. Hierdie meertalige benadering demonstreer my toewyding tot inklusiwiteit en wêreldwye reikwydte in sagteware -ontwikkeling.",
            "stats": {
                "languages_supported": "Tale ondersteun",
                "countries_represented": "Lande verteenwoordig",
                "continents_covered": "Kontinente gedek"
            }
        },
        "features": {
            "title": "Funksies",
            "items": [
                {
                    "title": "Intydse vertaling:",
                    "description": "Skakel tale onmiddellik met die taalkieser oor"
                },
                {
                    "title": "URL-gebaseerde taal:",
                    "description": "Taalvoorkeure word in die URL bewaar"
                },
                {
                    "title": "Inheemse skrifondersteuning:",
                    "description": "Behoorlike weergawe van skrifte soos Arabies, Chinees, Hindi en meer"
                },
                {
                    "title": "Kulturele sensitiwiteit:",
                    "description": "Vertalings beskou kulturele konteks, nie net letterlike betekenisse nie"
                },
                {
                    "title": "SEO het geoptimaliseer:",
                    "description": "Elke taalvariant is geoptimaliseer vir soekenjins"
                }
            ]
        },
        "world_map": {
            "title": "Interaktiewe wêreldkaart",
            "description": "Beweeg oor lande op die kaart om hul ondersteunde tale te sien:",
            "languages_label": "Tale",
            "legend": {
                "supported": "Tale ondersteun",
                "not_supported": "Geen taalondersteuning nie"
            },
            "zoom_controls": {
                "zoom_in": "Inzoomen",
                "zoom_out": "Inzoomen",
                "reset": "Herstel uitsig"
            }
        },
        "supported_languages": {
            "title": "Ondersteunde tale"
        },
        "interactive_country_map": {
            "title": "Interaktiewe landkaart",
            "description": "Beweeg oor lande hieronder om hul ondersteunde tale te sien:",
            "language_count": {
                "single": "taal",
                "multiple": "tale"
            }
        },
        "tooltips": {
            "no_language_support": "Geen taalondersteuning nie"
        }
    },
    "logotext": "Patrick"
}