{
    "name": "Patrick Goodwin sat chachajja.",
    "menu": {
        "home": "Uta",
        "about": "Naya toqetwa .",
        "portfolio": "Cartera ukaxa 1.1.",
        "projects": "Sitio web ukan proyectonakapa .",
        "tiger": "Tiger aruxa .",
        "formatter": "JSON & YAML ukax mä formato uñt’ayatawa.",
        "cube_solver": "Rubix Cubo ukax mä solucionador ukhamawa.",
        "contact": "Nayaruw jawst’apxita ."
    },
    "home": {
        "title": "Uta",
        "animated": {
            "first": "Ingeniero de Software Full Stack ukax mä juk’a pachanakanwa.",
            "second": "Web Desarrollador ukax .",
            "third": "Anatañ Desarrollador .",
            "fourth": "Contenido lurayiri ."
        },
        "footer": "Sitio web ukax jichhax jaqukipatawa & avaliable 100+ arunakan!",
        "descriptionA": "Yatxatat Full-Stack Software Ingeniero & Web Desarrollador ukax mä uñacht’ayat historia de proyectos de desarrollo suma irptaña, Java modificaciones Minecraft ukatak lurañat qalltasa, react.js ukan usuario ukan experienciap jach’anchayañataki ukhamarak Secure REST APIs ukar phuqhaña, ukampirus constantemente metodología ágil ukat efectivo equipo ukan yanapt’asiwipamp irnaqasa.",
        "descriptionB": "Ukhamarus, nayax mä geografía contenido lurayiritwa, jupax walja plataformas de medios sociales ukan algoritmos ukanakar sum aprovechawayi, Instagram, YouTube, ukat Tiktok ukanakax mä respetable ukhamarak engañador base de arkirinakar jikxatañataki.",
        "portfolio_button": "Nayan carterajajj .",
        "contact_button": "Nayaruw jawst’apxita .",
        "about_button": "Naya toqetwa ."
    },
    "about": {
        "title": "Naya toqetwa .",
        "personal_summary": {
            "title": "Jaqinakan suma qhanañchäwipa .",
            "text": "Mä yatxatat Software Software Full Stack ukan Orlando, FL ukan utt’ayata, nayax kunayman tecnologías ukan yatiñanakap uñacht’ayawayta, Java ukat C++ ukanakat react.js ukat node.js ukanakar puriñkama. Mä historial de proyectos de lanza ukampi, ukax mä programa de modificación Java Minecraft ukat mä sitio web recompensa ukanak lurañatakiw utji, nayax irpirinak ukhamarak machaq lurawinakampiw uñacht’ayawayta. Nayan excelencia ukar compromiso uñacht’ayatax qhanaw proyecto gestión ukar agilizar, complejas jan walt’awinak askichaña, ukat jach’a solucionanak puriyaña, ukax experiencia de usuarios ukar ch’amanchañataki ukhamarak organizativo éxito ukar irptañataki."
        },
        "professional_experience": {
            "title": "Profesional ukan experienciapa .",
            "entries": [
                {
                    "jobtitle": "Ingeniero de Software Junior ukax 1.1.",
                    "where": "Orion180 ukax mä seguro ukhamawa.",
                    "date": "2024 - Jichha pacha ."
                },
                {
                    "jobtitle": "Fundador & Full Stack Software Desarrollador ukax mä jach’a uñacht’äwiwa.",
                    "where": "SupremeMC ukax mä jach’a uñacht’äwiwa.",
                    "date": "2020 - 2024 marana."
                },
                {
                    "jobtitle": "Ingeniero de Software Full Stack ukax mä juk’a pachanakanwa.",
                    "where": "Acelerado yatiqaña .",
                    "date": "2023 marana."
                },
                {
                    "jobtitle": "P’iqinchir Web Desarrollador (yatiqir programa) .",
                    "where": "Clemson jach’a yatiqañ utan GDI ukan wakichäwipa .",
                    "date": "2021 - 2022 marana."
                },
                {
                    "jobtitle": "Escritorio ukan uñjiri .",
                    "where": "Clemson jach’a yatiqañ uta .",
                    "date": "2021 - 2022 marana."
                }
            ]
        },
        "technical_skills": {
            "title": "Técnica ukan yatiñanakapa .",
            "header1": "Programación Arunaka .",
            "header2": "Marco & Bibliotecas ukanakax .",
            "header3": "Herramientas & Tecnologías ukat juk’ampinaka."
        },
        "services": {
            "title": "Nayan Servicionakajajj .",
            "entries": [
                {
                    "title": "Ingeniería de Pila Phuqata .",
                    "text": "Nayax front-end ukhamarak back-end desarrollo ukanx mä jach’a solucionanak uñacht’ayta, asegurar integración sin costuras y funcionalidad en todo el pila de software."
                },
                {
                    "title": "Web Desarrollo ukax 1.1.",
                    "text": "HTML, CSS, ukat JavaScript marcos ukanakan yatiñanakapampix React.js ukham uñt’atawa, nayax uñjkañ aski ukat apnaqir sitios web ukanakan luratawa, ukax clientes ukanakan específicos munañanakapamp ukat munañanakapamp phuqhañatakiw wakicht’ata."
                },
                {
                    "title": "Anatañanak luraña .",
                    "text": "Aprovechando a lenguas como Java y C++, Nayax especializayätwa experiencias de juegos inmersivos ukanakan lurañataki, concepto ukat diseño ukat implementación ukat optimización ukanak lurañataki, asegurar engañador de juegos ukat suave rendimiento."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Cartera ukaxa 1.1.",
        "filter_by": "Filtro Cartera ukaxa: 1.1.",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca Json ukax mä jach’a uñacht’äwiwa.",
                "text": "Mä proyecto Python ukax arut jaqukipäwinak agilizar. Nayan cartera de sitio web ukax 70+ arunakar jaqukipataw sañ muni, ukax español, francés, chino, árabe, ukat walja yaqha arunakampiw jaqukipata. Aka proyectox mä cartera de sitios web multilingüe uñstayañatakiw apnaqasi, ukax wali askiwa mä jach’a audiencia ukar puriñapataki. Aka proyecto ukampixa, 99% jila uraqpachanxa cartera ukaxa mä suma arumpiwa liyt’aspa.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Pusi .",
                "text": "Massive familia ukax 50+ jila implementaciones de la Connect Four anatäwiwa. Aka proyectox 30 jila kunayman programación arunakan phuqhawinakapawa, Java, C++, Python, JavaScript ukat juk’ampinakaw utji. Ukhamarus, ukax 20+ jila kunayman marco jan ukax yaqha formatos ukanakaw utjaraki, React.JS, Ruby on Rails, ASP.NET, ukat juk’ampinakaw utjaraki.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Interop proyecto ukax 1.1.",
                "text": "Mä proyecto ukax kunayman programación arunakan interoperabilidad ukar qillqt’atawa. Jichhax 15 kunayman programación arunakaw utji ukatx 18 patrones de ejecución ukanakaw utji.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "JSON & YAML auto formato ukax mä juk’a pachanakanwa.",
                "text": "Mä Linter & Autoformatter JSON & YAML uka qillqatanakataki. Aka proyectox JSON & YAML ukan archivonakap formato ukar uñt’ayañatakiw apnaqasi, ukax wali askiwa código q’uma ukat wakicht’añataki. GO ukamp luratawa, webssembly ukamp apthapita, ukat cartera ukar mä proyecto sitio web ukham uñt’ayata. Jutïr pachan juk’amp formatos ukanakaw jutani.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft json generador ukax mä juk’a pachanakanwa.",
                "text": "Lightweight JSON Generador ukax Python ukan luratawa, Minecraft Resource & Data Packs ukataki. Aka proyecto ukax JSON archivos Minecraft mods ukatak lurañatakiw apnaqasi, ukax costumbre, bloques ukat entidades ukanakaw utji. Wali askiwa jan DataPacks costumbres ukanaka lurañataki, jan ukasti mods ukanakataki ukhamaraki MOD suti mayjt’ayaña tuqi.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Nayan yatichäw experienciaja .",
                "text": "Proyectos personales ukanakamp chika, yatichäw experienciat walja yatiñanak jikxatawayta. Aka tuqir ch’iqt’am, juk’amp yatxatañatakix LinkedIn ukan uñt’ayasiñapataki.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Nayan Profesional experienciaja .",
                "text": "Proyectos personales ukanakamp chika, experiencia profesional ukan walja yatiñanak jikxatawayta. Aka tuqir ch’iqt’am, juk’amp yatxatañatakix LinkedIn ukan uñt’ayasiñapataki.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Goodwin Cartera ukax mä sitio web ukanw uñt’ayasi.",
                "text": "Aka sitio web ukax sitio web de cartera personal ukawa, react.js ukamp luratawa. Aka proyectox yatiñanakax ukat proyectos uñacht’ayañatakiw apnaqasi, ukhamarak mä plataforma uñacht’ayañataki, ukhamat irnaqir masinakax nayar jawst’apxañapataki. Aka proyectox mä profesional online ukan uñt’ayasiñapatakiw apnaqasi.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patrick's Lua Script ukax mä jach'a uñacht'äwiwa.",
                "text": "Mä aski biblioteca Lua Scripts jutïr uñakipañataki. Aka biblioteca ukax Lua scripts ukan lurawinakar automatizar sañ muni, ukax rendimiento-needy lurawinakatakix wali askiwa, kunatix Lua ukax jilpachax mä scripting lengua ukhamawa Python ukat Ruby ukanakat sipansa.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrick ukan Microsoft Excel ukan scripts ukanakax (VBA) ukan uñt'ayatawa.",
                "text": "Mä aski biblioteca VBA scripts Microsoft Excel ukataki. Aka biblioteca ukaxa Excel ukana lurawinakaru automatizar lurañataki apnaqatarakiwa.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Patrick ukax Neovim Config ukan uñt'ayatawa.",
                "text": "Nayan Configuración Personal de Neovim ukax wali askiwa. Aka proyectox Neovim ukarux nayan munañajaruw configurar, ukax costumbre keybindings, temas ukat plugins ukanakaw utji. Aka proyectox Neovim ukar juk’amp apnaqañapatakiw apnaqasi ukat nayan apnaqañatakix wali askiwa.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patrick ukax mä generador ukhamawa.",
                "text": "Mä generador del Condado de Estados Unidos & Mapa Estatal, Python ukamp luratawa Geopandas ukat Matplotlib bibliotecas ukanakamp apnaqasa. Aka proyectox Estados Unidos markan mapanakap lurañatakiw apnaqasi, ukax markan ukhamarak estado ukanakan mapanakapaw utji. Aka proyectox datos uñacht’ayañataki ukhamarak uñakipañatakiw mapas costumbres ukanakax lurasi.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patrick's PowerShell Script ukax mä jach'a uñacht'äwiwa.",
                "text": "Mä aski biblioteca de scripts de PowerShell jutïr uñakipañataki. $Profile Script ukampi aski, nayax aka jach’a yanapt’aw jikxatta, terminal de Windows ukan lurawinakar automatizar lurañataki, kunatix nayax Windows OS ukan sapa kuti apnaqirïtwa.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patrick's Ruby Script ukax mä jach'a uñacht'äwiwa.",
                "text": "Mä aski biblioteca de ruby ​​scripts jutïr uñakipañataki. Jutïr rubí jutïritakix wali askiwa, riles desarrollo uka amuyunaka.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF Yatiñanaka luraña .",
                "text": "Mä PDF lurayirix PDHIT ukat Jinja2 extensiones ukanakampiw Python ukamp lurata, HTML ukat JSON formato ukanakamp chika. Aka proyectox PDF archivonak mä lista de habilidades ukat proyectos ukanakat lurañatakiw apnaqasi. Aka proyectox mä currículum PDF costumbre lurañatakiw apnaqasispa, ukax irnaqäw apnaqañatakix wali askiwa.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandel ukax mä proyecto de cifrado ukhamawa.",
                "text": "Mä familia 10+ implementaciones de algoritmo de cifrado de Rijandel 128, 192, ukat 256 bits ukanakan. Aka proyectox kunayman programación arunakan algoritmo de cifrado Rijandel ukar uñacht’ayañatakiw apnaqasi. Aka proyectox mä familia de implementaciones uka lurañatakiw apnaqasi, ukax algoritmo de cifrado de Rijandel ukawa.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "SupremeMC Minecraft Mod ukax mä jach’a uñacht’äwiwa.",
                "text": "Mä Mod Minecraft ukax herramientas personalizadas, armaduras, mobs, bloques, dimensiones ukat juk’amp walja lurawinakampiw uka anatäwir yapxati. Java versión 8-17 ukampi luratawa, Minecraft ajllitanakata 1.16 ukat 1.20 ukjakama.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tigre programación ukax 1.1.",
                "text": "GO & Rust ukan lurat programación costumbre ukax diseño interpretador ukat rendimiento ukanakamp yant’añatakiw lurata. Cartera ukan sitio web ukan Asamblea Web ukan phuqhachata.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tigre Tailgating Pros ukax mä sitio web ukankiwa.",
                "text": "Mä sitio web ukax 2024 maran Tigre Tailgating Pros ukan luratawa, mä empresa tailgating Clemson, SC. Ukax react.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing Máquina Proyecto ukax 1.1.",
                "text": "Familia de 30+ implementaciones de la máquina de Turing. turing phuqhat uñacht’ayañatakiw apnaqasi kunayman programación arunakatakix yatxatañataki, juk’ampis tigre programación arutaki.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tigre programación ukax 1.1."
    },
    "contact": {
        "title": "Nayaruw jawst’apxita .",
        "header": "Uñt’ayañataki yatiyawi .",
        "email": "pattygsocials@gmail.com ukax mä jach’a uñacht’äwiwa.",
        "description": "Nayax correo electrónico, LinkedIn mensajes ukat Instagram mensajes ukanakat jiskt’äwinakaruw jayst’ta. Ukat currículum vitae jan ukajj yaqha ukhamanak via currículum vitae toqejj numerojajj churatächi ukhajja, kuttʼayarakïwa, ukampis teléfono numerojajj privado ukham imañwa munta."
    },
    "formatter": {
        "title": "JSON & YAML ukax mä formato uñt’ayatawa.",
        "description": "JSON & YAML formatter ukax mä herramienta ukawa, ukax JSON ukat YAML ukan archivonakap formatear uñt’ayañatakiw yanapt’i. Ukax GO ukat webssembling ukampiw lurasi, ukat ukax jank’akiw ukat wali suma lurañatakiw wakicht’ata. Formater ukax mä jasak apnaqañatakiw wakicht’ata, mä interfaz simple ukampi, ukax código JSON jan ukax YAML ukar uñt’ayañatakiw ukat formato ukax mä botón ukar ch’iqt’añatakiwa.",
        "more_info1": "Juk’amp yatxatañatakixa, ReadMe ukar uñakipt’aña .",
        "more_info2": "JSON/YAML ukax formato ukan imañapawa.",
        "format_as": "Formato ukax: 1.1.",
        "auto_detect": "Auto Detect ukax 1000 ukhaniwa.",
        "format": "Formato ukax 1.1."
    },
    "cube_solver": {
        "title": "Rubix Cubo ukax mä solucionador ukhamawa.",
        "solve": "Askichaña"
    },
    "tiger": {
        "title": "Tiger aruxa .",
        "description": "Tigre programación aruxa mä costumbre programación aruwa Go & Rust ukan luratawa, diseñar interpretador ukat rendimiento ukanakamp yant’añataki. Cartera ukan sitio web ukan Asamblea Web ukan phuqhachata. Tigre programación aruxa mä costumbre programación aruwa Go & Rust ukan luratawa, diseñar interpretador ukat rendimiento ukanakamp yant’añataki. Cartera ukan sitio web ukan Asamblea Web ukan phuqhachata.",
        "more_info1": "Juk’amp yatxatañatakixa, ReadMe ukar uñakipt’aña .",
        "more_info2": "Tigre programación aru GitHub ukan imaña.",
        "select_engine": "Motor ajlliñamawa:",
        "tiger_code": "Tigre ukan uñt’ayawipa:",
        "run_tiger": "Tʼijuñ Tigre .",
        "output": "Ukax akham sañ muni: ."
    },
    "tab": {
        "title": "Patrick Goodwin sat chachajja.",
        "description": "Ingeniero de Software Full Stack ukax Florida Central uksan utt’ayatawa ."
    },
    "copy": {
        "text": "Ukax mä copia .",
        "copied": "¡Copied!"
    },
    "social_media": {
        "github": "Github ukax mä jach’a uñacht’äwiwa.",
        "instagram": "Instagram ukax mä jach’a uñacht’äwiwa.",
        "linkedin": "LinkedIn ukax mä jach’a uñacht’äwiwa.",
        "tiktok": "Tiktok ukax mä juk’a pachanakanwa.",
        "youtube": "YouTube ukax 1.0.",
        "text_strip": "Nayar arktapxita ."
    },
    "logotext": "Patrick sat chachajja."
}