{
    "name": "Patrick goodwin",
    "menu": {
        "home": "Evdə",
        "about": "Mənim haqqımda",
        "portfolio": "Portfel",
        "tiger": "Pələng dili",
        "contact": "Mənimlə əlaqə saxlayın"
    },
    "home": {
        "title": "Evdə",
        "animated": {
            "first": "Tam yığma proqramı mühəndisi",
            "second": "Veb inkişaf etdiricisi",
            "third": "Game Geliştirici",
            "fourth": "Məzmun yaradıcısı"
        },
        "descriptionA": "Təcrübəli tam yığma proqramı mühəndis və veb inkişaf etdirici, reaksiya və effektiv komanda əməkdaşlığını ardıcıl olaraq istifadəçi təcrübəsini inkişaf etdirmək üçün Minecraft üçün Java təvazökarlığı üçün Java dəyişiklikləri yaratmaq və etibarlı istirahət edən API-lərin həyata keçirilməsini təmin edir.",
        "descriptionB": "Bundan əlavə, mən birdən çox sosial media platformasının, o cümlədən birdən çox sosial media platformasının alqoritmlərini, həcmli və cəlbedici izləyici bazası əldə etmək üçün bir çox sosial media platformasının alqoritmlərini uğurla istifadə edən bir coğrafiya məzmunu yaradıcısıyam.",
        "portfolio_button": "Mənim portfelim",
        "contact_button": "Mənimlə əlaqə saxlayın",
        "about_button": "Mənim haqqımda"
    },
    "about": {
        "title": "Mənim haqqımda",
        "personal_summary": {
            "title": "Şəxsi xülasə",
            "text": "Orlando, FL-də yerləşən təcrübəli tam yığma proqramı geliştiricisi olaraq, Java və C ++-dən, reaksiya və node.js-ə qədər müxtəlif texnologiyalarda təcrübə nümayiş etdirdim. Minecraft və yük maşını sürücüləri üçün Java modifikasiyası proqramının inkişafı da daxil olmaqla, liderlik və yenilik nümayiş etdirdim. Mükəmməlliyə dair öhdəliyim, layihə idarəçiliyini tənzimləmək, mürəkkəb problemləri həll etmək və istifadəçi təcrübəsini artıran və təşkilati uğuru inkişaf etdirən yüksək keyfiyyətli həllər vermək bacarığımda aydındır."
        },
        "professional_experience": {
            "title": "Peşəkar təcrübə",
            "entries": [
                {
                    "jobtitle": "Junior Software Mühəndis",
                    "where": "Orion180 Sığorta",
                    "date": "2024 - indiki"
                },
                {
                    "jobtitle": "Təsisçi və Tam Stack Proqram Developer",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Tam yığma proqramı mühəndisi",
                    "where": "Tədarükü sürətləndirmək",
                    "date": "2023"
                },
                {
                    "jobtitle": "Qurğuşun Veb Developer (Tələbə Proqramı)",
                    "where": "Clemson Universiteti GDI proqramı",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Masa nəzarətçisi",
                    "where": "Clemson Universiteti",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Texniki bacarıq",
            "header1": "Proqramlaşdırma dilləri",
            "header2": "Çərçivə və kitabxanalar",
            "header3": "Alətlər və texnologiyalar"
        },
        "services": {
            "title": "Xidmətlərim",
            "entries": [
                {
                    "title": "YAXŞI TƏKLİF",
                    "text": "Bütün proqram yığını boyunca sorunsuz inteqrasiya və funksionallığı təmin edən həm ön, həm də arxa inkişafda hərtərəfli həllər təklif edirəm."
                },
                {
                    "title": "Veb inkişafı",
                    "text": "HTML, CSS və JavaScript çərçivəsində təcrübə ilə reaksiya verdikləri kimi, müştərilərin xüsusi ehtiyacları və üstünlükləri ilə tanış olmaq üçün vizual cəlbedici və istifadəçi dostu saytları hazırlayır."
                },
                {
                    "title": "Oyun inkişafı",
                    "text": "Java və C ++ kimi dilləri istifadə edərək, mən konsepsiya və dizayndan immersiv oyun təcrübələri yaratmaqda, tətbiqi və optimallaşdırmanın və optimallaşdırmanın, oyun oyunu və hamar performansın təmin edilməsini təmin etmək üçün ixtisaslaşıram."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfel",
        "filter_by": "Filtr portfelini:",
        "entries": {
            "connect_four": {
                "title": "Dördünü bağlayın",
                "text": "Dörd oyunun 50-dən çox + həyata keçirilməsinə kütləvi ailə. Bu layihəyə Java, C ++, Python, JavaScript və sair də daxil olmaqla 30-dan çox müxtəlif proqramlaşdırma dillərində tətbiqlər daxildir. Bundan əlavə, bu, 20-dən çox müxtəlif çərçivə və ya digər formatlar, o cümlədən reaksiya, relslərdə yaqut, asp.net və s.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "İnterop layihəsi",
                "text": "Fərqli proqramlaşdırma dilləri arasında qarşılıqlı əlaqəni sənədləşdirən bir layihə. Hal-hazırda 15 fərqli proqramlaşdırma dilləri və 18 icra nümunəsi daxildir.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "excel_scripts": {
                "title": "Microsoft Excel elektron tablo skriptləri (vba)",
                "text": "Microsoft Excel üçün VBA skriptlərinin faydalı bir kitabxanası. Bu kitabxana Excel elektron tablolarında vəzifələri avtomatlaşdırmaq üçün istifadə olunur.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "minecraft_json_generator": {
                "title": "Minecraft json generatoru",
                "text": "Minecraft Resource & Məlumat paketləri üçün Pythonda qurulan yüngül JSON generatoru. Bu layihə, xüsusi əşyalar, bloklar və qurumlar da daxil olmaqla Minecraft modları üçün JSON faylları yaratmaq üçün istifadə olunur. Yalnız xüsusi datapaklar yaratmaq üçün deyil, həm də mod adın dəyişdirilməsi xüsusiyyəti ilə də modlar üçün çox faydalıdır.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Təhsil təcrübəm",
                "text": "Şəxsi layihələrimlə yanaşı, təhsil təcrübəsindən də çox sayda bacarıq əldə etdim. Daha çox məlumat üçün LinkedIn profilimə baxmaq üçün buraya vurun.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Peşəkar təcrübəm",
                "text": "Şəxsi layihələrimlə yanaşı, peşəkar təcrübədən çox sayda bacarıq əldə etdim. Daha çox məlumat üçün LinkedIn profilimə baxmaq üçün buraya vurun.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Goodwin Portfel veb saytı",
                "text": "Bu veb sayt, reaksiya ilə qurulmuş şəxsi portfel veb saytımdır. Bu layihə bacarıq və layihələrimi nümayiş etdirmək, eləcə də potensial işəgötürənlər üçün bir platforma təmin etmək üçün istifadə olunur. Bu layihə peşəkar bir onlayn varlığı yaratmaq üçün istifadə olunur.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patrick's Lua Script Kitabxanası",
                "text": "Gələcək istinad üçün Lua skriptlərinin faydalı bir kitabxanası. Bu kitabxana Lua skriptlərində işlərini avtomatlaşdırmaq üçün istifadə olunur, bu da performanslı tapşırıqlar üçün lazımlı ola bilər, çünki Lua, həm də piton və yaqutdan daha sürətli bir skriptli bir dildir.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "neovim_config": {
                "title": "Patrick'in Neovim konfiqurasiyası",
                "text": "Şəxsi Neovim konfiqurasiyam. Bu layihə, Neovimi öz bəyəndiyimə, o cümlədən xüsusi düymə, mövzular və plaginlər üçün konfiqurasiya etmək üçün istifadə olunur. Bu layihə, Neovim'in şəxsi istifadəsi üçün daha çox istifadəçi dostu və səmərəli etmək üçün istifadə olunur.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patrick'in Xəritə Generatoru",
                "text": "GeoPandaları və matplotlib kitabxanalarından istifadə edərək Python ilə qurulan Amerika Birləşmiş Ştatları və Dövlət Xəritə Yaradan. Bu layihə Birləşmiş Ştatların xəritələrini, ilçe və dövlət xəritələri daxil olmaqla istifadə olunur. Bu layihə məlumat vizuallaşdırma və təhlil üçün xüsusi xəritələr yaratmaq üçün istifadə olunur.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patrick'in Powershell Script Kitabxanası",
                "text": "Gələcək istinad üçün PowerShell skriptlərinin faydalı bir kitabxanası. $ Profaz skript xüsusiyyəti ilə faydalıdır, Windows OS-nin tez-tez istifadəçisiyəm, çünki Windows OS-nin tez-tez istifadəçisiyəm, çünki Windows OS istifadəçisiyəm.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patrick'in Yaqut Ssenari Kitabxanası",
                "text": "Gələcək arayış üçün yaqut skriptlərinin faydalı bir kitabxanası. Relslərin inkişaf anlayışlarında gələcək yaqut üçün faydalıdır.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF bacarıqları qurucusu",
                "text": "HTML və JSON Formating ilə birlikdə PDFKIT və Jinja2 uzantıları ilə Python ilə birlikdə hazırlanmış xüsusi bir PDF qurucusu. Bu layihə bacarıq və layihələrin siyahısından PDF sənədləri yaratmaq üçün istifadə olunur. Bu layihə, iş tətbiqləri üçün çox faydalı olan xüsusi bir PDF CV-ləri yaratmaq üçün istifadə edilə bilər.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandel şifrələmə layihəsi",
                "text": "128, 192 və 256 bitdə Rijandel şifrələmə alqoritminin 10 + həyata keçirilməsinə bir ailə. Bu layihə, Rijandel şifrələmə alqoritmini müxtəlif proqramlaşdırma dillərində nümayiş etdirmək üçün istifadə olunur. Bu layihə Rijandel şifrələmə alqoritminin tətbiqi ailəsi yaratmaq üçün istifadə olunur.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod",
                "text": "Xüsusi alətlər, zirehlər, mobs, bloklar, ölçülər və oyuna daha çox xüsusiyyətləri əlavə edən bir minecraft mod. 1.16 ilə 1.20 arasındakı Minecraft versiyaları üçün Java versiyaları 8-17 ilə inşa edilmişdir.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tiger proqramlaşdırma dili",
                "text": "Hər iki Go və pasda inşaatçı dizaynı və performansını sınaqdan keçirtmək üçün xüsusi proqramlaşdırma dili. Veb Məclisindən istifadə edərək portfel veb saytında tətbiq olunur.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger Tailgating ProS veb saytı",
                "text": "Clemson, SC-də bir quyruqlu bir şirkət Tiger Tailgating Pros üçün 2024-cü ildə inşa etdiyim bir veb sayt. Reaksiya ilə qurulmuşdur.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing Maşın Layihəsi",
                "text": "Turing maşınının 30-dan çox + həyata keçirilməsinə. Tədqiqat üçün müxtəlif proqramlaşdırma dilləri üçün, xüsusən də pələng proqramlaşdırma dili üçün turing tamlığını nümayiş etdirmək üçün istifadə olunur.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tiger proqramlaşdırma dili"
    },
    "contact": {
        "title": "Mənimlə əlaqə saxlayın",
        "header": "Əlaqə haqqında məlumat",
        "email": "pattygsocials@gmail.com",
        "description": "E-poçt, LinkedIn mesajları və İnstaqram mesajlarından soruşuram. Telefon nömrəmi özəl saxlamağı üstün tuturam, mən də nömrəm CV və ya başqa şəkildə təmin olunarsa, geri çağıracağam."
    },
    "tiger": {
        "title": "Pələng dili",
        "description": "Tiger proqramlaşdırma dili, həm yolda, həm də pasda in tərcüməçi dizaynı və performansını sınaqdan keçirmək üçün hazırlanmış xüsusi bir proqramlaşdırma dilidir. Veb Məclisindən istifadə edərək portfel veb saytında tətbiq olunur. Tiger proqramlaşdırma dili, həm yolda, həm də pasda in tərcüməçi dizaynı və performansını sınaqdan keçirmək üçün hazırlanmış xüsusi bir proqramlaşdırma dilidir. Veb Məclisindən istifadə edərək portfel veb saytında tətbiq olunur.",
        "more_info1": "Daha çox məlumat üçün, oxunanlara baxın",
        "more_info2": "Tiger Proqramlaşdırma Dili Github depo.",
        "select_engine": "Mühərriki seçin:",
        "tiger_code": "Tiger Kodu:",
        "run_tiger": "Pələng işlətmək",
        "output": "Çıxdı:"
    },
    "tab": {
        "title": "Patrick goodwin",
        "description": "Mərkəzi Florida əsaslı tam yığma proqram mühəndisi"
    },
    "social_media": {
        "github": "Gitub",
        "instagram": "İnstaqram",
        "linkedin": "Linkedin",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Arzulamaq"
    },
    "logotext": "Patrik"
}