{
    "name": "Патрык Гудвін",
    "menu": {
        "home": "Дом",
        "about": "Пра мяне",
        "portfolio": "Партфель",
        "projects": "Праекты вэб -сайта",
        "tiger": "Тыгровая мова",
        "formatter": "Json & Yaml Formatter",
        "cube_solver": "Rubix Cube Solver",
        "contact": "Звяжыцеся са мной"
    },
    "home": {
        "title": "Дом",
        "animated": {
            "first": "Поўны інжынер праграмнага забеспячэння",
            "second": "Вэб -распрацоўшчык",
            "third": "Распрацоўшчык гульняў",
            "fourth": "Стваральнік зместу"
        },
        "footer": "Цяпер вэб -сайт перакладзены і даступны на 100+ мовах!",
        "descriptionA": "Дасведчаны інжынер для праграмнага забеспячэння і вэб-распрацоўшчык з прадэманстраванай гісторыяй паспяхова вядучых праектаў распрацоўкі: ад стварэння мадыфікацый Java для Minecraft да паляпшэння карыстацкага досведу ў React.js і рэалізацыі бяспечных API REST, пры гэтым паслядоўна выкарыстоўваючы Agile метадалогіі і эфектыўнае супрацоўніцтва ў камандзе.",
        "descriptionB": "Акрамя таго, я стваральнік геаграфіі, які паспяхова выкарыстаў алгарытмы некалькіх платформаў сацыяльных медыя, у тым ліку Instagram, YouTube і Tiktok, каб атрымаць рэспектабельную і прывабную базу паслядоўнікаў.",
        "portfolio_button": "Мой партфель",
        "contact_button": "Звяжыцеся са мной",
        "about_button": "Пра мяне"
    },
    "about": {
        "title": "Пра мяне",
        "personal_summary": {
            "title": "Асабісты рэзюмэ",
            "text": "Як дасведчаны распрацоўшчык праграмнага забеспячэння для поўнага стэка, які базуецца ў Арланда, штат Фларыда, я прадэманстраваў вопыт у розных тэхналогіях: ад Java і C ++ да React.js і Node.js. З вынікамі ўзначальных праектаў, у тым ліку распрацоўкі праграмы мадыфікацыі Java для Minecraft і карыснага сайта для вадзіцеляў грузавікоў, я дэманстраваў кіраўніцтва і інавацыі. Мая прыхільнасць да дасканаласці выяўляецца ў маёй здольнасці ўпарадкаваць кіраванне праектамі, вырашаць складаныя праблемы і забяспечваць якасныя рашэнні, якія паляпшаюць карыстацкі досвед і забяспечваюць арганізацыйны поспех."
        },
        "professional_experience": {
            "title": "Прафесійны досвед",
            "entries": [
                {
                    "jobtitle": "Малодшы інжынер праграмнага забеспячэння",
                    "where": "Страхаванне Orion180",
                    "date": "2024 г. - падарунак"
                },
                {
                    "jobtitle": "Заснавальнік і поўны распрацоўшчык праграмнага забеспячэння",
                    "where": "Supememc",
                    "date": "2020 - 2024 год"
                },
                {
                    "jobtitle": "Поўны інжынер праграмнага забеспячэння",
                    "where": "Паскарыць навучанне",
                    "date": "2023"
                },
                {
                    "jobtitle": "Вядучы вэб -распрацоўшчык (студэнцкая праграма)",
                    "where": "Праграма GDI Універсітэта Клемсана",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Кіраўнік стала",
                    "where": "Універсітэт Клемсана",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Кіраўнік стала",
                    "where": "Універсітэт Клемсана",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Тэхнічныя навыкі",
            "header1": "Мовы праграмавання",
            "header2": "Рамкі і бібліятэкі",
            "header3": "Інструменты і тэхналогіі"
        },
        "services": {
            "title": "Мае паслугі",
            "entries": [
                {
                    "title": "Поўная інжынерыя стэка",
                    "text": "Я прапаную комплексныя рашэнні як у пярэднім і заднім развіцці, забяспечваючы бесперашкодную інтэграцыю і функцыянальнасць ва ўсім стэку праграмнага забеспячэння."
                },
                {
                    "title": "Веб -распрацоўка",
                    "text": "З вопытам у рамках HTML, CSS і JavaScript, такіх як React.js, я вырабляю візуальна прывабныя і зручныя для карыстальнікаў вэб-сайты з улікам задавальнення канкрэтных патрэбаў і пераваг кліентаў."
                },
                {
                    "title": "Распрацоўка гульняў",
                    "text": "Выкарыстоўваючы мовы, такія як Java і C ++, я спецыялізуюся на стварэнні захапляльных гульнявых вопыту: ад канцэпцыі і дызайну да рэалізацыі і аптымізацыі, забеспячэння ўцягвання гульнявога працэсу і гладкіх характарыстык."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Партфель",
        "filter_by": "Партфель фільтра па:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca Json",
                "text": "Праект Python, які ўпарадкуе пераклады мовы. Дазваляе свой партфель майго сайта перакласці на 70+ моў, у тым ліку іспанскі, французскі, кітайскі, арабскі і многія іншыя. Гэты праект выкарыстоўваецца для стварэння шматмоўнага партфеля вэб -сайтаў, які вельмі карысны для дасягнення шырокай аўдыторыі. З дапамогай гэтага праекта больш за 99% свету можа прачытаць мой партфель на свабоднай мове.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Падключыце чатыры",
                "text": "Масіўная сямейства з больш чым 50+ рэалізацый гульні Connect Four. Гэты праект ўключае ў сябе рэалізацыю на больш чым 30 розных мовах праграмавання, у тым ліку Java, C ++, Python, JavaScript і шмат іншага. Акрамя таго, ён таксама ўключае ў сябе больш за 20+ розных рамак ці іншых фарматаў, у тым ліку React.js, Ruby на Rails, ASP.NET і многае іншае.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "Прадуктовае прыкладанне",
                "text": "Поўнае прыкладанне Server .NET 9 Blazor Server для кіравання прадуктовымі прадметамі. Дадатак ідзе за кантролерам/сховішчам/сховішчам з ядром Entity Framework для ўстойлівасці і ўключае ў сябе ўсебаковы тэставы набор.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Праект Interop",
                "text": "Праект, які дакументуе ўзаемадзеянне паміж рознымі мовамі праграмавання. У цяперашні час уключае 15 розных моў праграмавання і 18 мадэляў выканання.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Рэестр інвентарызацыі",
                "text": "Рэестр продажаў (POS) у поўным аб'ёме (POS) у сістэме кіравання запасамі, пабудаванай з Angular 17+ і Node.js. Гэта прыкладанне дэманструе сістэму POS POS-класа з аўтэнтыфікацыяй карыстальніка, кантролем доступу на роле, адсочваннем запасаў і апрацоўкай плацяжоў.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "Json & Yaml Auto Formatter",
                "text": "Linter & AutoFormatter для файлаў JSON & YAML. Гэты праект выкарыстоўваецца для фарматавання файлаў JSON & YAML, што вельмі карысна для падтрымання ачысткі і арганізаванага кода. Пабудаваны з GO, складзены з WebAssembly і ўбудаваны ў мой партфель у якасці праекта сайта. У будучыні прыйдзе больш фарматаў.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON Generator",
                "text": "Лёгкі генератар JSON, пабудаваны ў Python для пакетаў Minecraft Resource & Data. Гэты праект выкарыстоўваецца для стварэння файлаў JSON для Minecraft Mods, уключаючы карыстацкія элементы, блокі і суб'екты. Вельмі карысна не толькі для стварэння карыстацкіх дадзеных, але і для модаў, а таксама праз функцыю пераключэння мода.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Мой адукацыйны вопыт",
                "text": "Нараўне з маімі асабістымі праектамі я таксама набыў шматлікія навыкі з адукацыйнага вопыту. Націсніце тут, каб прагледзець мой профіль LinkedIn для атрымання дадатковай інфармацыі.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Мой прафесійны вопыт",
                "text": "Нараўне з маімі асабістымі праектамі я таксама набыў шматлікія навыкі з прафесійнага вопыту. Націсніце тут, каб прагледзець мой профіль LinkedIn для атрымання дадатковай інфармацыі.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Сайт партфеля Patrick Goodwin",
                "text": "Гэты вэб -сайт - мой асабісты вэб -сайт партфеля, пабудаваны з React.js. Гэты праект выкарыстоўваецца для дэманстрацыі маіх навыкаў і праектаў, а таксама для прадастаўлення платформы для патэнцыяльных працадаўцаў, якія могуць звязацца са мной. Гэты праект выкарыстоўваецца для стварэння прафесійнай прысутнасці ў Інтэрнэце.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Бібліятэка сцэнарыя Lua Patrick's",
                "text": "Карысная бібліятэка сцэнарыяў Lua для будучай даведкі. Гэтая бібліятэка выкарыстоўваецца для аўтаматызацыі задач у сцэнарыях Lua, якія могуць спатрэбіцца для выканання задач, паколькі Луа звычайна больш хуткая мова сцэнарыяў, чым Python, і Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Сцэнарыі электронных табліц Patrick Microsoft Excel (VBA)",
                "text": "Карысная бібліятэка сцэнарыяў VBA для Microsoft Excel. Гэтая бібліятэка выкарыстоўваецца для аўтаматызацыі задач у электронных табліцах Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Neovim Config Патрыка",
                "text": "Мая асабістая канфігурацыя Neovim. Гэты праект выкарыстоўваецца для налады Neovim на мой густ, уключаючы карыстацкія клавішы, тэмы і убудовы. Гэты праект выкарыстоўваецца для таго, каб зрабіць Neovim больш зручным і эфектыўным для майго асабістага карыстання.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Генератар карт Патрыка",
                "text": "Генератар карт акругі ЗША і дзяржаўныя карты, пабудаваны з Python з выкарыстаннем бібліятэк Geopandas і Matplotlib. Гэты праект выкарыстоўваецца для стварэння карт ЗША, уключаючы карты акругі і дзяржаў. Гэты праект выкарыстоўваецца для стварэння карыстацкіх карт для візуалізацыі і аналізу дадзеных.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Бібліятэка сцэнарыя Patrick's PowerShell",
                "text": "Карысная бібліятэка сцэнарыяў PowerShell для будучай даведкі. Карысна з функцыяй сцэнарыя $ Profile, я лічу, што гэта вельмі карысна для аўтаматызацыі задач з тэрмінала Windows, бо я часты карыстальнік АС Windows.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Бібліятэка сцэнарыям Патрыка",
                "text": "Карысная бібліятэка сцэнарыяў Ruby для будучай даведкі. Карысна для будучых канцэпцый развіцця Ruby on Rails.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF Skills Builder",
                "text": "Карыстальніцкі PDF -будаўнік, пабудаваны з Python праз пашырэнні Pdfkit і Jinja2, а таксама HTML і JSON Formating. Гэты праект выкарыстоўваецца для стварэння файлаў PDF са спісу навыкаў і праектаў. Гэты праект можа быць выкарыстаны для стварэння карыстацкага рэзюмэ PDF, што вельмі карысна для прыкладанняў для працы.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Праект шыфравання Rijandel",
                "text": "Сямейства з 10+ рэалізацый алгарытму шыфравання Rijandel у 128, 192 і 256 бітах. Гэты праект выкарыстоўваецца для дэманстрацыі алгарытму шыфравання Rijandel на розных мовах праграмавання. Гэты праект выкарыстоўваецца для стварэння сям'і рэалізацыі алгарытму шыфравання Rijandel.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Мод Suprememc Minecraft",
                "text": "Minecraft Mod, які дадае ў гульню карыстацкія інструменты, даспехі, мафіі, блокі, памеры і шмат іншых функцый. Убудаваны з версіямі Java 8-17 для выбраных версій Minecraft паміж 1,16 і 1,20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Мова праграмавання тыгра",
                "text": "Карыстальніцкая мова праграмавання, пабудаваная як у Go, так і ў іржы, каб эксперыментаваць з дызайнам перакладчыка і прадукцыйнасцю. Рэалізуецца на сайце партфеля з дапамогай вэб -сходу.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "На сайце ProS Tiger Tailgating ProS",
                "text": "Веб -сайт, які я пабудаваў у 2024 годзе для Tiger Tigrating Pros, задняй часткі кампаніі ў Клемсане, SC. Пабудаваны з React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Праект Тьюрынга машыны",
                "text": "Сям'я з больш чым 30+ рэалізацый машыны Цьюрынга. Выкарыстоўваецца для дэманстрацыі паўнаты Цырынга для розных моў праграмавання для даследаванняў, асабліва для мовы праграмавання тыгра.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Мова праграмавання тыгра"
    },
    "contact": {
        "title": "Звяжыцеся са мной",
        "header": "Кантактная інфармацыя",
        "email": "pattygsocials@gmail.com",
        "description": "Я адказваю на запыты па электроннай пошце, паведамленнях LinkedIn і Instagram. Я таксама ператэлефаную, калі мой нумар прадастаўляецца праз рэзюмэ ці іншае, хаця я аддаю перавагу захаваць нумар тэлефона прыватным."
    },
    "formatter": {
        "title": "Json & Yaml Formatter",
        "description": "Formatter JSON & YAML - гэта інструмент, які дазваляе фармаваць файлы JSON і YAML. Ён пабудаваны з Go і WebAssembly, і ён прызначаны для хуткага і эфектыўнага. Форматар прызначаны для простага ў выкарыстанні, з простым інтэрфейсам, які дазваляе ўстаўляць у свой код JSON або YAML і адфарматаваць яго з націскам кнопкі.",
        "more_info1": "Для атрымання дадатковай інфармацыі звярніцеся да readme ў",
        "more_info2": "JSON/YAML Formatter Repository.",
        "format_as": "Фармат як:",
        "auto_detect": "Аўтаматычнае выяўленне",
        "format": "Фармат"
    },
    "cube_solver": {
        "title": "Rubix Cube Solver",
        "start": "Вырашаць"
    },
    "tiger": {
        "title": "Тыгровая мова",
        "description": "Мова праграмавання Tiger - гэта індывідуальная мова праграмавання, пабудаваная як у Go, так і ў іржаве, каб эксперыментаваць з дызайнам перакладчыка і прадукцыйнасцю. Рэалізуецца на сайце партфеля з дапамогай вэб -сходу. Мова праграмавання Tiger - гэта індывідуальная мова праграмавання, пабудаваная як у Go, так і ў іржаве, каб эксперыментаваць з дызайнам перакладчыка і прадукцыйнасцю. Рэалізуецца на сайце партфеля з дапамогай вэб -сходу.",
        "more_info1": "Для атрымання дадатковай інфармацыі звярніцеся да readme ў",
        "more_info2": "Tiger Programment Manguage Repository Github.",
        "select_engine": "Выберыце рухавік:",
        "tiger_code": "Код Tiger:",
        "run_tiger": "Запусціць тыгр",
        "output": "Вывад:"
    },
    "tab": {
        "title": "Патрык Гудвін",
        "description": "Поўны інжынер праграмнага забеспячэння, які базуецца ў Цэнтральнай Фларыдзе"
    },
    "copy": {
        "text": "Копія",
        "copied": "Скапіравана!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Інстаграм",
        "linkedin": "LinkedIn",
        "tiktok": "Тыктак",
        "youtube": "YouTube",
        "text_strip": "Ідзі за мной"
    },
    "logotext": "Патрык"
}