{
    "name": "Патрик Гудуин",
    "menu": {
        "home": "Начало",
        "about": "За мен",
        "portfolio": "Портфолио",
        "tiger": "Език на тигър",
        "contact": "Свържете се с мен"
    },
    "home": {
        "title": "Начало",
        "animated": {
            "first": "Софтуерен инженер с пълен стек",
            "second": "Уеб разработчик",
            "third": "Разработчик на игри",
            "fourth": "Създател на съдържание"
        },
        "descriptionA": "Опитен софтуерен инженер и уеб разработчик в пълен стек с демонстрирана история на успешно водещи проекти за разработка, от създаване на модификации на Java за Minecraft до подобряване на потребителския опит в React.js и прилагане на сигурни API на REST, като същевременно последователно използват гъвкави методологии и ефективно сътрудничество в екипа.",
        "descriptionB": "Освен това аз съм създател на географско съдържание, който успешно използва алгоритмите на множество платформи за социални медии, включително Instagram, YouTube и Tiktok, за да придобия уважавана и ангажираща последователна база.",
        "portfolio_button": "Моето портфолио",
        "contact_button": "Свържете се с мен",
        "about_button": "За мен"
    },
    "about": {
        "title": "За мен",
        "personal_summary": {
            "title": "Лично обобщение",
            "text": "Като опитен разработчик на софтуер с пълен стек със седалище в Орландо, Флорида, демонстрирах опит в различни технологии, от Java и C ++ до React.js и Node.js. С опит в проектите за оглавяване на Spear, включително разработването на програма за модификация на Java за Minecraft и възнаграждаващ уебсайт за шофьори на камиони, показах лидерство и иновации. Моят ангажимент за високи постижения е очевиден в способността ми да оптимизирам управлението на проекти, да решавам сложни проблеми и да доставя висококачествени решения, които подобряват потребителското изживяване и стимулират организационния успех."
        },
        "professional_experience": {
            "title": "Професионален опит",
            "entries": [
                {
                    "jobtitle": "Младши софтуерен инженер",
                    "where": "Orion180 застраховка",
                    "date": "2024 г. - настояще"
                },
                {
                    "jobtitle": "Основател и разработчик на софтуер за пълен стек",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Софтуерен инженер с пълен стек",
                    "where": "Ускоряване на обучението",
                    "date": "2023"
                },
                {
                    "jobtitle": "Водещ уеб разработчик (студентска програма)",
                    "where": "GDI програма на университета в Клемсън",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Надзорник на бюрото",
                    "where": "Университет Клемсън",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Технически умения",
            "header1": "Езици за програмиране",
            "header2": "Рамки и библиотеки",
            "header3": "Инструменти и технологии"
        },
        "services": {
            "title": "Моите услуги",
            "entries": [
                {
                    "title": "Пълен стек инженеринг",
                    "text": "Предлагам изчерпателни решения както в разработката на предния и задния край, като гарантира безпроблемна интеграция и функционалност в целия софтуерен стек."
                },
                {
                    "title": "Уеб разработка",
                    "text": "С експертиза в HTML, CSS и JavaScript рамки като React.js, аз изработвам визуално привлекателни и удобни за потребителя уебсайтове, пригодени да отговарят на специфичните нужди и предпочитания на клиентите."
                },
                {
                    "title": "Развитие на играта",
                    "text": "Използване на езици като Java и C ++, аз съм специализиран в създаването на потапящи игрови изживявания, от концепция и дизайн до внедряване и оптимизация, като гарантирам ангажиране на геймплея и плавна производителност."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Портфолио",
        "filter_by": "Филтър портфолио от:",
        "entries": {
            "connect_four": {
                "title": "Свържете четири",
                "text": "Масово семейство от над 50+ реализации на играта Connect Four. Този проект включва реализации на над 30 различни езика за програмиране, включително Java, C ++, Python, JavaScript и други. Освен това, той също включва над 20+ различни рамки или други формати, включително React.js, Ruby on Rails, Asp.Net и други.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Interop Project",
                "text": "Проект, който документира оперативна съвместимост между различни езици за програмиране. В момента включва 15 различни езика за програмиране и 18 модела на изпълнение.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "excel_scripts": {
                "title": "Скриптове за електронни таблици на Microsoft Excel (VBA)",
                "text": "Полезна библиотека от VBA скриптове за Microsoft Excel. Тази библиотека се използва за автоматизиране на задачите в електронните таблици на Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON генератор",
                "text": "Лек генератор на JSON, вграден в Python за пакети за ресурси и данни на Minecraft. Този проект се използва за генериране на JSON файлове за Minecraft Mods, включително персонализирани артикули, блокове и образувания. Много полезно за не само създаване на персонализирани данни за данни, но и за модове, както и чрез функцията за превключване на име на мод.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Моят образователен опит",
                "text": "Наред с моите лични проекти, аз също съм придобил множество умения от образователен опит. Щракнете тук, за да видите моя профил в LinkedIn за повече информация.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Моят професионален опит",
                "text": "Наред с моите лични проекти, аз също придобих множество умения от професионален опит. Щракнете тук, за да видите моя профил в LinkedIn за повече информация.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Уебсайтът на Patrick Goodwin Portfolio",
                "text": "Този уебсайт е моят личен уебсайт за портфолио, създаден с React.js. Този проект се използва за показване на моите умения и проекти, както и за предоставяне на платформа за потенциалните работодатели да се свържат с мен. Този проект се използва за създаване на професионално онлайн присъствие.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Библиотеката на скрипта на Патрик Луа",
                "text": "Полезна библиотека от сценарии на LUA за бъдеща справка. Тази библиотека се използва за автоматизиране на задачите в сценариите на Lua, които могат да бъдат полезни за задачи, необходими за изпълнение, тъй като Lua обикновено е по-бърз език за скриптове от Python и Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "neovim_config": {
                "title": "Неовимен конфигурация на Патрик",
                "text": "Моята лична конфигурация на Neovim. Този проект се използва за конфигуриране на Neovim по мой вкус, включително персонализирани връзки с ключове, теми и плъгини. Този проект се използва, за да направи Neovim по-удобен и ефективен за моята лична употреба.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Генератор на карта на Патрик",
                "text": "Генератор на окръг и държавна карта на Съединените щати, създаден с Python, използвайки библиотеките Geopandas и Matplotlib. Този проект се използва за генериране на карти на Съединените щати, включително окръжни и държавни карти. Този проект се използва за създаване на персонализирани карти за визуализация и анализ на данни.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Библиотеката на скрипта на Патрик на Патрик",
                "text": "Полезна библиотека от скриптове на PowerShell за бъдеща справка. Полезно с функцията за скрипт на $ Profile, намирам това изключително полезно за автоматизиране на задачите от терминала на Windows, тъй като съм чест потребител на Windows OS.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Библиотеката на Patrick Ruby Script",
                "text": "Полезна библиотека от Ruby Scripts за бъдеща справка. Полезно за бъдещи концепции за развитие на Ruby on Rails.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF строител на умения",
                "text": "Персонализиран PDF строител, изграден с Python чрез разширенията PDFKIT и JINJA2, заедно с HTML и JSON Formatting. Този проект се използва за генериране на PDF файлове от списък с умения и проекти. Този проект може да се използва за създаване на персонализиран PDF резюме, което е много полезно за приложения за работа.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Проект за криптиране на Rijandel",
                "text": "Семейство от 10+ реализации на алгоритъма за криптиране на Rijandel през 128, 192 и 256 бита. Този проект се използва за демонстриране на алгоритъма за криптиране на Rijandel на различни езици за програмиране. Този проект се използва за създаване на семейство от реализации на алгоритъма за криптиране на Rijandel.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod",
                "text": "Minecraft Mod, който добавя персонализирани инструменти, броня, мафиоти, блокове, размери и много други функции към играта. Създаден с Java версии 8-17 за избрани версии на Minecraft между 1.16 и 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Език за програмиране на тигър",
                "text": "Език за персонализиране на програмиране, изграден както в Go & Rust, за да експериментира с дизайна и производителността на преводача. Изпълнен на уебсайта на портфолиото с помощта на уеб сглобяване.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Уебсайт за професионалисти за опашка на тигър",
                "text": "Уебсайт, който построих през 2024 г. за професионалисти за опашка на тигър, компания за опашка в Клемсън, СК. Изграден с React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Проект на машината на Тюринг",
                "text": "Семейство от над 30+ реализации на машината на Тюринг. Използва се за демонстриране на пълнота на Тюринг за различни езици за програмиране за изследвания, особено за езика за програмиране на тигър.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Език за програмиране на тигър"
    },
    "contact": {
        "title": "Свържете се с мен",
        "header": "Информация за контакт",
        "email": "pattygsocials@gmail.com",
        "description": "Отговарям на запитвания от имейл, съобщения в LinkedIn и съобщения в Instagram. Аз също ще се обадя, ако номерът ми е предоставен чрез възобновяване или по друг начин, въпреки че предпочитам да запазя телефонния си номер частен."
    },
    "tiger": {
        "title": "Език на тигър",
        "description": "Езикът за програмиране на Tiger е персонализиран език за програмиране, изграден както в Go & Rust, за да експериментира с дизайна и производителността на преводача. Изпълнен на уебсайта на портфолиото с помощта на уеб сглобяване. Езикът за програмиране на Tiger е персонализиран език за програмиране, изграден както в Go & Rust, за да експериментира с дизайна и производителността на преводача. Изпълнен на уебсайта на портфолиото с помощта на уеб сглобяване.",
        "more_info1": "За повече информация вижте README в",
        "more_info2": "Език за програмиране на тигър GitHub хранилище.",
        "select_engine": "Изберете двигател:",
        "tiger_code": "Код на тигрите:",
        "run_tiger": "Изпълнете Тигър",
        "output": "Резултат:"
    },
    "tab": {
        "title": "Патрик Гудуин",
        "description": "Софтуерен инженер с пълен стек със седалище в Централна Флорида"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Следвайте ме"
    },
    "logotext": "Патрик"
}