{
    "name": "Patrick Goodwin .",
    "menu": {
        "home": "So",
        "about": "Ne ko la .",
        "portfolio": "Portefeuille .",
        "projects": "Site web porozew .",
        "tiger": "Tigɛ kan .",
        "formatter": "JSON & Yaml Formatter .",
        "contact": "Contact me ."
    },
    "home": {
        "title": "So",
        "animated": {
            "first": "Full Stack Software Engineer .",
            "second": "Web Developer .",
            "third": "Tulonkɛla .",
            "fourth": "Kɔnɔkow Dabaga ."
        },
        "descriptionA": "Full-Stack Software Engineer & Web Developer min bɛ se kosɛbɛ ni tariku jiralen ye yiriwali porozɛw ɲɛmɔgɔya la, k’a ta java caman caman cili la Minecraft kama ka se baarakɛlaw ka dɔnniya yiriwali ma React.js kɔnɔ ani ka REST API lakananenw waleya, k’a sɔrɔ a bɛ to ka baara kɛ ni fɛɛrɛ wɛrɛw ye minnu bɛ se ka kɛ ani jɛkulu ka jɛkafɔ ɲuman.",
        "descriptionB": "Ka fara o kan, ne ye dugukoloko kɔnɔkow dabɔbaa ye min ye ɲɛtaa sɔrɔ ka ɲɛsin sosiyete ka kunnafonidilanw caman ma, i n’a fɔ Instagram, YouTube, ani Tiktok, walasa ka tugubagaw ka basigi bonyalen sɔrɔ ani ka u sen don a la.",
        "portfolio_button": "N ka portfolio .",
        "contact_button": "Contact me .",
        "about_button": "Ne ko la ."
    },
    "about": {
        "title": "Ne ko la .",
        "personal_summary": {
            "title": "Mɔgɔ yɛrɛ ka kuma kuncɛcogo .",
            "text": "Komin a ye porogaramu dafalen ye min sigilen bɛ Orlando, FL, n ye dɔnniya jira fɛɛrɛ suguya caman na, k’a ta Java ni C++ la ka se React.js ani Node.js ma. Ni taamasiyɛnw ye minnu bɛ kɛ ka ɲɛsin tama ma, i n’a fɔ Java ladilanni porogaramu dɔ labɛnni min bɛ kɛ Minecraft kama ani sitiba min bɛ nafa lase kamiyɔn bolilaw ma, n ye ɲɛmɔgɔya ni ko kura jira. Ne ka cɛsiri ka ɲɛsin ɲɛtaa ma, o bɛ ye ne ka seko la ka porozew ɲɛnabɔli nɔgɔya, ka gɛlɛya gɛlɛnw ɲɛnabɔ, ani ka fɛɛrɛ ɲumanw di minnu bɛ baarakɛlaw ka dɔnniya bonya ani ka jɛkulu ka ɲɛtaa sabati."
        },
        "professional_experience": {
            "title": "Professionnel ka ko kɛlenw .",
            "entries": [
                {
                    "jobtitle": "Enzeniyɛri fitinin min bɛ porogaramuw la .",
                    "where": "Orion180 Asiransi .",
                    "date": "2024 - bi ."
                },
                {
                    "jobtitle": "Founder & Full Stack Software Developer .",
                    "where": "Suprememc .",
                    "date": "2020 - 2024 ."
                },
                {
                    "jobtitle": "Full Stack Software Engineer .",
                    "where": "Kalan teliya .",
                    "date": "2023 ye ."
                },
                {
                    "jobtitle": "LEAD Web Developer (Kalandenw ka porogaramu) .",
                    "where": "Clemson Iniwɛrisite GDI porogaramu .",
                    "date": "2021 - 2022 ."
                },
                {
                    "jobtitle": "Bureau ɲɛmɔgɔ .",
                    "where": "Clemson Iniwɛrisite .",
                    "date": "2021 - 2022 ."
                }
            ]
        },
        "technical_skills": {
            "title": "Tekniki sekow .",
            "header1": "Porogaramu kanw .",
            "header2": "Kalanbolow & gafemarayɔrɔw .",
            "header3": "Baarakɛminɛnw & Technologies ."
        },
        "services": {
            "title": "N ka baarakɛminɛnw .",
            "entries": [
                {
                    "title": "Injiniyɛri dafalen .",
                    "text": "N bɛ fɛɛrɛ bɛɛ lajɛlen di yiriwali ɲɛfɛ ni kɔfɛla bɛɛ la, ka n’a sɔrɔ ka don ɲɔgɔn na ani ka baarakɛcogo caman kɛ porozɛw kulu bɛɛ kɔnɔ."
                },
                {
                    "title": "Web yiriwali .",
                    "text": "Ni dɔnniya bɛ HTML, CSS, ani JavaScript frameworks la i n’a fɔ React.js, n bɛ ɛntɛrinɛti yɔrɔw labɛn minnu bɛ mɔgɔ ɲɛnajɛ ani minnu bɛ se ka baara kɛ ni u ye, minnu labɛnna walasa ka kiliyanw mago kɛrɛnkɛrɛnnenw n’u diyanyekow ɲɛnabɔ."
                },
                {
                    "title": "Tulon yiriwali .",
                    "text": "Kanw i n’a fɔ Java ani C++, n bɛ kɛrɛnkɛrɛnnenya la tulonkɛko dɔnniyaw dabɔli la, k’a ta hakilina ni dilancogo la ka se waleyali n’a kɛcogo ɲuman ma, ka tulonkɛcogo n’a kɛcogo ɲuman sabati."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portefeuille .",
        "filter_by": "Filɛri portfolio by:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca JSON .",
                "text": "Python porozɛ dɔ min bɛ kan bamanankan na. A bɛ sira Di n ka siti in ka portfolio ma ka baara Kɛ ni kan 70+ ye, i n’a fɔ Ɛsipaɲɔlikan, Faransikan, Sinuwakan, Arabukan, ani caman wɛrɛw. Nin porozɛ in bɛ kɛ ka ɛntɛrinɛti yɔrɔ dɔ dilan min bɛ kan caman fɔ, min nafa ka bon kosɛbɛ ka se jamaba ma. Nin porozɛ in na, diɲɛ 99% ni kɔ bɛ se ka n ka portfolio kalan kan ɲuman na.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Aw ye naani don ɲɔgɔn na .",
                "text": "Denbayaba min ka ca ni 50+ ye, o ye Connect Four tulon in waleyali ye. Nin porozɛ in kɔnɔ, waleyaliw bɛ sɔrɔ porogaramukan 30 ni kɔ la, i n’a fɔ Java, C++, Python, JavaScript, ani dɔ wɛrɛw. Ka fara o kan, a bɛ dakun 20+ ni kɔ fana na walima cogoya wɛrɛw la, i n’a fɔ React.js, Ruby on Rails, Asp.net, ani dɔ wɛrɛw.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Porozɛ ni ɲɔgɔn cɛ .",
                "text": "Porozɛ min bɛ baarakɛɲɔgɔnya sɛbɛn porogaramukan suguya wɛrɛw ni ɲɔgɔn cɛ. Sisan, porogaramukan suguya 15 ani waleyalicogo 18 bɛ yen.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "JSON & Yaml Auto Formatter .",
                "text": "A Linter & AutoFormatter ye JSON & YAML filew ye. Nin porozɛ in bɛ Kɛ ka JSON & YAML filew format (fɔɔnɔ) Kɛ, o min nafa ka bon kosɛbɛ kode (kode) saniyalen na ani a labɛnni na. A jɔra ni GO ye, a lajɛlen bɛ ni webassembly ye, ka don n ka portfolio kɔnɔ i n’a fɔ site web porozɛ. Format wɛrɛw bɛna na don nataw la.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON Générateur .",
                "text": "JSON generator nɔgɔman min bɛ Python kɔnɔ min bɛ kɛ Minecraft Resource & Data Packs ye. Nin porozɛ in bɛ kɛ ka JSON filew dilan Minecraft mods kama, i n’a fɔ fɛnw, blokiw, ani fɛnw. Nafa ka bon kosɛbɛ a tɛ datapacks customs dɔrɔn de dilan, nka mods fana na mod name switching feature fɛ.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "N ka kalanko dɔnniya .",
                "text": "N yɛrɛ ka porozɛw kɛrɛfɛ, n ye seko caman fana sɔrɔ kalanko dɔnniya la. Aw ye nin yɔrɔ digi walasa ka n ka LinkedIn profile ye walasa ka kunnafoni wɛrɛw sɔrɔ.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "N ka baarakɛcogo ɲuman .",
                "text": "N yɛrɛ ka porozɛw kɛrɛfɛ, n ye seko caman sɔrɔ fana ka bɔ baarakɛlaw ka dɔnniya la. Aw ye nin yɔrɔ digi walasa ka n ka LinkedIn profile ye walasa ka kunnafoni wɛrɛw sɔrɔ.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Goodwin ka portfolio site web .",
                "text": "Nin siti in ye ne yɛrɛ ka portfolio site web ye, min jɔra ni react.js ye. Nin porozɛ in bɛ kɛ ka n ka sekow ni porozɛw jira, ka fara a kan ka sigida di baarakɛlaw ma minnu bɛ se ka kɛ u ye. Nin porozɛ in bɛ kɛ ka ɛntɛrinɛti jɔyɔrɔ dɔ da.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patrick ka Lua Script Library .",
                "text": "Lua sɛbɛnniw ka gafemarayɔrɔ nafama dɔ walasa ka kunnafoni sɔrɔ don nataw la. Nin gafemarayɔrɔ in bɛ kɛ ka baara kɛtaw kɛ otomatiki ye Lua sɛbɛnniw kɔnɔ, minnu bɛ se ka nafa sɔrɔ baara kɛtaw la, bawo a ka c’a la, Lua ye sɛbɛnnikan teliya ye ka tɛmɛ Python ni Ruby fila bɛɛ kan.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrick ka Microsoft Excel ka jatebɔsɛbɛn (VBA) .",
                "text": "VBA sɛbɛnniw ka gafemarayɔrɔ nafama dɔ ye Microsoft Excel ye. Nin gafemarayɔrɔ in bɛ kɛ ka baara kɛtaw kɛ otomatiki ye Excel sɛbɛnfura kɔnɔ.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Patrick ka Neovim Config .",
                "text": "Ne yɛrɛ ka neovim configuration. Nin porozɛ in bɛ kɛ ka Neovim labɛn ka kɛɲɛ ni ne diyanyeko ye, i n’a fɔ kilisi-minɛnw, barokunw, ani fɛnw. Nin porozɛ in bɛ kɛ ka Neovim kɛ baarakɛcogo ɲuman ye ani ka kɛ fɛn ye min bɛ se ka kɛ ka ɲɛ ne yɛrɛ ka baara kama.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patrick ka karti Generator .",
                "text": "Ameriki County & State Map Generator, min jɔra ni Python ye ni Geopandas ani Matplotlib gafemarayɔrɔw ye. Nin porozɛ in bɛ kɛ ka Ameriki jamana ka kartiw dilan, marabolo ni jamana kartiw fana sen bɛ o la. Nin porozɛ in bɛ kɛ ka kartiw dilan minnu bɛ kɛ ka kɛɲɛ ni kunnafoniw yecogo n’u sɛgɛsɛgɛli ye.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patrick ka PowerShell Script Library .",
                "text": "PowerShell sɛbɛnniw ka gafemarayɔrɔ nafama dɔ walasa ka kunnafoni sɔrɔ don nataw la. Nafa bɛ $profile script feature la, n b’a ye ko nin bɛ dɛmɛba sɔrɔ ka baaraw kɛ otomatiki la ka bɔ Windows terminal la, bawo n ye Windows OS baarakɛla ye tuma caman.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patrick ka Ruby Script Library .",
                "text": "Rubi sɛbɛnniw ka gafemarayɔrɔ nafama dɔ walasa ka kunnafoni sɔrɔ don nataw la. Nafa bɛ sɔrɔ rubi nataw la Rails yiriwali hakilinaw kan.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF Seko ni dɔnko So jɔbaga .",
                "text": "PDF Builder ladamulen dɔ min jɔra ni Python ye PDFKit ni JINJA2 fɛnw fɛ, HTML ni JSON formatting kɛrɛfɛ. Nin porozɛ in bɛ kɛ ka PDF filew dilan ka bɔ seko ni dɔnko ni porozɛw lisɛli la. Nin porozɛ in bɛ se ka kɛ ka PDF resume custom dilan, min nafa ka bon kosɛbɛ baara baarakɛminɛnw na.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "rijandel encryption projet .",
                "text": "denbaya min ye 10+ waleyali ye Rijandel encryption algorithm kɔnɔ 128, 192, ani 256 bits kɔnɔ. Nin porozɛ in bɛ Kɛ ka RIJANDEL encryption algorithm jira porogaramukanw na minnu tɛ kelen ye. Nin porozɛ in bɛ kɛ ka Rijandel Encryption algorithm waleyali denbaya dɔ sigi sen kan.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod .",
                "text": "Minecraft mod min bɛ baarakɛminɛnw, kɛlɛkɛminɛnw, jamakuluw, blokiw, hakɛw ani fɛn caman wɛrɛw fara tulon kan. A jɔra ni Java versions 8-17 ye walasa ka Minecraft versions sugandi 1.16 ni 1.20 cɛ.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tigɛ porogaramu kan .",
                "text": "custom programming language built in both go & rust to experimented ni interpreter design ani performance ye. A bɛ waleya portfolio site web kan ni web assembly ye.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger tailgating pros site web .",
                "text": "N ye siti min jɔ san 2024 Tiger Tailgating Pros fɛ, o ye tailgating company ye Clemson, SC. A jɔra ni react.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing Machine Projet .",
                "text": "denbaya min bɛ Turing masin waleyali 30+ ni kɔ. A bɛ Kɛ ka Turing dafalen jira porogaramukan suguya wɛrɛw la ɲininiw kama, kɛrɛnkɛrɛnnenya la Tiger porogaramukan na.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tigɛ porogaramu kan ."
    },
    "contact": {
        "title": "Contact me .",
        "header": "Kunnafoni minnu bɛ sɔrɔ .",
        "email": "Pattygsocials@gmail.com",
        "description": "N bɛ ɲininkaliw jaabi ka bɔ imeyi la, LinkedIn cikanw na, ani Instagram cikanw na. N fana bɛna segin ka telefɔni kɛ ni n ka nimɔrɔ dira resume fɛ walima cogo wɛrɛ la, hali ni a ka fisa n ma ka n ka telefɔni nimɔrɔ to a kelen na."
    },
    "formatter": {
        "title": "JSON & Yaml Formatter .",
        "description": "JSON & YAML Formatter ye baarakɛminɛn ye min b'a To i bɛ se ka JSON ni YAML filenw labɛn. A bɛ jɔ ni GO ni webassembly ye, wa a dabɔra ka teliya ani ka baara kɛ ka ɲɛ. Formatɛri in dabɔra walasa a baara ka nɔgɔn, ni fɛn nɔgɔman ye min b’a to i bɛ se ka nɔrɔ i ka JSON walima YAML code la ani k’a labɛn ni butɔni digilen ye.",
        "more_info1": "Walasa ka kunnafoni wɛrɛw sɔrɔ, aw ye gafe ɲɛ 10nan lajɛ .",
        "more_info2": "JSON/YAML Formatter ka fɛnmarayɔrɔ.",
        "format_as": "Format As:",
        "auto_detect": "Auto detect .",
        "format": "Format ."
    },
    "tiger": {
        "title": "Tigɛ kan .",
        "description": "Tigɛ porogaramukan ye porogaramukan ye min bɛ Dabɔ GO & Rust fila bɛɛ la walasa ka bamanankan-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-yɔrɔ-ko ni a ka baarakɛcogo-yɔrɔ-ko ni a ka baarakɛcogo-ko-kɔlɔsili Kɛ. A bɛ waleya portfolio site web kan ni web assembly ye. Tigɛ porogaramukan ye porogaramukan ye min bɛ Dabɔ GO & Rust fila bɛɛ la walasa ka bamanankan-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-falen-yɔrɔ-ko ni a ka baarakɛcogo-yɔrɔ-ko ni a ka baarakɛcogo-ko-kɔlɔsili Kɛ. A bɛ waleya portfolio site web kan ni web assembly ye.",
        "more_info1": "Walasa ka kunnafoni wɛrɛw sɔrɔ, aw ye gafe ɲɛ 10nan lajɛ .",
        "more_info2": "Tiger Programming Language GitHub marayɔrɔ.",
        "select_engine": "Motɛri sugandi:",
        "tiger_code": "Tigɛ kode:",
        "run_tiger": "Tigɛ boli .",
        "output": "Bɔli:"
    },
    "tab": {
        "title": "Patrick Goodwin .",
        "description": "Full Stack Software Engineer min sigilen bɛ Central Florida ."
    },
    "copy": {
        "text": "Kopi .",
        "copied": "Kopi kɛra!"
    },
    "social_media": {
        "github": "GitHub .",
        "instagram": "Instagram",
        "linkedin": "LinkedIn .",
        "tiktok": "Tiktok .",
        "youtube": "YouTube .",
        "text_strip": "Aw ka tugu ne kɔ ."
    },
    "logotext": "Patrick ."
}