{
    "name": "প্যাট্রিক গুডউইন",
    "menu": {
        "home": "বাড়ি",
        "about": "আমার সম্পর্কে",
        "portfolio": "পোর্টফোলিও",
        "projects": "ওয়েবসাইট প্রকল্প",
        "tiger": "বাঘের ভাষা",
        "formatter": "JSON এবং YAML ফর্ম্যাটার",
        "cube_solver": "রুবিক্স কিউব সলভার",
        "contact": "আমার সাথে যোগাযোগ করুন"
    },
    "home": {
        "title": "বাড়ি",
        "animated": {
            "first": "সম্পূর্ণ স্ট্যাক সফটওয়্যার ইঞ্জিনিয়ার",
            "second": "ওয়েব বিকাশকারী",
            "third": "গেম বিকাশকারী",
            "fourth": "বিষয়বস্তু স্রষ্টা"
        },
        "footer": "ওয়েবসাইট এখন 100+ ভাষায় অনুবাদ এবং অবলম্বনযোগ্য!",
        "descriptionA": "মাইনক্রাফ্টের জন্য জাভা পরিবর্তনগুলি তৈরি করা থেকে শুরু করে রিঅ্যাক্ট.জেএসে ব্যবহারকারীর অভিজ্ঞতা বাড়ানো এবং সিকিউর রেস্ট এপিআই বাস্তবায়ন করা, ধারাবাহিকভাবে চটজলদি পদ্ধতি এবং কার্যকর দলের সহযোগিতা নিয়োগের সময় সফলভাবে শীর্ষস্থানীয় উন্নয়ন প্রকল্পগুলির একটি প্রদর্শিত ইতিহাস সহ অভিজ্ঞ ফুল-স্ট্যাক সফটওয়্যার ইঞ্জিনিয়ার এবং ওয়েব বিকাশকারী।",
        "descriptionB": "অধিকন্তু, আমি একজন ভূগোলের বিষয়বস্তু স্রষ্টা, যিনি একটি সম্মানজনক এবং আকর্ষক অনুসরণকারী বেস অর্জনের জন্য ইনস্টাগ্রাম, ইউটিউব এবং টিকটোক সহ একাধিক সোশ্যাল মিডিয়া প্ল্যাটফর্মের অ্যালগরিদমগুলি সফলভাবে উপার্জন করেছেন।",
        "portfolio_button": "আমার পোর্টফোলিও",
        "contact_button": "আমার সাথে যোগাযোগ করুন",
        "about_button": "আমার সম্পর্কে"
    },
    "about": {
        "title": "আমার সম্পর্কে",
        "personal_summary": {
            "title": "ব্যক্তিগত সংক্ষিপ্তসার",
            "text": "অরল্যান্ডো, এফএল -এ অবস্থিত একজন অভিজ্ঞ পূর্ণ স্ট্যাক সফ্টওয়্যার বিকাশকারী হিসাবে, আমি জাভা এবং সি ++ থেকে প্রতিক্রিয়া.জেএস এবং নোড.জেএস থেকে বিভিন্ন প্রযুক্তিতে দক্ষতা প্রদর্শন করেছি মাইনক্রাফ্টের জন্য জাভা পরিবর্তন কর্মসূচির বিকাশ এবং ট্রাক ড্রাইভারদের জন্য একটি পুরষ্কারমূলক ওয়েবসাইট সহ নেতৃত্বাধীন প্রকল্পগুলির ট্র্যাক রেকর্ড সহ, আমি নেতৃত্ব এবং উদ্ভাবন প্রদর্শন করেছি। প্রকল্প পরিচালনকে সহজতর করার, জটিল সমস্যাগুলি সমাধান করার এবং উচ্চমানের সমাধানগুলি সরবরাহ করার ক্ষেত্রে আমার দক্ষতার প্রতি আমার প্রতিশ্রুতি স্পষ্ট যা ব্যবহারকারীর অভিজ্ঞতা বাড়ায় এবং সাংগঠনিক সাফল্যকে চালিত করে।"
        },
        "professional_experience": {
            "title": "পেশাদার অভিজ্ঞতা",
            "entries": [
                {
                    "jobtitle": "জুনিয়র সফটওয়্যার ইঞ্জিনিয়ার",
                    "where": "Orion180 বীমা",
                    "date": "2024 - বর্তমান"
                },
                {
                    "jobtitle": "প্রতিষ্ঠাতা এবং পূর্ণ স্ট্যাক সফ্টওয়্যার বিকাশকারী",
                    "where": "সুপ্রিম্যাক",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "সম্পূর্ণ স্ট্যাক সফটওয়্যার ইঞ্জিনিয়ার",
                    "where": "ত্বরান্বিত শেখা",
                    "date": "2023"
                },
                {
                    "jobtitle": "নেতৃত্ব ওয়েব বিকাশকারী (ছাত্র প্রোগ্রাম)",
                    "where": "ক্লেমসন বিশ্ববিদ্যালয় জিডিআই প্রোগ্রাম",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "ডেস্ক সুপারভাইজার",
                    "where": "ক্লেমসন বিশ্ববিদ্যালয়",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "ডেস্ক সুপারভাইজার",
                    "where": "ক্লেমসন বিশ্ববিদ্যালয়",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "প্রযুক্তিগত দক্ষতা",
            "header1": "প্রোগ্রামিং ভাষা",
            "header2": "ফ্রেমওয়ার্ক এবং লাইব্রেরি",
            "header3": "সরঞ্জাম এবং প্রযুক্তি"
        },
        "services": {
            "title": "আমার পরিষেবা",
            "entries": [
                {
                    "title": "সম্পূর্ণ স্ট্যাক ইঞ্জিনিয়ারিং",
                    "text": "আমি পুরো সফ্টওয়্যার স্ট্যাক জুড়ে বিরামবিহীন সংহতকরণ এবং কার্যকারিতা নিশ্চিত করে ফ্রন্ট-এন্ড এবং ব্যাক-এন্ড বিকাশ উভয় জুড়ে বিস্তৃত সমাধান সরবরাহ করি।"
                },
                {
                    "title": "ওয়েব বিকাশ",
                    "text": "Rect.js এর মতো এইচটিএমএল, সিএসএস এবং জাভাস্ক্রিপ্ট ফ্রেমওয়ার্কগুলিতে দক্ষতার সাথে, আমি ক্লায়েন্টদের নির্দিষ্ট প্রয়োজন এবং পছন্দগুলি মেটাতে উপযুক্তভাবে আকর্ষণীয় এবং ব্যবহারকারী-বান্ধব ওয়েবসাইটগুলি তৈরি করি।"
                },
                {
                    "title": "গেম বিকাশ",
                    "text": "জাভা এবং সি ++ এর মতো ভাষাগুলি উত্তোলন করা, আমি ধারণা এবং নকশা থেকে বাস্তবায়ন এবং অপ্টিমাইজেশন পর্যন্ত নিমজ্জনিত গেমিং অভিজ্ঞতা তৈরিতে বিশেষজ্ঞ, আকর্ষণীয় গেমপ্লে এবং মসৃণ পারফরম্যান্স নিশ্চিত করে।"
                }
            ]
        }
    },
    "portfolio": {
        "title": "পোর্টফোলিও",
        "filter_by": "ফিল্টার পোর্টফোলিও দ্বারা:",
        "entries": {
            "biblioteca": {
                "title": "বিবলিওটেকা জসন",
                "text": "একটি পাইথন প্রকল্প যা ভাষার অনুবাদগুলিকে প্রবাহিত করে। আমার ওয়েবসাইটের পোর্টফোলিওকে স্প্যানিশ, ফরাসী, চীনা, আরবি এবং আরও অনেক সহ 70+ ভাষায় অনুবাদ করার অনুমতি দেয়। এই প্রকল্পটি একটি বহুভাষিক ওয়েবসাইট পোর্টফোলিও তৈরি করতে ব্যবহৃত হয়, যা আরও বিস্তৃত দর্শকদের কাছে পৌঁছানোর জন্য খুব দরকারী। এই প্রকল্পের সাথে, বিশ্বের 99% এরও বেশি আমার পোর্টফোলিওটি সাবলীল ভাষায় পড়তে পারে।",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "চারটি সংযুক্ত করুন",
                "text": "কানেক্ট ফোর গেমের 50+ এরও বেশি বাস্তবায়নের বিশাল পরিবার। এই প্রকল্পে জাভা, সি ++, পাইথন, জাভাস্ক্রিপ্ট এবং আরও অনেক কিছু সহ 30 টিরও বেশি বিভিন্ন প্রোগ্রামিং ভাষায় বাস্তবায়ন অন্তর্ভুক্ত রয়েছে। অতিরিক্তভাবে, এটিতে 20+ এরও বেশি বিভিন্ন ফ্রেমওয়ার্ক বা রিএ্যাক্ট.জেএস, রুবি অন রেলস, এএসপি.নেট এবং আরও অনেক কিছু সহ অন্যান্য ফর্ম্যাটও অন্তর্ভুক্ত রয়েছে।",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "মুদি অ্যাপ্লিকেশন",
                "text": "মুদি আইটেমগুলি পরিচালনার জন্য একটি সম্পূর্ণ ফুল-স্ট্যাক। নেট 9 ব্লেজার সার্ভার অ্যাপ্লিকেশন। অ্যাপ্লিকেশনটি অধ্যবসায়ের জন্য সত্তা ফ্রেমওয়ার্ক কোর সহ নিয়ামক/পরিষেবা/সংগ্রহস্থল প্যাটার্ন অনুসরণ করে এবং একটি বিস্তৃত পরীক্ষার স্যুট অন্তর্ভুক্ত করে।",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "ইন্টারপ প্রকল্প",
                "text": "এমন একটি প্রকল্প যা বিভিন্ন প্রোগ্রামিং ভাষার মধ্যে আন্তঃব্যবহারযোগ্যতা দলিল করে। বর্তমানে 15 টি বিভিন্ন প্রোগ্রামিং ভাষা এবং 18 এক্সিকিউশন নিদর্শন অন্তর্ভুক্ত রয়েছে।",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "ইনভেন্টরি রেজিস্টার",
                "text": "একটি পূর্ণ-স্ট্যাক ডেমো পয়েন্ট অফ বিক্রয় (পিওএস) কৌণিক 17+ এবং নোড.জেএস দিয়ে নির্মিত ইনভেন্টরি ম্যানেজমেন্ট সিস্টেমের সাথে নিবন্ধন করুন এই অ্যাপ্লিকেশনটি ব্যবহারকারী প্রমাণীকরণ, ভূমিকা-ভিত্তিক অ্যাক্সেস নিয়ন্ত্রণ, ইনভেন্টরি ট্র্যাকিং এবং মক পেমেন্ট প্রসেসিং সহ একটি পেশাদার-গ্রেড পিওএস সিস্টেম প্রদর্শন করে।",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "JSON & YAML অটো ফর্ম্যাটার",
                "text": "JSON এবং YAML ফাইলগুলির জন্য একটি লিন্টার এবং অটোফর্ম্যাটার। এই প্রকল্পটি JSON এবং YAML ফাইলগুলি ফর্ম্যাট করতে ব্যবহৃত হয়, যা কোড পরিষ্কার এবং সংগঠিত রাখার জন্য খুব দরকারী। জিও দিয়ে নির্মিত, ওয়েবসেম্বলির সাথে সংকলিত এবং ওয়েবসাইট প্রকল্প হিসাবে আমার পোর্টফোলিওতে এম্বেড করা। ভবিষ্যতে আরও ফর্ম্যাট আসতে হবে।",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "মাইনক্রাফ্ট জেএসএন জেনারেটর",
                "text": "মাইনক্রাফ্ট রিসোর্স এবং ডেটা প্যাকগুলির জন্য পাইথনে নির্মিত লাইটওয়েট জেএসএন জেনারেটর। এই প্রকল্পটি কাস্টম আইটেম, ব্লক এবং সত্তা সহ মাইনক্রাফ্ট মোডগুলির জন্য জেএসএন ফাইল তৈরি করতে ব্যবহৃত হয়। কেবল কাস্টম ডেটাপ্যাকগুলি তৈরি করার জন্য নয়, মোডগুলির জন্য পাশাপাশি মোড নেম স্যুইচিং বৈশিষ্ট্যের মাধ্যমে খুব দরকারী।",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "আমার শিক্ষামূলক অভিজ্ঞতা",
                "text": "আমার ব্যক্তিগত প্রকল্পগুলির পাশাপাশি, আমি শিক্ষাগত অভিজ্ঞতা থেকে অসংখ্য দক্ষতা অর্জন করেছি। আরও তথ্যের জন্য আমার লিঙ্কডইন প্রোফাইল দেখতে এখানে ক্লিক করুন।",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "আমার পেশাদার অভিজ্ঞতা",
                "text": "আমার ব্যক্তিগত প্রকল্পগুলির পাশাপাশি, আমি পেশাদার অভিজ্ঞতা থেকে অসংখ্য দক্ষতা অর্জন করেছি। আরও তথ্যের জন্য আমার লিঙ্কডইন প্রোফাইল দেখতে এখানে ক্লিক করুন।",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "প্যাট্রিক গুডউইন পোর্টফোলিও ওয়েবসাইট",
                "text": "এই ওয়েবসাইটটি আমার ব্যক্তিগত পোর্টফোলিও ওয়েবসাইট, যা রিঅ্যাক্ট.জেএস দিয়ে নির্মিত। এই প্রকল্পটি আমার দক্ষতা এবং প্রকল্পগুলি প্রদর্শনের পাশাপাশি সম্ভাব্য নিয়োগকারীদের আমার সাথে যোগাযোগ করার জন্য একটি প্ল্যাটফর্ম সরবরাহ করতে ব্যবহৃত হয়। এই প্রকল্পটি একটি পেশাদার অনলাইন উপস্থিতি তৈরি করতে ব্যবহৃত হয়।",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "প্যাট্রিকের লুয়া স্ক্রিপ্ট লাইব্রেরি",
                "text": "ভবিষ্যতের রেফারেন্সের জন্য LUA স্ক্রিপ্টগুলির একটি দরকারী গ্রন্থাগার। এই লাইব্রেরিটি লুয়া স্ক্রিপ্টগুলিতে কাজগুলি স্বয়ংক্রিয় করতে ব্যবহৃত হয়, যা পারফরম্যান্স-প্রয়োজনীয় কার্যগুলির জন্য কার্যকর হতে পারে, কারণ লুয়া সাধারণত পাইথন এবং রুবি উভয়ের চেয়ে দ্রুত স্ক্রিপ্টিং ভাষা।",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "প্যাট্রিকের মাইক্রোসফ্ট এক্সেল স্প্রেডশিট স্ক্রিপ্টস (ভিবিএ)",
                "text": "মাইক্রোসফ্ট এক্সেলের জন্য ভিবিএ স্ক্রিপ্টগুলির একটি দরকারী গ্রন্থাগার। এই লাইব্রেরিটি এক্সেল স্প্রেডশিটগুলিতে কাজগুলি স্বয়ংক্রিয় করতে ব্যবহৃত হয়।",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "প্যাট্রিকের নিওভিম কনফিগারেশন",
                "text": "আমার ব্যক্তিগত নিউওভিম কনফিগারেশন। এই প্রকল্পটি কাস্টম কীবাইন্ডিংস, থিম এবং প্লাগইন সহ আমার পছন্দ অনুসারে নিওভিমকে কনফিগার করতে ব্যবহৃত হয়। এই প্রকল্পটি আমার ব্যক্তিগত ব্যবহারের জন্য নিওভিমকে আরও ব্যবহারকারী-বান্ধব এবং দক্ষ করে তুলতে ব্যবহৃত হয়।",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "প্যাট্রিকের মানচিত্র জেনারেটর",
                "text": "একটি মার্কিন যুক্তরাষ্ট্রের কাউন্টি এবং রাজ্য মানচিত্র জেনারেটর, জিওপ্যান্ডাস এবং ম্যাটপ্লোটলিব লাইব্রেরি ব্যবহার করে পাইথন দিয়ে নির্মিত। এই প্রকল্পটি কাউন্টি এবং রাষ্ট্রীয় মানচিত্র সহ মার্কিন যুক্তরাষ্ট্রের মানচিত্র তৈরি করতে ব্যবহৃত হয়। এই প্রকল্পটি ডেটা ভিজ্যুয়ালাইজেশন এবং বিশ্লেষণের জন্য কাস্টম মানচিত্র তৈরি করতে ব্যবহৃত হয়।",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "প্যাট্রিকের পাওয়ারশেল স্ক্রিপ্ট লাইব্রেরি",
                "text": "ভবিষ্যতের রেফারেন্সের জন্য পাওয়ারশেল স্ক্রিপ্টগুলির একটি দরকারী গ্রন্থাগার। $ প্রোফাইল স্ক্রিপ্ট বৈশিষ্ট্যের সাথে দরকারী, আমি উইন্ডোজ টার্মিনাল থেকে স্বয়ংক্রিয় কাজগুলির জন্য এটি প্রচুর সহায়ক বলে মনে করি, কারণ আমি উইন্ডোজ ওএসের ঘন ঘন ব্যবহারকারী।",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "প্যাট্রিকের রুবি স্ক্রিপ্ট লাইব্রেরি",
                "text": "ভবিষ্যতের রেফারেন্সের জন্য রুবি স্ক্রিপ্টগুলির একটি দরকারী গ্রন্থাগার। রেল উন্নয়নমূলক ধারণাগুলিতে ভবিষ্যতের রুবির জন্য দরকারী।",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "পিডিএফ দক্ষতা নির্মাতা",
                "text": "এইচটিএমএল এবং জেএসএন ফর্ম্যাটিংয়ের পাশাপাশি পিডিএফকেআইটি এবং জিনজা 2 এক্সটেনশনের মাধ্যমে পাইথন দিয়ে নির্মিত একটি কাস্টম পিডিএফ বিল্ডার। এই প্রকল্পটি দক্ষতা এবং প্রকল্পগুলির তালিকা থেকে পিডিএফ ফাইল তৈরি করতে ব্যবহৃত হয়। এই প্রকল্পটি একটি কাস্টম পিডিএফ পুনঃসূচনা তৈরি করতে ব্যবহার করা যেতে পারে, যা কাজের অ্যাপ্লিকেশনগুলির জন্য খুব দরকারী।",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "রিজ্যান্ডেল এনক্রিপশন প্রকল্প",
                "text": "128, 192 এবং 256 বিটগুলিতে রিজ্যান্ডেল এনক্রিপশন অ্যালগরিদমের 10+ বাস্তবায়নের একটি পরিবার। এই প্রকল্পটি বিভিন্ন প্রোগ্রামিং ভাষায় রিজ্যান্ডেল এনক্রিপশন অ্যালগরিদম প্রদর্শনের জন্য ব্যবহৃত হয়। এই প্রকল্পটি রিজ্যান্ডেল এনক্রিপশন অ্যালগরিদমের বাস্তবায়নের একটি পরিবার তৈরি করতে ব্যবহৃত হয়।",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "সুপ্রিম্যাক মাইনক্রাফ্ট মোড",
                "text": "একটি মাইনক্রাফ্ট মোড যা গেমটিতে কাস্টম সরঞ্জাম, বর্ম, ভিড়, ব্লক, মাত্রা এবং আরও অনেক বৈশিষ্ট্য যুক্ত করে। 1.16 এবং 1.20 এর মধ্যে নির্বাচিত মাইনক্রাফ্ট সংস্করণগুলির জন্য জাভা সংস্করণ 8-17 দিয়ে নির্মিত।",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "বাঘ প্রোগ্রামিং ভাষা",
                "text": "দোভাষী ডিজাইন এবং পারফরম্যান্সের সাথে পরীক্ষার জন্য উভয়ই গো এবং মরিচায় নির্মিত কাস্টম প্রোগ্রামিং ভাষা। ওয়েব অ্যাসেম্বলি ব্যবহার করে পোর্টফোলিও ওয়েবসাইটে প্রয়োগ করা হয়েছে।",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "টাইগার টেলগেটিং পেশাদার ওয়েবসাইট",
                "text": "টাইগার টেলগেটিং প্রো, ক্লেমসনের একটি টেলগেটিং সংস্থা, এসসি -র একটি টেলগেটিং সংস্থাগুলির জন্য আমি 2024 সালে নির্মিত একটি ওয়েবসাইট। প্রতিক্রিয়া.জেএস দিয়ে নির্মিত।",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "টুরিং মেশিন প্রকল্প",
                "text": "টিউরিং মেশিনের 30+ এরও বেশি বাস্তবায়নের পরিবার। গবেষণার জন্য বিশেষত বাঘ প্রোগ্রামিং ভাষার জন্য বিভিন্ন প্রোগ্রামিং ভাষার জন্য টুরিং সম্পূর্ণতা প্রদর্শন করতে ব্যবহৃত হয়।",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "বাঘ প্রোগ্রামিং ভাষা"
    },
    "contact": {
        "title": "আমার সাথে যোগাযোগ করুন",
        "header": "যোগাযোগের তথ্য",
        "email": "pattygsocials@gmail.com",
        "description": "আমি ইমেল, লিংকডইন বার্তা এবং ইনস্টাগ্রাম বার্তাগুলি থেকে অনুসন্ধানের প্রতিক্রিয়া জানাই। আমি আমার ফোন নম্বরটি ব্যক্তিগত রাখতে পছন্দ করি যদিও আমার নম্বরটি পুনরায় শুরু করার মাধ্যমে বা অন্যথায় সরবরাহ করা হয় তবে আমি আবার কল করব।"
    },
    "formatter": {
        "title": "JSON এবং YAML ফর্ম্যাটার",
        "description": "JSON & YAML ফর্ম্যাটার এমন একটি সরঞ্জাম যা আপনাকে JSON এবং YAML ফাইলগুলি ফর্ম্যাট করতে দেয়। এটি জিও এবং ওয়েবসেম্বিলির সাথে নির্মিত এবং এটি দ্রুত এবং দক্ষ হওয়ার জন্য ডিজাইন করা হয়েছে। ফর্ম্যাটারটি ব্যবহার করা সহজ হওয়ার জন্য ডিজাইন করা হয়েছে, একটি সাধারণ ইন্টারফেস সহ যা আপনাকে আপনার জেএসএন বা ইয়ামল কোডে পেস্ট করতে এবং এটি একটি বোতামের ক্লিকের সাথে ফর্ম্যাট করতে দেয়।",
        "more_info1": "আরও তথ্যের জন্য, এর মধ্যে রিডমিকে দেখুন",
        "more_info2": "JSON/YAML ফর্ম্যাটার সংগ্রহস্থল।",
        "format_as": "ফর্ম্যাট হিসাবে:",
        "auto_detect": "অটো সনাক্ত",
        "format": "ফর্ম্যাট"
    },
    "cube_solver": {
        "title": "রুবিক্স কিউব সলভার",
        "start": "সমাধান"
    },
    "tiger": {
        "title": "বাঘের ভাষা",
        "description": "টাইগার প্রোগ্রামিং ল্যাঙ্গুয়েজ হ'ল একটি কাস্টম প্রোগ্রামিং ভাষা যা দোভাষী নকশা এবং পারফরম্যান্সের সাথে পরীক্ষার জন্য গো অ্যান্ড মরিচা উভয়ই নির্মিত। ওয়েব অ্যাসেম্বলি ব্যবহার করে পোর্টফোলিও ওয়েবসাইটে প্রয়োগ করা হয়েছে। টাইগার প্রোগ্রামিং ল্যাঙ্গুয়েজ হ'ল একটি কাস্টম প্রোগ্রামিং ভাষা যা দোভাষী নকশা এবং পারফরম্যান্সের সাথে পরীক্ষার জন্য গো অ্যান্ড মরিচা উভয়ই নির্মিত। ওয়েব অ্যাসেম্বলি ব্যবহার করে পোর্টফোলিও ওয়েবসাইটে প্রয়োগ করা হয়েছে।",
        "more_info1": "আরও তথ্যের জন্য, এর মধ্যে রিডমিকে দেখুন",
        "more_info2": "টাইগার প্রোগ্রামিং ল্যাঙ্গুয়েজ গিটহাব সংগ্রহস্থল।",
        "select_engine": "ইঞ্জিন নির্বাচন করুন:",
        "tiger_code": "টাইগার কোড:",
        "run_tiger": "বাঘ চালান",
        "output": "আউটপুট:"
    },
    "tab": {
        "title": "প্যাট্রিক গুডউইন",
        "description": "সেন্ট্রাল ফ্লোরিডা ভিত্তিক পূর্ণ স্ট্যাক সফটওয়্যার ইঞ্জিনিয়ার"
    },
    "copy": {
        "text": "অনুলিপি",
        "copied": "অনুলিপি!"
    },
    "social_media": {
        "github": "গিথুব",
        "instagram": "ইনস্টাগ্রাম",
        "linkedin": "লিঙ্কডইন",
        "tiktok": "টিকটোক",
        "youtube": "ইউটিউব",
        "text_strip": "আমাকে অনুসরণ করুন"
    },
    "logotext": "প্যাট্রিক"
}