{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Dom",
        "about": "O meni",
        "portfolio": "Portfelj",
        "tiger": "Tiger jezik",
        "contact": "Kontaktirajte me"
    },
    "home": {
        "title": "Dom",
        "animated": {
            "first": "Softverski inženjer punog snopa",
            "second": "Web programer",
            "third": "Programer igre",
            "fourth": "Creator Creation"
        },
        "descriptionA": "Iskusio je potpun-htjelski softverski inženjer i web-razvojni povijest uspješno vodećim razvojnim projektima, od stvaranja Java modifikacija za Minecraft za unapređenje korisničkog iskustva u react.js i implementaciji sigurnog odmora, dok kontinuirano zapošljavaju agilne metodologije i efikasnu suradnju tima.",
        "descriptionB": "Pored toga, ja sam geografski sadržaj koji je uspješno iskoristio algoritme višestruke platforme društvenih medija, uključujući Instagram, YouTube i Tiktok, kako bi stekli ugledna i bazu pribora.",
        "portfolio_button": "Moj portfelj",
        "contact_button": "Kontaktirajte me",
        "about_button": "O meni"
    },
    "about": {
        "title": "O meni",
        "personal_summary": {
            "title": "Lični sažetak",
            "text": "Kao iskusni programer softvera sa potpunim snopom sa sjedištem u Orlandu, pokazao sam stručnost u raznim tehnologijama, od Java i C ++ za reakciju.js i čvora.js. Uz praćenje projekata koplja, uključujući razvoj programa Java modifikacije za MINECRAFT i web stranicu nagrađivanja za vozače kamiona, predstavio sam vodstvo i inovacije. Moja posvećenost izvrsnosti vidljiva je u mojoj sposobnosti da pojednostavim upravljanju projektima, rješavaju složene probleme i pružaju visokokvalitetna rješenja koja poboljšavaju korisničko iskustvo i pokreće organizacijski uspjeh."
        },
        "professional_experience": {
            "title": "Profesionalno iskustvo",
            "entries": [
                {
                    "jobtitle": "Junior softverski inženjer",
                    "where": "Orion180 osiguranje",
                    "date": "2024 - Prisutni"
                },
                {
                    "jobtitle": "Osnivač i kompletni programer softvera",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Softverski inženjer punog snopa",
                    "where": "Ubrzati učenje",
                    "date": "2023"
                },
                {
                    "jobtitle": "Vodeći web programer (studentski program)",
                    "where": "Clemson University GDI program",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Desk nadzornika",
                    "where": "Clemson University",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Tehničke veštine",
            "header1": "Programski jezici",
            "header2": "Okviri i biblioteke",
            "header3": "Alati i tehnologije"
        },
        "services": {
            "title": "Moje usluge",
            "entries": [
                {
                    "title": "Potpuni hrpa inženjering",
                    "text": "Nudim sveobuhvatnu rješenja na prednjem i nazadnom razvoju, osiguravajući besprijekornu integraciju i funkcionalnost u cijelom softverskom snopu."
                },
                {
                    "title": "Web razvoj",
                    "text": "Sa ekspertizom u HTML-u, CSS i JavaScript okvirima poput react.js, zanatam vizualno privlačne i prilagođene web lokacijama prilagođenim korisnicima kako bi zadovoljile specifične potrebe i preferencije klijenata."
                },
                {
                    "title": "Razvoj igara",
                    "text": "Upotrebljavajući jezici kao što su Java i C ++, specijaliziran sam za stvaranjem imirke igara, od koncepta i dizajna do implementacije i optimizacije, osiguravajući angažiranje igranja i glatkih performansi."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfelj",
        "filter_by": "Filtriranje portfelja prema:",
        "entries": {
            "connect_four": {
                "title": "Povežite četiri",
                "text": "Masivna porodica od preko 50+ implementacija Connect Four igre. Ovaj projekat uključuje implementacije u preko 30 različitih programskih jezika, uključujući Java, C ++, Python, JavaScript i još mnogo toga. Uz to, uključuje i preko 20+ različitih okvira ili drugih formata, uključujući react.js, rubin na šinama, asp.net i još mnogo toga.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Interop projekt",
                "text": "Projekt koji dokumentira interoperabilnost između različitih programskih jezika. Trenutno uključuje 15 različitih programskih jezika i 18 obrazaca izvršenja.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "excel_scripts": {
                "title": "Microsoft Excel Scriptsheet skripte (VBA)",
                "text": "Korisna biblioteka VBA skripta za Microsoft Excel. Ova biblioteka se koristi za automatizaciju zadataka u excel proračunskim tablicama.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON generator",
                "text": "Lagani JSON generator ugrađen u Python za MINECRAFT resurse i pakete podataka. Ovaj se projekat koristi za generiranje JSON datoteka za Minecraft Mods, uključujući prilagođene stavke, blokove i entitete. Vrlo korisno za ne samo stvaranje prilagođenih podataka podataka, već i za modove i putem funkcije preklopčenja MOD-a.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Moje obrazovno iskustvo",
                "text": "Pored mojih ličnih projekata, takođe sam stekao brojne veštine iz obrazovnog iskustva. Kliknite ovdje da biste vidjeli moj LinkedIn profil za više informacija.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Moje profesionalno iskustvo",
                "text": "Pored mojih ličnih projekata, takođe sam stekao brojne veštine iz profesionalnog iskustva. Kliknite ovdje da biste vidjeli moj LinkedIn profil za više informacija.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Web stranica Patrick Goodwin portfelj",
                "text": "Ova web stranica je moja lična web stranica portfelja, sagrađena sa react.js. Ovaj se projekat koristi za prikazivanje mojih vještina i projekata, kao i pružiti platformu za potencijalne poslodavce da me kontaktiraju. Ovaj se projekat koristi za stvaranje profesionalnog internetskog prisustva.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patrick's LUA biblioteka skripte",
                "text": "Korisna biblioteka LUA skripti za buduću referencu. Ova biblioteka se koristi za automatizaciju zadataka u LUA skripti, koje mogu ući u praktične zadatke za performanse, jer je Lua obično brži skriptni jezik nego piton i rubin.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "neovim_config": {
                "title": "Patrick's Neovim Config",
                "text": "Moja lična neovim konfiguracija. Ovaj se projekat koristi za konfiguriranje Neovim prema mojoj želji, uključujući prilagođene kestenje, teme i dodatke. Ovaj se projekt koristi za pravljenje neovima više korisničkih i efikasnije za moju ličnu upotrebu.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patrickov generator karte",
                "text": "Agenerator u okrugu i državi Sjedinjene Države, izgrađen sa Pythonom koristeći Geopandas i biblioteke MATplotlib. Ovaj se projekat koristi za generiranje karata Sjedinjenih Država, uključujući županijske i državne karte. Ovaj se projekat koristi za stvaranje prilagođenih mapa za vizualizaciju i analizu podataka.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patrick's PowerShell biblioteka skripte",
                "text": "Korisna biblioteka Swinghell skripta za buduću referencu. Korisno s značajkom $ Profil skripte, smatram da je to neizmjerno korisno za automatiziranje zadataka sa Windows terminala, jer sam čest korisnik Windows OS-a.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patrick's Library RUBY Script",
                "text": "Korisna biblioteka rubinskih skripti za buduću referencu. Korisno za buduće rubin na železnički razvojni pojmovi.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF Builder veština",
                "text": "Prilagođeni PDF graditelj izgrađen sa Pythonom putem PDFKIT i JINJA2 proširenja, uz HTML i JSON formatiranje. Ovaj se projekat koristi za generiranje PDF datoteka sa popisa vještina i projekata. Ovaj se projekt može koristiti za stvaranje prilagođenog stanja PDF-a, što je vrlo korisno za aplikacije za posao.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Projekt šifriranja Rijandela",
                "text": "Porodica od 10+ implementacija algoritma šifriranja u Rijandel u 128, 192 i 256 bita. Ovaj se projekat koristi za demonstriranje algoritma šifriranja u Rijandel u različitim programskim jezicima. Ovaj se projekat koristi za stvaranje porodice implementacija algoritma šifriranja u Rijandel-u.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft mod",
                "text": "MINECRAFT MOD koji dodaje prilagođene alate, oklop, mafije, blokove, dimenzije i mnogo više funkcija za igru. Izgrađeno sa Java verzijama 8-17 za odabir MINECRAFT verzija između 1,16 i 1,20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "TIGER programski jezik",
                "text": "Prilagođeni programski jezik izgrađen u istjeru i hrđu za eksperimentiranje s dizajnom i performansama prevodioca. Primenjeno na veb lokaciji portfelja pomoću Web sklop.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "TIGER Web stranica za veb lokaciju",
                "text": "Web stranica koju sam sagradio 2024. za tigrasta repust profesionalca, kompaniju za rep za vrata prtljažnika u Clemsonu, sc. Izgrađen sa react.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Projekt turbe",
                "text": "Porodica preko 30+ implementacija turbenice. Koristi se za demonstriranje turing cjelovitosti za različite programiranje jezika za istraživanje, posebno za programski jezik tigra.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "TIGER programski jezik"
    },
    "contact": {
        "title": "Kontaktirajte me",
        "header": "Podaci za kontakt",
        "email": "pattygsocials@gmail.com",
        "description": "Odgovaram na upite od e-pošte, LinkedIn poruka i instagram poruka. Nazvat ću i ako se moj broj pruži preko životopisa ili na drugi način, iako radije čuvam svoj telefonski broj privatno."
    },
    "tiger": {
        "title": "Tiger jezik",
        "description": "Programski jezik Tigra je prilagođeni programski jezik ugrađen u istrvo i hrđu za eksperiment s dizajnom i performansama prevodioca. Primenjeno na veb lokaciji portfelja pomoću Web sklop. Programski jezik Tigra je prilagođeni programski jezik ugrađen u istrvo i hrđu za eksperiment s dizajnom i performansama prevodioca. Primenjeno na veb lokaciji portfelja pomoću Web sklop.",
        "more_info1": "Za više informacija pogledajte ReadMe u",
        "more_info2": "TIGER programski jezik GitHub spremište.",
        "select_engine": "Odaberite motor:",
        "tiger_code": "Tiger Code:",
        "run_tiger": "Pokrenuti tigar",
        "output": "Izlaz:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Softverski inženjer punog snopa sa sjedištem u središnjoj Floridi"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Prati me"
    },
    "logotext": "Patrick"
}