{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Casa",
        "about": "Sobre mi",
        "portfolio": "Cartera",
        "tiger": "Llengua de tigre",
        "contact": "Poseu -vos en contacte amb mi"
    },
    "home": {
        "title": "Casa",
        "animated": {
            "first": "Enginyer de programari de pila completa",
            "second": "Desenvolupador web",
            "third": "Desenvolupador de jocs",
            "fourth": "Creador de contingut"
        },
        "descriptionA": "L’enginyer de programari i desenvolupador de programari amb pila completa experimentat amb un historial demostrat de projectes de desenvolupament liderants amb èxit, des de la creació de modificacions Java per a Minecraft fins a millorar l’experiència dels usuaris en React.js i la implementació de les API de REST segures, alhora que s’utilitzen metodologies àgils i una col·laboració efectiva d’equips.",
        "descriptionB": "A més, sóc un creador de contingut de geografia que ha aprofitat amb èxit els algoritmes de diverses plataformes de xarxes socials, incloses Instagram, YouTube i Tiktok, per obtenir una base respectable i atractiva.",
        "portfolio_button": "La meva cartera",
        "contact_button": "Poseu -vos en contacte amb mi",
        "about_button": "Sobre mi"
    },
    "about": {
        "title": "Sobre mi",
        "personal_summary": {
            "title": "Resum personal",
            "text": "Com a experimentat desenvolupador de programari amb stack amb seu a Orlando, FL, he demostrat experiència en diverses tecnologies, de Java i C ++ a React.js i node.js. Amb un historial de projectes de lideratge, incloent el desenvolupament d’un programa de modificació Java per a Minecraft i un lloc web gratificant per als conductors de camions, he mostrat el lideratge i la innovació. El meu compromís amb l’excel·lència és evident en la meva capacitat per racionalitzar la gestió de projectes, resoldre problemes complexos i oferir solucions d’alta qualitat que milloren l’experiència dels usuaris i impulsen l’èxit organitzatiu."
        },
        "professional_experience": {
            "title": "Experiència professional",
            "entries": [
                {
                    "jobtitle": "Enginyer de programari júnior",
                    "where": "Assegurança Orion180",
                    "date": "2024 - present"
                },
                {
                    "jobtitle": "Fundador i desenvolupador de programari Full Stack",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Enginyer de programari de pila completa",
                    "where": "Accelerar l’aprenentatge",
                    "date": "2023"
                },
                {
                    "jobtitle": "Lead Web Developer (Programa d’Estudiants)",
                    "where": "Programa GDI de la Universitat de Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Supervisora",
                    "where": "Universitat de Clemson",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Habilitats tècniques",
            "header1": "Llenguatges de programació",
            "header2": "Frameworks & Libraries",
            "header3": "Eines i tecnologies"
        },
        "services": {
            "title": "Els meus serveis",
            "entries": [
                {
                    "title": "Enginyeria de pila completa",
                    "text": "Ofereixo solucions completes tant en el desenvolupament frontal com en el fons, garantint una integració i una funcionalitat perfectes a tota la pila de programari."
                },
                {
                    "title": "Desenvolupament web",
                    "text": "Amb experiència en marcs HTML, CSS i JavaScript com React.js, elaboro llocs web atractius i fàcils d’utilitzar per satisfer les necessitats i preferències específiques dels clients."
                },
                {
                    "title": "Desenvolupament de jocs",
                    "text": "Aprofitant idiomes com Java i C ++, m’especialitzo en crear experiències de joc immersives, des del concepte i el disseny fins a la implementació i l’optimització, garantint el joc atractiu i el bon rendiment."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Cartera",
        "filter_by": "Filtre de cartera de:",
        "entries": {
            "connect_four": {
                "title": "Connecta quatre",
                "text": "Família massiva de més de 50 implementacions del joc Connect Four. Aquest projecte inclou implementacions en més de 30 llenguatges de programació diferents, inclosos Java, C ++, Python, JavaScript i molt més. A més, també inclou més de 20 més de marcs diferents o altres formats, inclosos React.js, Ruby on Rails, ASP.NET i molt més.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Projecte Interop",
                "text": "Un projecte que documenta la interoperabilitat entre diferents llenguatges de programació. Actualment inclou 15 llenguatges de programació diferents i 18 patrons d’execució.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "excel_scripts": {
                "title": "Microsoft Excel Scripts Scripts (VBA)",
                "text": "Una biblioteca útil de scripts VBA per a Microsoft Excel. Aquesta biblioteca s'utilitza per automatitzar tasques en fulls de càlcul Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "minecraft_json_generator": {
                "title": "Generador JSON Minecraft",
                "text": "Generador JSON lleuger construït a Python per a Minecraft Resource & Data Packs. Aquest projecte s’utilitza per generar fitxers JSON per a modificacions de Minecraft, inclosos articles personalitzats, blocs i entitats. Molt útil no només per crear dades de dades personalitzades, sinó també per a modificacions a través de la funció de commutació de nom de mod.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "La meva experiència educativa",
                "text": "Al costat dels meus projectes personals, també he adquirit nombroses habilitats per experiència educativa. Feu clic aquí per veure el meu perfil de LinkedIn per obtenir més informació.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "La meva experiència professional",
                "text": "Al costat dels meus projectes personals, també he adquirit nombroses habilitats per experiència professional. Feu clic aquí per veure el meu perfil de LinkedIn per obtenir més informació.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Lloc web de la cartera de Patrick Goodwin",
                "text": "Aquest lloc web és el meu lloc web de cartera personal, creat amb React.js. Aquest projecte s’utilitza per mostrar les meves habilitats i projectes, així com per proporcionar una plataforma perquè els possibles empresaris es posin en contacte amb mi. Aquest projecte s’utilitza per crear una presència en línia professional.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Biblioteca de scripts de Patrick Lua",
                "text": "Una biblioteca útil de guions LUA per a futures referències. Aquesta biblioteca s’utilitza per automatitzar tasques en scripts LUA, que poden resultar útils per a tasques necessàries per rendiment, ja que Lua sol ser un llenguatge de script més ràpid que tant Python com Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "neovim_config": {
                "title": "Configuració de Neovim de Patrick",
                "text": "La meva configuració personal de Neovim. Aquest projecte s’utilitza per configurar Neovim al meu gust, inclosos els claus, temes i plugins personalitzats. Aquest projecte s’utilitza per fer que Neovim sigui més fàcil d’utilitzar i eficient per al meu ús personal.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Generador de mapes de Patrick",
                "text": "Un generador de mapes del Comtat i Estat dels Estats Units, construït amb Python mitjançant les biblioteques Geopandas i Matplotlib. Aquest projecte s’utilitza per generar mapes dels Estats Units, inclosos els mapes del comtat i estatal. Aquest projecte s’utilitza per crear mapes personalitzats per a la visualització i anàlisi de dades.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Biblioteca de scripts de Patrick's PowerShell",
                "text": "Una biblioteca útil de scripts de PowerShell per a futures referències. Útil amb la funció de script de perfil $, em sembla útil per automatitzar tasques del terminal de Windows, ja que sóc un usuari freqüent del sistema operatiu Windows.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Biblioteca de scripts de Patrick Ruby",
                "text": "Una biblioteca útil de scripts de Ruby per a futures referències. Útil per a futurs conceptes de desenvolupament de Ruby on Rails.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "Constructor d’habilitats PDF",
                "text": "Un constructor PDF personalitzat construït amb Python a través de les extensions PDFKIT i Jinja2, al costat de la format HTML i JSON. Aquest projecte s’utilitza per generar fitxers PDF a partir d’una llista d’habilitats i projectes. Aquest projecte es pot utilitzar per crear un currículum PDF personalitzat, molt útil per a aplicacions de treball.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Projecte de xifrat de Rijandel",
                "text": "Una família de més de 10 implementacions de l'algoritme de xifrat de Rijandel el 128, 192 i 256 bits. Aquest projecte s'utilitza per demostrar l'algoritme de xifrat de Rijandel en diferents llenguatges de programació. Aquest projecte s'utilitza per crear una família d'implementacions de l'algoritme de xifrat de Rijandel.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc minecraft mod",
                "text": "Un mod Minecraft que afegeix eines personalitzades, armadura, mobs, blocs, dimensions i moltes més funcions al joc. Construït amb versions Java 8-17 per seleccionar versions Minecraft entre 1,16 i 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Llenguatge de programació de tigres",
                "text": "Llenguatge de programació personalitzada construït tant a Go com Rust per experimentar amb el disseny i el rendiment dels intèrprets. Implementat al lloc web de la cartera mitjançant el muntatge web.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Lloc web de Tiger Tailgating Pros",
                "text": "Un lloc web que vaig crear el 2024 per a Tiger Tailgating Pros, una empresa de cua a Clemson, SC. Construït amb React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Projecte de màquina Turing",
                "text": "Família de més de 30 implementacions de la màquina Turing. S'utilitza per demostrar la integritat de Turing per a diferents llenguatges de programació per a la investigació, especialment per al llenguatge de programació de Tiger.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Llenguatge de programació de tigres"
    },
    "contact": {
        "title": "Poseu -vos en contacte amb mi",
        "header": "Informació de contacte",
        "email": "patygsocials@gmail.com",
        "description": "Respon a les consultes de correu electrònic, missatges de LinkedIn i missatges d’Instagram. També tornaré a trucar si el meu número es proporciona a través del currículum o d’una altra manera, tot i que prefereixo mantenir el meu número de telèfon privat."
    },
    "tiger": {
        "title": "Llengua de tigre",
        "description": "El llenguatge de programació de Tiger és un llenguatge de programació personalitzat construït tant en GO com Rust per experimentar amb el disseny i el rendiment dels intèrprets. Implementat al lloc web de la cartera mitjançant el muntatge web. El llenguatge de programació de Tiger és un llenguatge de programació personalitzat construït tant en GO com Rust per experimentar amb el disseny i el rendiment dels intèrprets. Implementat al lloc web de la cartera mitjançant el muntatge web.",
        "more_info1": "Per obtenir més informació, consulteu el ReadMe al",
        "more_info2": "Llenguatge de programació de tigre Dipòsit GitHub.",
        "select_engine": "Seleccioneu Motor:",
        "tiger_code": "Codi de tigre:",
        "run_tiger": "Run Tiger",
        "output": "Sortida:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Enginyer de programari de pila completa amb seu al centre de la Florida"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Segueix -me"
    },
    "logotext": "Patrick"
}