{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Balay",
        "about": "Bahin nako",
        "portfolio": "Portfolio",
        "projects": "Mga Proyekto sa Website",
        "tiger": "Pinulong sa Tiger",
        "formatter": "Ang Formater sa JSON & YAML",
        "cube_solver": "Rubix cube solver",
        "contact": "Kontaka ako"
    },
    "home": {
        "title": "Balay",
        "animated": {
            "first": "Tibuok nga Stack Software Engineer",
            "second": "Developer sa Web",
            "third": "Developer sa dula",
            "fourth": "Tiglalang sa sulud"
        },
        "footer": "Ang website karon gihubad & avaliable sa 100+ nga mga pinulongan!",
        "descriptionA": "Nakasinati nga full-staff software engineer ug web developer nga adunay usa ka humot nga mga proyekto sa pag-uswag, gikan sa paghimo sa mga pag-usab sa Ministro sa MinAVA aron ma-encarcy ang mga pamaagi sa pag-uswag sa MinAVA aron maablihan ang mga pamaagi sa pag-uswag sa MinAVA aron ma-encarcy ang mga pamaagi sa pag-uswag sa MinAVA.",
        "descriptionB": "Dugang pa, ako usa ka tiglalang sa sulud sa geograpiya nga malampuson nga nagpalihok sa mga algorithm sa daghang mga platform sa Social Media, lakip ang Instagram, YouTube, ug Tiktube, aron maangkon ang usa ka tinahod ug pag-angkon sa usa ka tin-aw nga follower base.",
        "portfolio_button": "Akong portfolio",
        "contact_button": "Kontaka ako",
        "about_button": "Bahin nako"
    },
    "about": {
        "title": "Bahin nako",
        "personal_summary": {
            "title": "Personal nga katingbanan",
            "text": "Ingon usa ka batid nga bug-os nga software software nga nagbase sa Orlando, FL, gipakita ko ang kahanas sa lainlaing mga teknolohiya, gikan sa Java ug C ++ ug node.js.js.js.js. Uban sa usa ka track record sa mga proyekto sa Nanguna nga Balita, lakip ang pag-uswag sa usa ka programa sa pag-usab sa Java alang sa Minecraft ug usa ka magantihon nga webers sa trak, gipakita nako ang pagpangulo ug inobasyon. Ang akong pasalig sa kahinungdanon makita sa akong kaarang sa pag-streamline sa pagdumala sa proyekto, pagsulbad sa mga komplikado nga mga problema, ug paghatud sa mga kalidad nga solusyon sa us aka organisasyon."
        },
        "professional_experience": {
            "title": "Propesyonal nga kasinatian",
            "entries": [
                {
                    "jobtitle": "Junior software engineer",
                    "where": "Orion180 Seguro",
                    "date": "2024 - Karon"
                },
                {
                    "jobtitle": "Founder & Full Stack Software Developer",
                    "where": "Supremec",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Tibuok nga Stack Software Engineer",
                    "where": "Pagpadali sa Pagkat-on",
                    "date": "2023"
                },
                {
                    "jobtitle": "Pag-develop sa Web developer (programa sa estudyante)",
                    "where": "Clemson University GDI Program",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Superbisor sa Desk",
                    "where": "Clemson University",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Superbisor sa Desk",
                    "where": "Clemson University",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Mga Kahanas sa Teknikal",
            "header1": "Mga Pinulongan sa Programming",
            "header2": "Mga Frameworks & Librarier",
            "header3": "Mga Tool ug Teknolohiya"
        },
        "services": {
            "title": "Akong serbisyo",
            "entries": [
                {
                    "title": "Tibuok nga stack engineering",
                    "text": "Nagtanyag ako komprehensibo nga mga solusyon sa tibuuk nga pag-uswag sa unahan ug sa katapusan, pagsiguro sa seamless nga pag-apil ug pag-andar sa tibuuk nga stackware."
                },
                {
                    "title": "Web Development",
                    "text": "Uban sa kahanas sa HTML, CSS, ug Javascript Frameworks sama sa reaksyon.Js, ang akong mga baligya nga biswal nga nagpahiangay sa mga piho nga panginahanglanon ug gusto sa mga kliyente."
                },
                {
                    "title": "Pag-uswag sa Game",
                    "text": "Ang mga levering nga mga sinultian sama sa Java ug C ++, espesyalista ako sa paglalang sa mga makalipay nga kasinatian sa dula, gikan sa konsepto ug pagdala sa pag-optina ug pag-antus sa dula."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfolio",
        "filter_by": "Filter Portfolio ni:",
        "entries": {
            "biblioteca": {
                "title": "BIBLIOTOTECA JSON",
                "text": "Usa ka proyekto sa Python nga nag-streamrines nga mga hubad sa sinultian. Gitugotan ang akong website portfolio nga mahubad sa 70+ nga mga pinulongan, lakip ang mga Espanyol, Pranses, Intsik, Arabiko, ug daghan pa. Kini nga proyekto gigamit aron makahimo usa ka portfolio sa Multilingual nga Multilingual Sa kini nga proyekto, kapin sa 99% sa kalibutan ang makabasa sa akong portfolio sa usa ka maayo nga sinultian.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Ikonektar ang upat",
                "text": "Daghang Pamilya nga sobra sa 50+ nga pagpatuman sa Ilapang Dulaon nga Dula. Ang kini nga proyekto naglakip sa mga pagpatuman sa kapin sa 30 nga lainlaing mga pinulongan nga programa, lakip ang Java, C ++, Python, JavaScript, ug daghan pa. Dugang pa, naglakip usab kini sa 20+ lainlaing mga frameworks o uban pang mga format, lakip ang reaksyon.js, ruby ​​sa riles, asp.net, ug daghan pa.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "Grocery App",
                "text": "Usa ka Kompleto nga Punoan nga Tibuok-Set .NET 9 Blazor Server Application alang sa pagdumala sa mga butang sa grocery. Ang aplikasyon nagsunod sa controller / Serbisyo / repository nga sumbanan sa Balay sa Entidad alang sa pagkamakanunayon ug naglakip sa usa ka komprehensibo nga pagsulay sa suite.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Interop project",
                "text": "Usa ka proyekto nga naglaraw sa interoperability tali sa lainlaing mga pinulongan nga programa. Karon naglakip sa 15 nga lainlaing mga pinulongan nga programa ug 18 nga pattern sa pagpatay sa 18.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Rehistro sa imbentaryo",
                "text": "Usa ka bug-os nga Stack Demo Point of Sale (POS) nga magparehistro sa sistema sa pagdumala sa imbentaryo nga gitukod nga adunay angular 17+ ug node.js.js.js. Kini nga aplikasyon nagpakita sa usa ka propesyonal nga programa sa POS-Grade nga adunay panghimatuud sa tiggamit, pagkontrol sa pag-access sa papel, pagsubay sa imbentaryo, ug pagproseso sa pagbayad.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "Json & yaml auto formater",
                "text": "Usa ka Linter ug Ataformatter alang sa mga file sa JSON & YAML. Kini nga proyekto gigamit aron ma-format ang mga file sa JSON & YAML, nga mapuslanon kaayo alang sa pagpadayon nga limpyo ug organisado. Gitukod uban ang pag-adto, gitipon sa Webassembly, ug gilakip sa akong portfolio ingon usa ka proyekto sa website. Daghang mga format nga moabut sa umaabot.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft json generator",
                "text": "Ang gaan nga gulong nga si JSON nga gitukod sa Python alang sa Minecraft Resource & Data Packs. Kini nga proyekto gigamit aron makamugna ang mga file sa JSON alang sa Minecraft Mods, lakip ang mga kostumbre nga mga butang, mga bloke, ug mga entidad. Mapuslanon kaayo alang sa dili lamang paghimo sa mga naandan nga dataptacks, apan alang sa mga mods ingon usab pinaagi sa pag-on sa ngalan sa Mod Spy.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Akong kasinatian sa edukasyon",
                "text": "Uban sa akong kaugalingon nga mga proyekto, nakakuha usab ako daghang mga kahanas gikan sa kasinatian sa edukasyon. Pag-klik dinhi aron matan-aw ang akong profile sa LinkedIn alang sa dugang nga kasayuran.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Akong propesyonal nga kasinatian",
                "text": "Uban sa akong kaugalingon nga mga proyekto, nakakuha usab ako daghang mga kahanas gikan sa propesyonal nga kasinatian. Pag-klik dinhi aron matan-aw ang akong profile sa LinkedIn alang sa dugang nga kasayuran.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Website sa Patrick Goodwin Portfolio",
                "text": "Kini nga website mao ang akong personal nga website sa portfolio, nga gitukod sa reaksyon.js. Ang kini nga proyekto gigamit aron ipakita ang akong mga kahanas ug proyekto, ingon usab sa paghatag usa ka plataporma alang sa mga potensyal nga tag-iya sa pagkontak kanako. Kini nga proyekto gigamit aron makahimo usa ka propesyonal nga presensya sa online.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Ang librarya sa script sa Patrick",
                "text": "Usa ka mapuslanon nga librarya sa mga script sa LAA alang sa paghisgot sa umaabot. Ang kini nga librarya gigamit sa pag-automate sa mga gimbuhaton sa mga script sa LAA, nga mahimong moabut alang sa mga tahas nga pangatarungan nga nanginahanglan kay sa kasagaran usa ka mas paspas nga sinultihan sa script kaysa sa duha nga Python ug Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Ang mga scripts sa Micrick sa Micricft Excels Shallsheet (VBA)",
                "text": "Usa ka mapuslanon nga librarya sa mga script sa VBA alang sa Microsoft Excel. Ang kini nga librarya gigamit sa pag-automate sa mga gimbuhaton sa Excel spreadsheets.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Config ni Patrick's NeoVim",
                "text": "Ang akong personal nga pag-configure sa Neovim. Kini nga proyekto gigamit aron ma-configure ang NoOvim sa akong gusto, lakip ang mga naandan nga keybindings, tema, ug mga plugins. Ang kini nga proyekto gigamit sa paghimo sa neovim nga labi ka mahigalaon sa gumagamit ug episyente alang sa akong personal nga paggamit.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Ang mapa sa mapa sa Patrick",
                "text": "Usa ka generator sa mapa sa Estados Unidos ug State Generator, gitukod uban ang Python gamit ang Geopandas ug Matplotlib libraries. Kini nga proyekto gigamit aron makamugna ang mga mapa sa Estados Unidos, lakip ang mga mapa sa county ug estado. Kini nga proyekto gigamit aron makamugna ang mga kostumbre nga mga mapa alang sa pagdali sa data ug pag-analisar.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Poweryshall sa PowerShell sa Powrichel",
                "text": "Usa ka mapuslanon nga librarya sa mga poweryhell nga mga script alang sa umaabot nga pakisayran. Mapuslanon sa $ profile nga bahin sa script, nakit-an nako kini nga makatabang kaayo alang sa mga kalihokan sa pag-automate gikan sa Windows Terminal, ingon nga ako usa ka kanunay nga tiggamit sa Windows OS.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Ang Ruby Script Script sa Patrick",
                "text": "Usa ka mapuslanon nga librarya sa mga ruby ​​nga script alang sa paghisgot sa umaabot. Mapuslanon alang sa umaabot nga ruby ​​sa mga konsepto sa pag-uswag sa tren.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF Skills Builder",
                "text": "Usa ka naandan nga magtutukod sa PDF nga adunay Python pinaagi sa PDFKIT ug Jinja2 extensions, ubay sa HTML ug JSON FORORTTING. Kini nga proyekto gigamit aron makamugna ang mga file sa PDF gikan sa usa ka lista sa mga kahanas ug proyekto. Kini nga proyekto mahimong magamit sa paghimo sa usa ka naandan nga resume sa PDF, nga mapuslanon kaayo alang sa mga aplikasyon sa trabaho.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Project sa Rijandel encryption",
                "text": "Usa ka pamilya nga 10+ nga pagpatuman sa Rijandel Encryption Algorithm sa 128, 192, ug 256 bits. Ang kini nga proyekto gigamit aron ipakita ang rijandel encryption algorithm sa lainlaing mga pinulongan nga programa. Kini nga proyekto gigamit sa paghimo og usa ka pamilya nga pagpatuman sa Rijandel Encryption Algorithm.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Supreme Minecraft Mod",
                "text": "Ang usa ka Minecraft Mod nga nagdugang mga kostumbre nga mga himan, armadura, manggugubot, bloke, sukod, ug daghan pa nga mga bahin sa dula. Gitukod uban sa Java nga bersyon 8-17 alang sa Pilia ang mga bersyon sa Minecraft tali sa 1.16 ug 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tiger Programming Pinulongan",
                "text": "Custom nga Programming Pinulongan nga Gitukod sa Parehas nga Go & Rust aron mag-eksperimento sa design sa tighubad ug pasundayag. Gipatuman sa website sa portfolio nga gigamit ang web asembliya.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger nga nagbag-o nga website sa Pros",
                "text": "Usa ka website nga akong gitukod kaniadtong 2024 alang sa Tiger nga Tailgating Pros, usa ka kompanya nga manuktot sa Clemson, SC. Gitukod uban ang reaksyon.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "PROYEKTOR PROYEKTOR",
                "text": "Pamilya nga sobra sa 30+ nga pagpatuman sa turing machine. Gigamit aron ipakita ang pagkompleto sa pagkompleto alang sa lainlaing mga pinulongan nga programa alang sa panukiduki, labi na alang sa Tiger Programming Pinulongan.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tiger Programming Pinulongan"
    },
    "contact": {
        "title": "Kontaka ako",
        "header": "KONSIKASYON SA PAGTUON",
        "email": "pattygsocials@gmail.com",
        "description": "Motubag ako sa mga pangutana gikan sa email, mga mensahe sa LinkedIn, ug mga mensahe sa Instagram. Motawag usab ako kung ang akong numero gihatag pinaagi sa pagpadayon o kung dili, bisan kung gusto ko nga ipadayon ang akong numero sa telepono."
    },
    "formatter": {
        "title": "Ang Formater sa JSON & YAML",
        "description": "Ang Arson & Yaml Formatter usa ka himan nga nagtugot kanimo sa pag-format sa JSON ug YAML file. Gitukod kini sa pag-adto ug webassembly, ug kini gidisenyo aron mahimong paspas ug episyente. Ang formatter gidisenyo aron dali gamiton, nga adunay usa ka yano nga interface nga nagtugot kanimo sa pag-paste sa imong json o yaml code ug pag-format kini sa pag-klik sa usa ka buton.",
        "more_info1": "Alang sa dugang nga kasayuran, tan-awa ang pagbasa sa",
        "more_info2": "JSON / YAML FORMATER TEPOSITIYA.",
        "format_as": "Format ingon:",
        "auto_detect": "Auto Namatikdan",
        "format": "Pormat"
    },
    "cube_solver": {
        "title": "Rubix cube solver",
        "start": "Mosulbad"
    },
    "tiger": {
        "title": "Pinulong sa Tiger",
        "description": "Ang pinulongang Tiger Programming usa ka kostumbre nga sinultian nga programa nga gitukod sa parehong Go & Rust aron mag-eksperimento sa paghubad sa disenyo ug pasundayag. Gipatuman sa website sa portfolio nga gigamit ang web asembliya. Ang pinulongang Tiger Programming usa ka kostumbre nga sinultian nga programa nga gitukod sa parehong Go & Rust aron mag-eksperimento sa paghubad sa disenyo ug pasundayag. Gipatuman sa website sa portfolio nga gigamit ang web asembliya.",
        "more_info1": "Alang sa dugang nga kasayuran, tan-awa ang pagbasa sa",
        "more_info2": "Tiger Progruming LanguMing Github Gituritory.",
        "select_engine": "Pilia ang makina:",
        "tiger_code": "Tiger Code:",
        "run_tiger": "Pagdagan Tiger",
        "output": "Output:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Ang Full Stack Software Engineer nga nakabase sa Central Florida"
    },
    "copy": {
        "text": "Mangopya",
        "copied": "Gikopya!"
    },
    "social_media": {
        "github": "Nathub",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "Youtube",
        "text_strip": "Sundan ko"
    },
    "logotext": "Si patrick"
}