{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Domov",
        "about": "O mně",
        "portfolio": "Portfolio",
        "tiger": "Tygří jazyk",
        "contact": "Kontaktujte mě"
    },
    "home": {
        "title": "Domov",
        "animated": {
            "first": "Full Stack Software Engineer",
            "second": "Vývojář webu",
            "third": "Vývojář her",
            "fourth": "Tvůrce obsahu"
        },
        "descriptionA": "Zkušený softwarový inženýr a webový vývojář s plným stackem s prokázanou historií úspěšně předních vývojových projektů, od vytváření úprav Java pro Minecraft až po posílení uživatelských zkušeností v React.js a implementaci bezpečných REST API, přičemž neustále využívá agilní metodologie a efektivní spolupráci týmu.",
        "descriptionB": "Navíc jsem tvůrcem obsahu geografického obsahu, který úspěšně využil algoritmy více platforem sociálních médií, včetně Instagramu, YouTube a Tiktoku, aby získal slušnou a poutavou následovníku.",
        "portfolio_button": "Moje portfolio",
        "contact_button": "Kontaktujte mě",
        "about_button": "O mně"
    },
    "about": {
        "title": "O mně",
        "personal_summary": {
            "title": "Osobní shrnutí",
            "text": "Jako zkušený vývojář softwaru s plným zásobníkem se sídlem v Orlandu, FL, jsem předvedl odborné znalosti v různých technologiích, od Java a C ++ po React.js a Node.js. S výsledkem v čele projektů, včetně vývoje programu Java Modification pro Minecraft a odměňujícího webu pro řidiče nákladních vozidel, jsem předvedl vedení a inovace. Můj závazek k dokonalosti je zřejmý v mé schopnosti zefektivnit řízení projektů, řešit složité problémy a poskytovat vysoce kvalitní řešení, která zvyšují uživatelské zkušenosti a zvyšují úspěch organizace."
        },
        "professional_experience": {
            "title": "Odborná zkušenost",
            "entries": [
                {
                    "jobtitle": "Junior Software Engineer",
                    "where": "Orion180 Pojištění",
                    "date": "2024 - přítomný"
                },
                {
                    "jobtitle": "Zakladatel a vývojář softwaru Full Stack",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Full Stack Software Engineer",
                    "where": "Urychlit učení",
                    "date": "2023"
                },
                {
                    "jobtitle": "Lead Web Developer (Student Program)",
                    "where": "Program Clemson University GDI",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Dozorce stolu",
                    "where": "Clemson University",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Technické dovednosti",
            "header1": "Programovací jazyky",
            "header2": "Rámce a knihovny",
            "header3": "Nástroje a technologie"
        },
        "services": {
            "title": "Moje služby",
            "entries": [
                {
                    "title": "Full Stack Engineering",
                    "text": "Nabízím komplexní řešení v rámci vývoje front-end i back-end a zajišťuji bezproblémovou integraci a funkčnost v celém softwarovém zásobníku."
                },
                {
                    "title": "Vývoj webu",
                    "text": "S odbornými znalostmi v rámci HTML, CSS a JavaScript, jako jsou React.js, vyrábíme vizuálně přitažlivé a uživatelsky přívětivé webové stránky přizpůsobené tak, aby vyhovovaly specifickým potřebám a preferencím klientů."
                },
                {
                    "title": "Vývoj hry",
                    "text": "Využití jazyků, jako jsou Java a C ++, se specializuji na vytváření pohlcujících herních zážitků, od konceptu a designu po implementaci a optimalizaci, zajištění zapojení hraní a hladkého výkonu."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfolio",
        "filter_by": "Filtr portfolio od:",
        "entries": {
            "connect_four": {
                "title": "Připojte čtyři",
                "text": "Masivní rodina více než 50+ implementací Connect Four Game. Tento projekt zahrnuje implementace ve více než 30 různých programovacích jazycích, včetně Java, C ++, Pythonu, JavaScriptu a dalších. Kromě toho také zahrnuje více než 20+ různých rámců nebo jiných formátů, včetně React.js, Ruby on Rails, ASP.NET a další.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Interop Project",
                "text": "Projekt, který dokumentuje interoperabilitu mezi různými programovacími jazyky. V současné době zahrnuje 15 různých programovacích jazyků a 18 vzorců provádění.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "excel_scripts": {
                "title": "Skripty mikrosoft Excel Scripts (VBA)",
                "text": "Užitečná knihovna skriptů VBA pro Microsoft Excel. Tato knihovna se používá k automatizaci úkolů v tabulkách Excelu.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "minecraft_json_generator": {
                "title": "Generátor Minecraft JSON",
                "text": "Lehký generátor JSON vestavěný v Pythonu pro Minecraft Resource & Data Pack. Tento projekt se používá ke generování souborů JSON pro mody Minecraft, včetně vlastních položek, bloků a entit. Velmi užitečné nejen pro vytváření vlastních datapacks, ale také pro mody prostřednictvím funkce přepínání názvu MOD.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Moje vzdělávací zkušenost",
                "text": "Spolu s mými osobními projekty jsem také získal řadu dovedností od vzdělávacích zkušeností. Kliknutím sem zobrazíte můj profil LinkedIn pro více informací.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Moje odborná zkušenost",
                "text": "Spolu s mými osobními projekty jsem také získal řadu dovedností od odborné zkušenosti. Kliknutím sem zobrazíte můj profil LinkedIn pro více informací.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Web Patrick Goodwin Portfolio",
                "text": "Tento web je můj osobní portfolio web, postavený s React.js. Tento projekt se používá k předvedení mých dovedností a projektů a také k poskytnutí platformy pro potenciální zaměstnavatele, aby mě kontaktovali. Tento projekt se používá k vytvoření profesionální online přítomnosti.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Knihovna skriptů Patricka Lua",
                "text": "Užitečná knihovna skriptů LUA pro budoucí odkaz. Tato knihovna se používá k automatizaci úkolů ve skriptech LUA, které se mohou hodit pro úkoly, které jsou nutné, protože LUA je obvykle rychlejší skriptovací jazyk než Python i Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "neovim_config": {
                "title": "Patrickova Neovim Config",
                "text": "Moje osobní konfigurace Neovimu. Tento projekt se používá k konfiguraci Neovimu podle mých představ, včetně vlastních klíčových koni, témat a pluginů. Tento projekt se používá k tomu, aby společnost Neovim byla pro mé osobní použití více uživatelsky přívětivější a efektivnější.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patrickův generátor mapy",
                "text": "Generátor okresu Spojených států a státní mapy, postavený s Pythonem pomocí knihoven Geopandas a Matplotlib. Tento projekt se používá k generování map Spojených států, včetně krajských a státních map. Tento projekt se používá k vytvoření vlastních map pro vizualizaci a analýzu dat.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Knihovna Patricka PowerShell Scripts",
                "text": "Užitečná knihovna skriptů PowerShell pro budoucí odkaz. Užitečný s funkcí skriptu $ profil, považuji to za nesmírně užitečné pro automatizaci úkolů z terminálu Windows, protože jsem častým uživatelem systému Windows OS.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patrickova knihovna rubínových skriptů",
                "text": "Užitečná knihovna rubínových skriptů pro budoucí odkaz. Užitečné pro budoucí vývojové koncepty Ruby on Rails.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF dovednosti Builder",
                "text": "Vlastní stavitel PDF postavený s Pythonem prostřednictvím rozšíření PDFKIT a JINJA2, spolu s formátováním HTML a JSON. Tento projekt se používá ke generování souborů PDF ze seznamu dovedností a projektů. Tento projekt lze použít k vytvoření vlastního životopisu PDF, který je velmi užitečný pro aplikace úlohy.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandel Encryption Project",
                "text": "Rodina 10+ implementací šifrovacího algoritmu Rijandel v 128, 192 a 256 bitů. Tento projekt se používá k demonstraci algoritmu šifrování Rijandel v různých programovacích jazycích. Tento projekt se používá k vytvoření rodiny implementací šifrovacího algoritmu Rijandel.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod",
                "text": "Mod Minecraft, který do hry přidává vlastní nástroje, brnění, davy, bloky, rozměry a mnoho dalších funkcí. Postaveno s verzemi Java 8-17 pro vybrané verze Minecraft mezi 1.16 a 1,20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tiger programovací jazyk",
                "text": "Vlastní programovací jazyk postavený v GO a REST pro experimentování s designem a výkonem tlumočníky. Implementováno na webu portfolia pomocí webové sestavy.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Webové stránky tygrů tailgating profesionálů",
                "text": "Web, který jsem postavil v roce 2024 pro Tiger Tailgating Pros, Tailgating Company v Clemson, SC. Postaveno s React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Projekt Turing Machine",
                "text": "Rodina více než 30 a více implementací Turingova stroje. Používá se k demonstraci Turingovy úplnosti pro různé programovací jazyky pro výzkum, zejména pro jazyk programování tygra.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tiger programovací jazyk"
    },
    "contact": {
        "title": "Kontaktujte mě",
        "header": "Kontaktní informace",
        "email": "Pattygsocials@gmail.com",
        "description": "Odpovídám na dotazy z e -mailů, zpráv LinkedIn a Instagramu. Zavolám také zpět, pokud bude moje číslo poskytováno prostřednictvím životopisu nebo jinak, i když raději udržuji své telefonní číslo soukromé."
    },
    "tiger": {
        "title": "Tygří jazyk",
        "description": "Programovací jazyk Tiger je vlastní programovací jazyk vestavěný v GO a REST, aby experimentoval s designem a výkonem tlumočníky. Implementováno na webu portfolia pomocí webové sestavy. Programovací jazyk Tiger je vlastní programovací jazyk vestavěný v GO a REST, aby experimentoval s designem a výkonem tlumočníky. Implementováno na webu portfolia pomocí webové sestavy.",
        "more_info1": "Více informací naleznete na README v",
        "more_info2": "Tiger Programovací jazyk GitHub Repository.",
        "select_engine": "Vyberte motor:",
        "tiger_code": "Tygří kód:",
        "run_tiger": "Spusťte Tiger",
        "output": "Výstup:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Full Stack Software Engineer se sídlem na střední Floridě"
    },
    "social_media": {
        "github": "GitHub",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Následujte mě"
    },
    "logotext": "Patrick"
}