{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Startseite",
        "about": "Über mich",
        "portfolio": "Portfolio",
        "tiger": "Tiger-Sprache",
        "contact": "Kontakt"
    },
    "home": {
        "title": "Startseite",
        "animated": {
            "first": "Full-Stack-Softwareentwickler",
            "second": "Webentwickler",
            "third": "Spieleentwickler",
            "fourth": "Content Creator"
        },
        "descriptionA": "Erfahrener Full-Stack-Softwareentwickler und Webentwickler mit nachgewiesener Erfahrung in der erfolgreichen Leitung von Entwicklungsprojekten, von der Erstellung von Java-Modifikationen für Minecraft bis zur Verbesserung der Benutzererfahrung in React.js und der Implementierung sicherer REST-APIs, unter konsequenter Anwendung agiler Methoden und effektiver Teamarbeit.",
        "descriptionB": "Außerdem bin ich ein Content Creator im Bereich Geografie, der erfolgreich die Algorithmen mehrerer sozialer Medienplattformen wie Instagram, YouTube und TikTok genutzt hat, um eine respektable und engagierte Anhängerschaft aufzubauen.",
        "portfolio_button": "Mein Portfolio",
        "contact_button": "Kontaktiere mich",
        "about_button": "Über mich"
    },
    "about": {
        "title": "Über mich",
        "personal_summary": {
            "title": "Persönliche Zusammenfassung",
            "text": "Als erfahrener Full-Stack-Softwareentwickler mit Sitz in Orlando, FL, habe ich Fachkenntnisse in verschiedenen Technologien bewiesen, von Java und C++ bis React.js und Node.js. Mit einer Erfolgsbilanz in der Leitung von Projekten, darunter die Entwicklung eines Java-Modifikationsprogramms für Minecraft und einer Belohnungswebsite für Lkw-Fahrer, habe ich Führungsstärke und Innovationskraft unter Beweis gestellt. Mein Streben nach Exzellenz zeigt sich in meiner Fähigkeit, das Projektmanagement zu optimieren, komplexe Probleme zu lösen und qualitativ hochwertige Lösungen zu liefern, die das Benutzererlebnis verbessern und den Unternehmenserfolg fördern."
        },
        "professional_experience": {
            "title": "Berufserfahrung",
            "entries": [
                {
                    "jobtitle": "Junior-Softwareentwickler",
                    "where": "Orion180 Versicherung",
                    "date": "2024 - Gegenwart"
                },
                {
                    "jobtitle": "Gründer & Full-Stack-Softwareentwickler",
                    "where": "SupremeMC",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Full-Stack-Softwareentwickler",
                    "where": "Accelerate Learning",
                    "date": "2023"
                },
                {
                    "jobtitle": "Leitender Webentwickler (Studentenprogramm)",
                    "where": "Clemson University GDI-Programm",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Schichtleiter",
                    "where": "Clemson University",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Technische Fähigkeiten",
            "header1": "Programmiersprachen",
            "header2": "Frameworks & Bibliotheken",
            "header3": "Tools & Technologien"
        },
        "services": {
            "title": "Meine Dienstleistungen",
            "entries": [
                {
                    "title": "Full-Stack-Entwicklung",
                    "text": "Ich biete umfassende Lösungen für die Frontend- und Backend-Entwicklung an und gewährleiste eine nahtlose Integration und Funktionalität über den gesamten Software-Stack hinweg."
                },
                {
                    "title": "Webentwicklung",
                    "text": "Mit Fachkenntnissen in HTML, CSS und JavaScript-Frameworks wie React.js erstelle ich visuell ansprechende und benutzerfreundliche Websites, die auf die spezifischen Bedürfnisse und Wünsche der Kunden zugeschnitten sind."
                },
                {
                    "title": "Spieleentwicklung",
                    "text": "Mit Programmiersprachen wie Java und C++ spezialisiere ich mich auf die Erstellung von fesselnden Spielerlebnissen – von der Konzeption und Gestaltung bis zur Umsetzung und Optimierung – und sorge so für unterhaltsames Gameplay und reibungslose Leistung."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfolio",
        "filter_by": "Portfolio filtern nach:",
        "entries": {
            "connect_four": {
                "title": "Vier gewinnt",
                "text": "Umfangreiche Sammlung von über 50 Implementierungen des Spiels Vier gewinnt. Dieses Projekt enthält Implementierungen in über 30 Programmiersprachen, darunter Java, C++, Python, JavaScript und mehr. Außerdem enthält es über 20 verschiedene Frameworks oder Formate, darunter React.js, Ruby on Rails, ASP.NET und mehr.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Interoperabilitätsprojekt",
                "text": "Ein Projekt, das die Interoperabilität zwischen verschiedenen Programmiersprachen dokumentiert. Derzeit umfasst es 15 verschiedene Programmiersprachen und 18 Ausführungsmuster.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "excel_scripts": {
                "title": "Microsoft Excel VBA-Skripte",
                "text": "Eine nützliche Bibliothek mit VBA-Skripten für Microsoft Excel. Diese Bibliothek dient zur Automatisierung von Aufgaben in Excel-Tabellen.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON-Generator",
                "text": "Leichter JSON-Generator in Python für Minecraft-Ressourcen- und Datenpakete. Dieses Projekt dient zur Erstellung von JSON-Dateien für Minecraft-Mods, einschließlich benutzerdefinierter Items, Blöcke und Entitäten. Sehr nützlich sowohl für benutzerdefinierte Datenpakete als auch für Mods über die Mod-Namensumschaltung.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Meine Ausbildungserfahrung",
                "text": "Neben meinen persönlichen Projekten habe ich auch viele Fähigkeiten durch Ausbildungserfahrungen erworben. Klicken Sie hier, um mein LinkedIn-Profil für weitere Informationen zu besuchen.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Meine Berufserfahrung",
                "text": "Neben meinen persönlichen Projekten habe ich auch viele Fähigkeiten durch berufliche Erfahrungen erworben. Klicken Sie hier, um mein LinkedIn-Profil für weitere Informationen zu besuchen.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Goodwin Portfolio-Website",
                "text": "Diese Website ist meine persönliche Portfolio-Website, die mit React.js erstellt wurde. Dieses Projekt dient dazu, meine Fähigkeiten und Projekte zu präsentieren und potenziellen Arbeitgebern eine Kontaktplattform zu bieten. Es schafft eine professionelle Online-Präsenz.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patricks Lua-Skriptbibliothek",
                "text": "Eine nützliche Bibliothek mit Lua-Skripten für zukünftige Referenz. Diese Bibliothek dient zur Automatisierung von Aufgaben in Lua-Skripten, die bei leistungsintensiven Aufgaben hilfreich sein können, da Lua in der Regel schneller als Python und Ruby ist.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "neovim_config": {
                "title": "Patricks Neovim-Konfiguration",
                "text": "Meine persönliche Neovim-Konfiguration. Dieses Projekt wird verwendet, um Neovim nach meinen Wünschen zu konfigurieren, einschließlich benutzerdefinierter Tastenkombinationen, Designs und Plugins. Es macht Neovim benutzerfreundlicher und effizienter.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patricks Kartengenerator",
                "text": "Ein Generator für US-Karten auf Kreis- und Bundesstaatsebene, erstellt mit Python unter Verwendung der Geopandas- und Matplotlib-Bibliotheken. Dieses Projekt wird verwendet, um benutzerdefinierte Karten für Datenvisualisierung und Analyse zu erstellen.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patricks PowerShell-Skriptbibliothek",
                "text": "Eine nützliche Sammlung von PowerShell-Skripten für zukünftige Referenz. Besonders nützlich mit der $profile-Funktion, um Aufgaben über das Windows-Terminal zu automatisieren.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patricks Ruby-Skriptbibliothek",
                "text": "Eine nützliche Sammlung von Ruby-Skripten für zukünftige Referenz. Besonders nützlich für die zukünftige Ruby-on-Rails-Entwicklung.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF-Fähigkeiten-Generator",
                "text": "Ein benutzerdefinierter PDF-Generator, erstellt mit Python über die Pdfkit- und Jinja2-Erweiterungen sowie HTML- und JSON-Formatierung. Er dient zur Generierung von PDF-Dateien aus einer Liste von Fähigkeiten und Projekten – ideal für Bewerbungen.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandel-Verschlüsselungsprojekt",
                "text": "Eine Sammlung von über 10 Implementierungen des Rijandel-Verschlüsselungsalgorithmus in 128, 192 und 256 Bit. Dieses Projekt demonstriert die Implementierung des Algorithmus in verschiedenen Programmiersprachen.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "SupremeMC Minecraft-Mod",
                "text": "Ein Minecraft-Mod, der benutzerdefinierte Werkzeuge, Rüstungen, Kreaturen, Blöcke, Dimensionen und viele weitere Features hinzufügt. Entwickelt mit Java-Versionen 8–17 für Minecraft-Versionen 1.16 bis 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tiger-Programmiersprache",
                "text": "Benutzerdefinierte Programmiersprache, entwickelt in Go und Rust, um mit Interpreter-Design und Performance zu experimentieren. Implementiert auf der Portfolio-Website über WebAssembly.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger Tailgating Pros Website",
                "text": "Eine Website, die ich 2024 für Tiger Tailgating Pros, ein Tailgating-Unternehmen in Clemson, SC, erstellt habe. Entwickelt mit React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turingmaschinen-Projekt",
                "text": "Sammlung von über 30 Implementierungen der Turingmaschine. Dient zur Demonstration der Turing-Vollständigkeit verschiedener Programmiersprachen – insbesondere im Zusammenhang mit der Tiger-Programmiersprache.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tiger-Programmiersprache"
    },
    "contact": {
        "title": "Kontakt",
        "header": "Kontaktinformationen",
        "email": "pattygsocials@gmail.com",
        "description": "Ich beantworte Anfragen per E-Mail, LinkedIn und Instagram. Ich rufe auch zurück, wenn meine Nummer über einen Lebenslauf bereitgestellt wird, bevorzuge es aber, meine Telefonnummer privat zu halten."
    },
    "tiger": {
        "title": "Tiger-Sprache",
        "description": "Die Tiger-Programmiersprache ist eine benutzerdefinierte Sprache, die in Go und Rust entwickelt wurde, um mit Interpreterdesign und Leistung zu experimentieren. Auf der Portfolio-Website mithilfe von WebAssembly implementiert.",
        "more_info1": "Weitere Informationen finden Sie in der README im ",
        "more_info2": "GitHub-Repository der Tiger-Programmiersprache.",
        "select_engine": "Engine auswählen:",
        "tiger_code": "Tiger-Code:",
        "run_tiger": "Tiger ausführen",
        "output": "Ausgabe:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Full-Stack-Softwareentwickler mit Sitz in Zentralflorida"
    },
    "social_media": {
        "github": "GitHub",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "TikTok",
        "youtube": "YouTube",
        "text_strip": "Folge mir"
    },
    "logotext": "PATRICK"
}