{
    "name": "ޕެޓްރިކް ގުޑްވިން",
    "menu": {
        "home": "ގެ",
        "about": "އަހަރެންނާ ބެހޭގޮތުން",
        "portfolio": "ޕޯޓްފޯލިއޯ",
        "projects": "ވެބްސައިޓް ޕްރޮޖެކްޓްސް",
        "tiger": "ޓައިގަރ ބަސް",
        "formatter": "ޖޭއެސްއޯއެން އެންޑް ޔަމްލް ފޯމެޓް",
        "contact": "އަހަރެންނާ ގުޅާލާށެވެ ."
    },
    "home": {
        "title": "ގެ",
        "animated": {
            "first": "ފުލް ސްޓޭކް ސޮފްޓްވެއާ އިންޖިނިއަރ",
            "second": "ވެބް ޑިވެލޮޕަރ",
            "third": "ގޭމް ޑިވެލޮޕަރ",
            "fourth": "ކޮންޓެންޓް ކްރިއޭޓަރ"
        },
        "footer": "ވެބްސައިޓް މިހާރު 100+ ބަސްބަހުން ތަރުޖަމާކޮށް އެވޭލިއޭބަލް!",
        "descriptionA": "މައިންކްރާފްޓަށް ޖާވާ މޮޑިފިކޭޝަންސް އުފެއްދުމުން ފެށިގެން ރިއެކްޓް.ޖޭއެސްގައި ޔޫޒަރ އެކްސްޕީރިއަންސް އިތުރުކުރުމާއި، ސެކިއުރިޓީ ރެސްޓް އެޕީއައިތައް ތަންފީޒުކުރުމާއި، އެޖައިލް މެތޮޑޮލޮޖީތަކާއި، އެފެކްޓިވް ޓީމް ކޮލަބަރޭޝަންގެ އިތުރުން، ތަޖުރިބާކާރު ފުލް ސްޓޭކް ސޮފްޓްވެއާ އިންޖިނިއަރ އެންޑް ވެބް ޑިވެލޮޕަރެއް.",
        "descriptionB": "މީގެ އިތުރުން އަޅުގަނޑަކީ އިންސްޓަގްރާމް، ޔޫޓިއުބް، އަދި ޓިކްޓޮކް ފަދަ ގިނަ ސޯޝަލް މީޑިއާ ޕްލެޓްފޯމްތަކުގެ އެލްގޮރިޒަމްތައް ކާމިޔާބުކަމާއެކު ލީވަރކޮށްފައިވާ ޖިއޮގްރަފީ ކޮންޓެންޓް ކްރިއޭޓަރެއް ކަމަށާއި، އެ ޕްލެޓްފޯމްތަކުގެ ތެރެއިން އިހުތިރާމް ލިބިގެންވާ އަދި ޝައުގުވެރި ފޮލޯވަރ ބޭސްއެއް ހޯދުމަށް މަސައްކަތް ކުރާ ކަމަށެވެ.",
        "portfolio_button": "އަހަރެންގެ ޕޯޓްފޯލިއޯ",
        "contact_button": "އަހަރެންނާ ގުޅާލާށެވެ .",
        "about_button": "އަހަރެންނާ ބެހޭގޮތުން"
    },
    "about": {
        "title": "އަހަރެންނާ ބެހޭގޮތުން",
        "personal_summary": {
            "title": "އަމިއްލަ ޚުލާސާ",
            "text": "އޮރލަންޑޯ، އެފް.އެލް ގައި ބިނާކޮށްފައިވާ ތަޖުރިބާކާރު ފުލް ސްޓޭކް ސޮފްޓްވެއާ ޑިވެލޮޕަރެއްގެ ގޮތުގައި، ޖާވާ އަދި ސީ++ އިން ފެށިގެން ރިއެކްޓް.ޖޭސް އަދި ނޯޑް.ޖޭސް އާއި ހަމައަށް، އެކި ޓެކްނޮލޮޖީތަކުގެ ތަޖުރިބާ އަޅުގަނޑު ދައްކާލާނަމެވެ. މައިންކްރާފްޓަށް ޖާވާ މޮޑިފިކޭޝަން ޕްރޮގްރާމެއް އެކުލަވާލުމާއި ޓްރަކް ޑްރައިވަރުންނަށް އިނާމު ލިބޭ ވެބްސައިޓެއް ހިމެނޭ ގޮތަށް ޕްރޮޖެކްޓްގެ ޕްރޮޖެކްޓްތަކުގެ ޓްރެކް ރެކޯޑަކާއެކު، ލީޑަޝިޕާއި އިނޮވޭޝަން ދައްކާލާފައި މިވަނީ. ޕްރޮޖެކްޓް މެނޭޖްމަންޓް ސްޓްރީމްލައިންކޮށް، ކޮމްޕްލެކްސް މައްސަލަތައް ހައްލުކޮށް، ޔޫޒަރ އެކްސްޕީރިއަންސް އިތުރުކޮށް، އޮގަނައިޒޭޝަނަލް ސަކްސެސް ދުއްވުމުގެ މަތީ ފެންވަރުގެ ހައްލުތައް ފޯރުކޮށްދިނުމުގެ ގާބިލްކަން އަޅުގަނޑަށް މޮޅުވުމަށް އަޅުގަނޑުގެ ކޮމިޓްމަންޓް ފާހަގަކުރެވެއެވެ."
        },
        "professional_experience": {
            "title": "ޕްރޮފެޝަނަލް ތަޖުރިބާ",
            "entries": [
                {
                    "jobtitle": "ޖޫނިއަރ ސޮފްޓްވެއަރ އިންޖިނިއަރ",
                    "where": "Orion180 އިންޝުއަރެންސް",
                    "date": "2024 - ޕްރެޒެންޓް"
                },
                {
                    "jobtitle": "ފައުންޑަރ އެންޑް ފުލް ސްޓޭކް ސޮފްޓްވެއަރ ޑިވެލޮޕަރ",
                    "where": "ސުޕްރީމްއެމްސީ",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "ފުލް ސްޓޭކް ސޮފްޓްވެއާ އިންޖިނިއަރ",
                    "where": "އުނގެނުން އަވަސްކުރުން",
                    "date": "2023"
                },
                {
                    "jobtitle": "ލީޑް ވެބް ޑިވެލޮޕަރ (ސްޓޫޑެންޓް ޕްރޮގްރާމް)",
                    "where": "ކްލެމްސަން ޔުނިވަރސިޓީ ޖީޑީއައި ޕްރޮގްރާމް",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "ޑެސްކް ސުޕަވައިޒަރ",
                    "where": "ކްލެމްސަން ޔުނިވާސިޓީ",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "ފަންނީ ހުނަރުތައް",
            "header1": "ޕްރޮގްރާމިންގ ލޭންގުއޭޖްސް",
            "header2": "ފްރޭމްވޯކްސް އެންޑް ލައިބްރަރީސް",
            "header3": "ޓޫލްސް އެންޑް ޓެކްނޮލޮޖީސް"
        },
        "services": {
            "title": "އަހަރެންގެ ޚިދުމަތްތައް",
            "entries": [
                {
                    "title": "ފުލް ސްޓޭކް އިންޖިނިއަރިންގ",
                    "text": "އަޅުގަނޑު ފްރަންޓް އެންޑް އަދި ބެކް އެންޑް ޑިވެލޮޕްމަންޓްގެ ތެރެއިން ފުރިހަމަ ހައްލުތަކެއް ހުށަހަޅައި، މުޅި ސޮފްޓްވެއާ ސްޓޭކްގައި ސީމްލޭސް އިންޓަގްރޭޝަން އަދި ފަންކްޝަނަލިޓީ ކަށަވަރުކޮށްދެމެވެ."
                },
                {
                    "title": "ވެބް ޑިވެލޮޕްމަންޓް",
                    "text": "އެޗްޓީއެމްއެލް، ސީއެސްއެސް، އަދި ރިއެކްޓް.ޖޭސް ފަދަ ޖާވާސްކްރިޕްޓް ފްރޭމްވޯކްސްގެ ތަޖުރިބާ ލިބިފައިވާ، ކްލައިންޓުންގެ ވަކި ބޭނުންތަކާއި އިސްކަންދޭ ކަންކަން ފުއްދުމަށް ތައްޔާރުކޮށްފައިވާ ވިޝުއަލްލީ އެޕީލިންގް އަދި ޔޫޒަރ ފްރެންޑްލީ ވެބްސައިޓްތައް ކްރާފްޓް ކުރަމެވެ."
                },
                {
                    "title": "ގޭމް ޑިވެލޮޕްމަންޓް",
                    "text": "ޖާވާ އަދި ސީ++ ފަދަ ބަސްތައް ލީވަރ ކޮށްގެން، ކޮންސެޕްޓް އަދި ޑިޒައިން އިން ފެށިގެން އިމްޕްލިމެންޓޭޝަން އަދި އޮޕްޓިމައިޒޭޝަން އާއި ހަމައަށް އިމަރސިވް ގޭމިންގ ތަޖުރިބާތައް އުފެއްދުމާއި، އެންގޭޖިންގ ގޭމްޕްލޭ އާއި އޮމާން ޕާފޯމަންސް ކަށަވަރު ކުރަމެވެ."
                }
            ]
        }
    },
    "portfolio": {
        "title": "ޕޯޓްފޯލިއޯ",
        "filter_by": "ފިލްޓަރ ޕޯޓްފޯލިއޯ ބައި:",
        "entries": {
            "biblioteca": {
                "title": "ބިބްލިއޮޓެކާ ޖޭއެސްއޯއެން",
                "text": "ބަހުގެ ތަރުޖަމާތައް ސްޓްރީމްލައިން ކުރާ ޕައިތަން ޕްރޮޖެކްޓެކެވެ. ސްޕެނިޝް، ފްރެންޗް، ޗައިނީސް، އަރަބި، އަދި އެހެނިހެން ގިނަ ބަހަކަށް އަޅުގަނޑުގެ ވެބްސައިޓް ޕޯޓްފޯލިއޯ 70+ ބަހަށް ތަރުޖަމާ ކުރުމުގެ ފުރުސަތު ލިބެއެވެ. މި ޕްރޮޖެކްޓަކީ މަލްޓިލިންގުއަލް ވެބްސައިޓް ޕޯޓްފޯލިއޯއެއް އުފެއްދުމަށް ބޭނުންކުރާ ޕްރޮޖެކްޓެއް ކަމަށާއި، މިއީ ފުޅާ ދާއިރާއެއްގައި އޯޑިއެންސްއަށް ވާސިލްވުމަށް ވަރަށް ބޭނުންތެރި ޕްރޮޖެކްޓެކެވެ. މި މަޝްރޫޢާއެކު ދުނިޔޭގެ %99 އަށްވުރެ ގިނަ މީހުންނަށް އަޅުގަނޑުގެ ޕޯޓްފޯލިއޯ ކިޔައިލެވޭނީ ފަރިތަ ބަހަކުންނެވެ.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "ހަތަރު ހަތަރު",
                "text": "ކަނެކްޓް ފޯ ގޭމްގެ 50+ އަށް ވުރެ ގިނަ އިމްޕްލިމެންޓޭޝަންތަކުގެ ބޮޑު އާއިލާއެއް. މި ޕްރޮޖެކްޓްގައި ޖާވާ، ސީ++، ޕައިތަން، ޖާވާސްކްރިޕްޓް، އަދި އެހެނިހެން ތަފާތު 30 އަށްވުރެ ގިނަ ޕްރޮގްރާމިންގ ލޭންގުއޭޖްތަކުގައި އިމްޕްލިމެންޓޭޝަންތައް ހިމެނެއެވެ. މީގެ އިތުރުން 20+ އަށް ވުރެ ގިނަ ތަފާތު އޮނިގަނޑު ނުވަތަ އެހެން ފޯމެޓްތަކެއް ވެސް ހިމެނޭއިރު، އޭގެ ތެރޭގައި ރިއެކްޓް.ޖޭސް، ރޫބީ އޮން ރޭލްސް، އޭއެސްޕީ.ނެޓް، އަދި އެހެނިހެން ފޯމެޓްތައް ހިމެނެއެވެ.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "އިންޓަރއޮޕް ޕްރޮޖެކްޓް",
                "text": "އެކި ޕްރޮގްރާމިންގ ލޭންގުއޭޖްތަކުގެ މެދުގައި އިންޓަރއޮޕަރޭބިލިޓީ ޑޮކިއުމަންޓްކުރާ ޕްރޮޖެކްޓެކެވެ. މިހާރު ތަފާތު 15 ޕްރޮގްރާމިންގ ލޭންގުއޭޖް އާއި 18 އެގްޒެކެޝަން ޕެޓަރން ހިމެނެއެވެ.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "ޖޭއެސްއޯއެން އެންޑް ޔަމްލް އޮޓޯ ފޯމެޓް",
                "text": "a linter & autoformatter for JSON & YAML FILES. މި ޕްރޮޖެކްޓަކީ ޖޭއެސްއޯއެން އެންޑް ޔަމްލް ފައިލްތައް ފޯމެޓް ކުރުމަށް ބޭނުންކުރާ ޕްރޮޖެކްޓެއް ކަމަށާއި، މިއީ ކޯޑް ސާފުކޮށް އިންތިޒާމުކޮށް ބެހެއްޓުމަށް ވަރަށް ބޭނުންތެރި ޕްރޮޖެކްޓެކެވެ. ޖީއޯ އާއި އެކު ބިލްޓްކޮށް، ވެބްސެމްބްލީ އާއި އެކު އެކުލަވާލާފައިވާ، އަދި ވެބްސައިޓް ޕްރޮޖެކްޓެއްގެ ގޮތުގައި އަޅުގަނޑުގެ ޕޯޓްފޯލިއޯއަށް ވަށާލެވިފައިވާ ކުންފުންޏެކެވެ. ކުރިއަށް އޮތްތަނުގައި އިތުރު ފޯމެޓްތައް އަންނަން ޖެހޭނެ.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "މައިންކްރާފްޓް ޖޭއެސްއޯއެން ޖެނެރޭޓަރ",
                "text": "މައިންކްރާފްޓް ރިސޯސް އެންޑް ޑޭޓާ ޕެކްސް އަށް ޕައިތަންގައި ބިލްޓް ކޮށްފައިވާ ލައިޓްވޭޓް ޖޭއެސްއޯއެން ޖެނެރޭޓަރ. މި ޕްރޮޖެކްޓަކީ މައިންކްރާފްޓް މޮޑްސް އަށް ޖޭއެސްއޯއެން ފައިލްތައް އުފެއްދުމަށް ބޭނުންކުރާ ޕްރޮޖެކްޓެއް ކަމަށާއި، އޭގެ ތެރޭގައި ކަސްޓަމް އައިޓަމް، ބްލޮކް، އަދި އެންޓިޓީސް ހިމެނޭ ކަމަށެވެ. ހަމައެކަނި ކަސްޓަމް ޑޭޓާޕެކް އުފެއްދުމުގައި ނޫން، މޮޑްސް އަށް ވެސް އަދި މޮޑް ނޭމް ސްވިޗިން ފީޗާ މެދުވެރިކޮށް ވެސް ވަރަށް ބޭނުންތެރި.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "އަޅުގަނޑުގެ ތަޢުލީމީ ތަޖުރިބާ",
                "text": "އަޅުގަނޑުގެ އަމިއްލަ މަޝްރޫޢުތަކާއެކު، ތަޢުލީމީ ތަޖުރިބާއިން ވެސް ގިނަ ހުނަރުތަކެއް ލިބިއްޖެއެވެ. އިތުރު މަޢުލޫމާތު ހޯއްދެވުމަށް އަޅުގަނޑުގެ ލިންކްޑްއިން ޕްރޮފައިލް ބައްލަވާލެއްވުމަށް މިތަނަށް ފިއްތާލައްވާ.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "އަހަރެންގެ ޕްރޮފެޝަނަލް ތަޖުރިބާ",
                "text": "އަޅުގަނޑުގެ އަމިއްލަ ޕްރޮޖެކްޓްތަކާ އެކު، ޕްރޮފެޝަނަލް ތަޖުރިބާއިން ވެސް ގިނަ ހުނަރުތަކެއް ލިބިއްޖެއެވެ. އިތުރު މަޢުލޫމާތު ހޯއްދެވުމަށް އަޅުގަނޑުގެ ލިންކްޑްއިން ޕްރޮފައިލް ބައްލަވާލެއްވުމަށް މިތަނަށް ފިއްތާލައްވާ.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "ޕެޓްރިކް ގުޑްވިން ޕޯޓްފޯލިއޯ ވެބްސައިޓް",
                "text": "މި ވެބްސައިޓަކީ އަޅުގަނޑުގެ އަމިއްލަ ޕޯޓްފޯލިއޯ ވެބްސައިޓެއް، ރިއެކްޓް.ޖޭސް އާއި އެކު ބިނާކޮށްފައިވާ ވެބްސައިޓެކެވެ. މި މަޝްރޫޢަކީ އަޅުގަނޑުގެ ހުނަރާއި މަޝްރޫޢުތައް ދައްކާލުމުގެ އިތުރުން، ވަޒީފާދޭ ފަރާތްތަކުން އަޅުގަނޑާ ގުޅުމަށް ޕްލެޓްފޯމެއް ހޯދައިދިނުމަށް ބޭނުންކުރާ މަޝްރޫޢެކެވެ. މި މަޝްރޫޢަކީ ޕްރޮފެޝަނަލް އޮންލައިން ޕްރެޒެންސެއް އުފެއްދުމަށް ބޭނުންކުރާ މަޝްރޫޢެކެވެ.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "ޕެޓްރިކްގެ ލުއާ ސްކްރިޕްޓް ލައިބްރަރީ",
                "text": "ކުރިއަށް އޮތް ތަނުގައި ރިފަރެންސް ކުރުމަށް ލުއާ ސްކްރިޕްޓްތަކުގެ ބޭނުންތެރި ލައިބްރަރީއެކެވެ. މި ލައިބްރަރީ ބޭނުންކުރަނީ ލުއާ ސްކްރިޕްޓްތަކުގައި ހުންނަ ޓާސްކްތައް އޮޓޮމެޓިކް ކުރުމަށް ކަމަށާއި، މިއީ އާންމުކޮށް ޕައިތަން އާއި ރޫބީ އަށް ވުރެ ވެސް ލުއާ އަކީ ސްކްރިޕްޓިން ލޭންގުއޭޖް އެއް ކަމުން ޕާފޯމަންސް-ނީޑީ ޓާސްކްތަކަށް ވަރަށް ބޭނުންތެރި އެއްޗެކެވެ.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "ޕެޓްރިކްގެ މައިކްރޮސޮފްޓް އެކްސެލް ސްޕްރެޑްޝީޓް ސްކްރިޕްޓްސް (ވީބީއޭ)",
                "text": "މައިކްރޮސޮފްޓް އެކްސެލް އަށް ވީބީއޭ ސްކްރިޕްޓްތަކުގެ ބޭނުންތެރި ލައިބްރަރީއެކެވެ. މި ލައިބްރަރީ ބޭނުންކުރަނީ އެކްސެލް ސްޕްރެޑްޝީޓްތަކުގައި ޓާސްކްތައް އޮޓޮމެޓިކް ކުރުމަށެވެ.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "ޕެޓްރިކްގެ ނިއޯވިމް ކޮންފިގް",
                "text": "އަހަރެންގެ ޕާސަނަލް ނިއޯވިމް ކޮންފިގްރޭޝަން. މި ޕްރޮޖެކްޓަކީ ކަސްޓަމް ކީބައިންޑިންގސް، ތީމްސް، އަދި ޕްލަގިންސް ހިމެނޭ ގޮތަށް އަހަރެންގެ ރުހުމުގައި ނިއޯވިމް ކޮންފިގްރޭޓް ކުރުމަށް ބޭނުންކުރާ ޕްރޮޖެކްޓެކެވެ. މި މަޝްރޫޢަކީ އަޅުގަނޑުގެ އަމިއްލަ ބޭނުންތަކަށް ނިއޯވިމް އަށް ވުރެ ޔޫޒަރ ފްރެންޑްލީ އަދި އެފިޝަންޓް ޕްރޮޖެކްޓަކަށް ހެދުމަށް ބޭނުންކުރާ ޕްރޮޖެކްޓެކެވެ.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "ޕެޓްރިކްގެ މެޕް ޖެނެރޭޓަރ",
                "text": "ޖިއޮޕަންޑާސް އަދި މެޓްޕްލޮޓްލިބް ލައިބްރަރީތައް ބޭނުންކޮށްގެން ޕައިތަން އާއި އެކު ބިނާކޮށްފައިވާ އެމެރިކާގެ ކައުންޓީ އެންޑް ސްޓޭޓް މެޕް ޖެނެރޭޓަރެކެވެ. މި މަޝްރޫޢަކީ ކައުންޓީއާއި ސްޓޭޓް މެޕްތައް ހިމެނޭ ގޮތަށް އެމެރިކާގެ މެޕްތައް އުފެއްދުމަށް ބޭނުންކުރާ މަޝްރޫޢެކެވެ. މި މަޝްރޫޢަކީ ޑޭޓާ ވިޝުއަލައިޒޭޝަން އަދި އެނަލިސިސްއަށް ކަސްޓަމް މެޕްތައް އުފެއްދުމަށް ބޭނުންކުރާ މަޝްރޫޢެކެވެ.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "ޕެޓްރިކްސް ޕަވަރޝެލް ސްކްރިޕްޓް ލައިބްރަރީ",
                "text": "ކުރިއަށް އޮތް ތަނުގައި ރިފަރެންސް ކުރުމަށް ޕަވަރޝެލް ސްކްރިޕްޓްތަކުގެ ބޭނުންތެރި ލައިބްރަރީއެކެވެ. $PROFILE ސްކްރިޕްޓް ފީޗާއާއެކު ބޭނުންތެރި، މިއީ ވިންޑޯޒް ޓާރމިނަލް އިން ކުރާ ޓާސްކްތައް އޮޓޮމެޓިކް ކުރުމަށް އަޅުގަނޑަށް ލިބޭ ވަރަށް ބޮޑު އެހީތެރިކަމެއް، އަޅުގަނޑަކީ ވިންޑޯޒް އޮއެސް ގިނައިން ބޭނުންކުރާ މީހަކަށް ވާތީއެވެ.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "ޕެޓްރިކްގެ ރޫބީ ސްކްރިޕްޓް ލައިބްރަރީ",
                "text": "ކުރިއަށް އޮތްތަނުގައި ރިފަރެންސް ކުރުމަށް ރޫބީ ސްކްރިޕްޓްސްގެ ބޭނުންތެރި ލައިބްރަރީއެކެވެ. ކުރިއަށް އޮތްތަނުގައި ރޭލްސް ޑިވެލޮޕްމަންޓް ކޮންސެޕްޓްތަކަށް ބޭނުންތެރި.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "ޕީޑީއެފް ސްކިލްސް ބިލްޑަރ",
                "text": "ޕީޑީއެފްކިޓް އަދި ޖިންޖާ2 އެކްސްޓެންޝަން މެދުވެރިކޮށް ޕައިތަން އިން ބިލްޓްކޮށްފައިވާ ކަސްޓަމް ޕީޑީއެފް ބިލްޑަރެއް، އެޗްޓީއެމްއެލް އަދި ޖޭއެސްއޯއެން ފޯމެޓިންގ އާއި އެކު. މި މަޝްރޫޢަކީ ހުނަރާއި މަޝްރޫޢުތަކުގެ ލިސްޓަކުން ޕީޑީއެފް ފައިލްތައް އުފެއްދުމަށް ބޭނުންކުރާ މަޝްރޫޢެކެވެ. މި މަޝްރޫޢު ބޭނުންކޮށްގެން ކަސްޓަމް ޕީޑީއެފް ރެޒިއުއެއް އުފައްދައިގެން ވަޒީފާއަށް އެދޭ ފަރާތްތަކަށް ވަރަށް ބޭނުންތެރިއެވެ.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "ރިޖަންޑެލް އެންކްރިޕްޝަން ޕްރޮޖެކްޓް",
                "text": "128، 192، އަދި 256 ބިޓްގައި ރިޖަންޑެލް އެންކްރިޕްޝަން އެލްގޮރިޒަމްގެ 10+ އިމްޕްލިމެންޓޭޝަންސްގެ އާއިލާއެކެވެ. މި މަޝްރޫޢަކީ ތަފާތު ޕްރޮގްރާމިންގ ލޭންގުއޭޖްތަކުގައި ރިޖަންޑެލް އެންކްރިޕްޝަން އެލްގޮރިޒަމް ދައްކުވައިދިނުމަށް ބޭނުންކުރާ މަޝްރޫޢެކެވެ. މި މަޝްރޫޢަކީ ރިޖަންޑެލް އެންކްރިޕްޝަން އެލްގޮރިޒަމްގެ އިމްޕްލިމެންޓޭޝަންތަކުގެ އާއިލާއެއް އުފެއްދުމަށް ބޭނުންކުރާ މަޝްރޫޢެކެވެ.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "ސުޕްރީމްއެމްސީ މައިންކްރާފްޓް މޮޑް",
                "text": "ކަސްޓަމް ޓޫލްސް، އާމަރ، މޮބްސް، ބްލޮކްސް، ޑައިމަންޝަންސް، އަދި ގޭމްގެ އެތައް ފީޗާސްތަކެއް އިތުރުކޮށްދޭ މައިންކްރާފްޓް މޮޑެކެވެ. 1.16 އާއި 1.20 އާ ދެމެދުގެ މައިންކްރާފްޓް ވަރޝަންތަކަށް ޖާވާ ވަރޝަން 8-17 އާއެކު ބިލްޓް ކުރެވެއެވެ.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "ޓައިގަރ ޕްރޮގްރާމިންގ ލޭންގުއޭޖް",
                "text": "އިންޓަޕްރިޓަރ ޑިޒައިން އާއި ޕާފޯމަންސް ތަޖުރިބާ ކުރުމަށް ގޯ އެންޑް ރަސްޓް ގައި ވެސް ބިލްޓް ކޮށްގެން އުފައްދާފައިވާ ކަސްޓަމް ޕްރޮގްރާމިންގ ލޭންގުއޭޖް. ވެބް އެސެމްބްލީ ބޭނުންކޮށްގެން ޕޯޓްފޯލިއޯ ވެބްސައިޓުގައި ތަންފީޒުކޮށްފައިވެއެވެ.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "ޓައިގަރ ޓޭލްގޭޓިންގ ޕްރޮސް ވެބްސައިޓް",
                "text": "2024 ވަނަ އަހަރު އަޅުގަނޑު ބިނާކުރި ވެބްސައިޓެއް ޓައިގަރ ޓޭލްގޭޓިންގ ޕްރޮސް، a tailgating company in Clemson, SC. ރިއެކްޓް.ޖޭސް އާއި އެކު ބިލްޑް ކޮށްފައިވެއެވެ.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "ޓިއުރިންގ މެޝިން ޕްރޮޖެކްޓް",
                "text": "ޓިއުރިންގ މެޝިންގެ 30+ އަށް ވުރެ ގިނަ އިމްޕްލިމެންޓޭޝަންގެ އާއިލާ. ޚާއްޞަކޮށް ޓައިގަރ ޕްރޮގްރާމިންގ ލޭންގުއޭޖް އަށް ދިރާސާ ކުރުމަށްޓަކައި ތަފާތު ޕްރޮގްރާމިންގ ލޭންގުއޭޖްތަކަށް ޓިއުރިންގ ކޮމްޕްލީޓްނެސް ދައްކުވައިދިނުމަށް ބޭނުންކުރެއެވެ.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "ޓައިގަރ ޕްރޮގްރާމިންގ ލޭންގުއޭޖް"
    },
    "contact": {
        "title": "އަހަރެންނާ ގުޅާލާށެވެ .",
        "header": "ގުޅޭނެ މަޢުލޫމާތު",
        "email": "pattygsocials@gmail.com",
        "description": "އީމެއިލް، ލިންކްޑްއިން މެސެޖް، އަދި އިންސްޓަގްރާމް މެސެޖްތަކުން އިންކުއަރީތަކަށް އަޅުގަނޑު ޖަވާބުދެމެވެ. އަޅުގަނޑުގެ ނަންބަރު ރެޒިއު މެދުވެރިކޮށް ނުވަތަ އެހެން ގޮތަކުން ފޯރުކޮށްދެވިއްޖެނަމަ، އަޅުގަނޑުގެ ފޯނު ނަންބަރު ޕްރައިވެޓްކޮށް ބެހެއްޓުމަށް އިސްކަންދެވޭނަމަ، އަޅުގަނޑުވެސް ކޯލް ބެކް ކުރާނަން."
    },
    "formatter": {
        "title": "ޖޭއެސްއޯއެން އެންޑް ޔަމްލް ފޯމެޓް",
        "description": "ޖޭއެސްއޯއެން އެންޑް ޔަމްލް ފޯމެޓްޓަރަކީ ޖޭއެސްއޯއެން އަދި ޔަމްލް ފައިލްތައް ފޯމެޓް ކުރެވޭނެ ޓޫލެކެވެ. އެއީ ގޯ އާއި ވެބްސެމްބްލީ އާއި އެކު ބިނާކޮށްފައިވާ އެއްޗެއް ކަމަށާއި، އަދި އެއީ ފަސްޓް އަދި އެފިޝަންޓް ގޮތަކަށް ފަރުމާކޮށްފައިވާ އެއްޗެއް ކަމަށެވެ. ފޯމަޓަރަކީ ބޭނުން ކުރަން ފަސޭހަ ގޮތަކަށް ފަރުމާކޮށްފައިވާ، ޖޭއެސްއޯއެން ނުވަތަ ޔަމްލް ކޯޑުގައި ޕޭސްޓްކޮށް، ބަޓަން ކްލިކް ކުރުމުން ފޯމެޓް ކުރެވޭނެ ފަސޭހަ އިންޓަފޭސްއަކާއެކު ތައްޔާރުކޮށްފައިވާ ފޯމަޓަރެކެވެ.",
        "more_info1": "އިތުރު މަޢުލޫމާތު ހޯއްދެވުމަށް 1000 ވަނަ އަހަރު 100 ވަނަ އަހަރުގެ ރީޑްމީ އަށް ވަޑައިގަންނަވާށެވެ.",
        "more_info2": "JSON/YAML ފޯރމަޓަރ ރިޕޮޒިޓަރީ.",
        "format_as": "ފޯމެޓް އޭއެސް:",
        "auto_detect": "އޮޓޯ ޑިޓެކްޓް",
        "format": "ފޯމެޓް"
    },
    "tiger": {
        "title": "ޓައިގަރ ބަސް",
        "description": "ޓައިގަރ ޕްރޮގްރާމިންގ ލޭންގުއޭޖް އަކީ އިންޓަރޕްރިޓަރ ޑިޒައިން އާއި ޕާފޯމަންސް ތަޖުރިބާ ކުރުމަށް ގޯ އެންޑް ރަސްޓް ގައި ވެސް ބިނާކޮށްފައިވާ ކަސްޓަމް ޕްރޮގްރާމިންގ ލޭންގުއޭޖް އެކެވެ. ވެބް އެސެމްބްލީ ބޭނުންކޮށްގެން ޕޯޓްފޯލިއޯ ވެބްސައިޓުގައި ތަންފީޒުކޮށްފައިވެއެވެ. ޓައިގަރ ޕްރޮގްރާމިންގ ލޭންގުއޭޖް އަކީ އިންޓަރޕްރިޓަރ ޑިޒައިން އާއި ޕާފޯމަންސް ތަޖުރިބާ ކުރުމަށް ގޯ އެންޑް ރަސްޓް ގައި ވެސް ބިނާކޮށްފައިވާ ކަސްޓަމް ޕްރޮގްރާމިންގ ލޭންގުއޭޖް އެކެވެ. ވެބް އެސެމްބްލީ ބޭނުންކޮށްގެން ޕޯޓްފޯލިއޯ ވެބްސައިޓުގައި ތަންފީޒުކޮށްފައިވެއެވެ.",
        "more_info1": "އިތުރު މަޢުލޫމާތު ހޯއްދެވުމަށް 1000 ވަނަ އަހަރު 100 ވަނަ އަހަރުގެ ރީޑްމީ އަށް ވަޑައިގަންނަވާށެވެ.",
        "more_info2": "ޓައިގަރ ޕްރޮގްރާމިންގ ލޭންގުއޭޖް ގިޓްހަބް ރިޕޮޒިޓަރީ.",
        "select_engine": "އިންޖީނު ހޮވާ:",
        "tiger_code": "ޓައިގަރ ކޯޑް:",
        "run_tiger": "ރަން ޓައިގަރ",
        "output": "އައުޓްޕުޓް:"
    },
    "tab": {
        "title": "ޕެޓްރިކް ގުޑްވިން",
        "description": "ސެންޓްރަލް ފްލޮރިޑާގައި ހުންނަ ފުލް ސްޓޭކް ސޮފްޓްވެއާ އިންޖިނިއަރ"
    },
    "copy": {
        "text": "ކޮޕީ",
        "copied": "ކޮޕީކޮށްފައި!"
    },
    "social_media": {
        "github": "ގިތަބް",
        "instagram": "އިންސްޓަގްރާމް",
        "linkedin": "ލިންކްޑްއިން",
        "tiktok": "ޓިކްޓޮކް",
        "youtube": "ޔޫޓިއުބް",
        "text_strip": "ފޮލޯ މީ"
    },
    "logotext": "ޕެޓްރިކް"
}