{
    "name": "Patrick Goodwin .",
    "menu": {
        "home": "Aƒeme",
        "about": "Meƒo nu tso ŋunye .",
        "portfolio": "Portfolio .",
        "projects": "Nyatakakadzraɖoƒe ƒe dɔwo .",
        "tiger": "Tiger Gbegbɔgblɔ .",
        "formatter": "JSON & YAML Formatter .",
        "contact": "Te ɖe ŋunye ."
    },
    "home": {
        "title": "Aƒeme",
        "animated": {
            "first": "Full Stack Software Engineer .",
            "second": "Nyatakakadzraɖoƒe Dɔwɔƒe .",
            "third": "Fefewɔla ƒe Dɔwɔƒe .",
            "fourth": "Emenyawo Wɔla ."
        },
        "descriptionA": "Nuteƒekpɔkpɔ Full-Stack Software Engineer & Web Developer kple ŋutinya si woɖe fia le ŋgɔyiyidɔ siwo xɔ ŋgɔ ƒe ŋutinya si woɖe fia ŋu, tso Java ƒe tɔtrɔwo wɔwɔ na Minecraft dzi va ɖo zãla ƒe nuteƒekpɔkpɔ dodo ɖe ŋgɔ le React.js me kple REST API siwo le dedie la zazã dzi, esime wole Agile mɔnuwo kple ƒuƒoƒo ƒe nuwɔwɔ aduadu nyuie zãm ɣesiaɣi.",
        "descriptionB": "Tsɔ kpe ɖe eŋu la, menye anyigbaŋutinunya me nyawo wɔla si wɔ hadome nyatakakadzraɖoƒe geɖe ƒe akɔntabubuwo ŋudɔ dzidzedzetɔe, siwo dometɔ aɖewoe nye Instagram, YouTube, kple Tiktok, be woakpɔ ame siwo nye ame siwo dze wo yome bubu kple esiwo doa dzidzɔ na ame.",
        "portfolio_button": "Nye portfolio .",
        "contact_button": "Te ɖe ŋunye .",
        "about_button": "Meƒo nu tso ŋunye ."
    },
    "about": {
        "title": "Meƒo nu tso ŋunye .",
        "personal_summary": {
            "title": "Ame ŋutɔ ƒe Nyatakaka Kpuie .",
            "text": "Abe Full Stack kɔmpiuta dɔwɔɖoɖowo wɔla bibi si le Orlando, FL ene la, meɖe eŋutinunya fia le mɔ̃ɖaŋununya vovovowo me, tso Java kple C++ dzi va ɖo React.js kple Node.js dzi. Esi wònye be woxɔ ŋgɔ le xɔtutudɔwo me, siwo dometɔ aɖewoe nye Java ƒe tɔtrɔ ƒe ɖoɖo aɖe si wowɔ na Minecraft kple nyatakakadzraɖoƒe si me viɖe le na agbatsɔʋukulawo la, meɖe kplɔlanyenye kple nu yeyewo dodo ɖe ŋgɔ fia. Nye ɖokuitsɔtsɔna be mawɔ dɔ nyuie la dze le nye ŋutete be mawɔ dɔa dzi kpɔkpɔ ŋudɔ nyuie wu, akpɔ kuxi sesẽwo gbɔ, eye matsɔ egbɔkpɔnu deŋgɔ siwo ana zãla ƒe nuteƒekpɔkpɔ nanyo ɖe edzi eye wòana habɔbɔa nakpɔ dzidzedze la ana."
        },
        "professional_experience": {
            "title": "Dɔnyala ƒe nuteƒekpɔkpɔ .",
            "entries": [
                {
                    "jobtitle": "Kɔmpiutadziɖoɖowo Ŋuti Mɔ̃ɖaŋudɔwɔla Sue .",
                    "where": "Orion180 Nugblẽfexeɖoɖo .",
                    "date": "2024 - fifia ."
                },
                {
                    "jobtitle": "Founder & Full Stack Software Developer .",
                    "where": "SupremeMc .",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Full Stack Software Engineer .",
                    "where": "Wɔ nusɔsrɔ̃ kabakaba .",
                    "date": "Ƒe 2023"
                },
                {
                    "jobtitle": "Lead Web Developer (Sukuviwo ƒe Ðoɖowɔɖi) .",
                    "where": "Clemson Yunivɛsiti ƒe GDI Ðoɖowɔha .",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Dɔwɔkplɔ̃dzikpɔla .",
                    "where": "Clemson Yunivɛsiti .",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Mɔ̃ɖaŋununya ƒe Aɖaŋuwo .",
            "header1": "Gbeƒãɖeɖewo ƒe ɖoɖowɔɖiwo .",
            "header2": "Dɔwɔɖoɖowo & Agbalẽdzraɖoƒewo .",
            "header3": "Dɔwɔnuwo & Mɔ̃ɖaŋunuwo ."
        },
        "services": {
            "title": "Nye Subɔsubɔdɔwo .",
            "entries": [
                {
                    "title": "Full Stack Engineering .",
                    "text": "Metsɔa egbɔkpɔnu siwo me kɔ la naa le ŋgɔgbe kple megbe ƒe ŋgɔyiyi siaa me, si kpɔa egbɔ be ɖekawɔwɔ kple dɔwɔwɔ si me kuxi aɖeke mele o le kɔmpiutadziɖoɖowo ƒe ƒuƒoƒo bliboa me."
                },
                {
                    "title": "Nyatakakadzraɖoƒe ƒe ŋgɔyiyi .",
                    "text": "Le HTML, CSS, kple JavaScript ƒe ɖoɖowɔɖiwo abe React.js ene ŋuti nunya me la, mewɔa dɔ le nyatakakadzraɖoƒe siwo ŋu wokpɔa nu le eye wowɔa dɔ nyuie wu la ŋu be woakpɔ asisiwo ƒe nuhiahiã tɔxɛwo kple nusiwo wòlɔ̃na la gbɔ."
                },
                {
                    "title": "Fefe ƒe ŋgɔyiyi .",
                    "text": "Leveraging gbegbɔgblɔwo abe java kple C++, me bi ɖe fefewɔwɔ ƒe nuteƒekpɔkpɔ siwo me woƒoa nu le me toto me, tso susu kple aɖaŋuwɔwɔ dzi va ɖo dɔwɔwɔ kple eƒe nyonyome dzi, si kpɔa egbɔ be fefewɔwɔ kple dɔwɔwɔ nyuie le eme."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfolio .",
        "filter_by": "Filter portfolio to:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca JSON .",
                "text": "Python ƒe dɔ aɖe si naa gbegbɔgblɔ gɔmeɖeɖewo nɔa bɔbɔe. ɖe mɔ be woaɖe nye nyatakakadzraɖoƒe ƒe portfolio gɔme ɖe gbegbɔgblɔ 70+ me, siwo dometɔ aɖewoe nye Spaingbe, Fransegbe, Chinagbe, Arabgbe, kple bubu geɖewo. Wozãa dɔ sia tsɔ wɔa nyatakakadzraɖoƒe ƒe agbalẽdzraɖoƒe si me gbegbɔgblɔ geɖe le, si ɖea vi ŋutɔ hena nyasela siwo keke ta wu gbɔ ɖoɖo. Le dɔ sia wɔwɔ me la, xexeame ƒe 99% kple edzivɔ ate ŋu axlẽ nye portfolio le gbegbɔgblɔ si me kɔ nyuie me.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Do ka kple ene ene .",
                "text": "Massive ƒome si wu 50+ dɔwɔwɔwo le Connect ene fefe. Dɔ sia lɔ dɔwɔwɔwo ɖe eme le ɖoɖowɔgbalẽ vovovo siwo wu 30 me, siwo dometɔ aɖewoe nye Java, C++, Python, JavaScript, kple bubuwo. Tsɔ kpe ɖe eŋu la, egade 20+ frameworks alo nɔnɔme bubu siwo wu 20+, siwo dometɔ aɖewoe nye React.js, Ruby on Rails, ASP.NET, kple bubuwo.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Interop dɔa .",
                "text": "Dɔ si ŋlɔa dɔwɔwɔ ɖekae le ɖoɖowɔgbalẽ vovovowo dome. Fifia la, ɖoɖowɔgbalẽ vovovo 15 kple amewuwu ƒe ɖoɖo 18 le eme.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "JSON & YAML Auto Formatter .",
                "text": "a linter & autoformatter na JSON & YAML faɛlwo. Wozãa dɔ sia tsɔ wɔa JSON & YAML ƒe faɛlwo, si ɖea vi ŋutɔ na kɔdawo ƒe dzadzɛnyenye kple ɖoɖowɔwɔ. Wotue kple Go, woƒo wo nu ƒu kple WebAssembly, eye wotsɔ wo de nye portfolio me abe nyatakakadzraɖoƒe ƒe dɔ ene. Mɔnu geɖe wu ava le etsɔme.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON ƒe mɔ̃memimɔ̃ .",
                "text": "JSON generator si ƒe kpekpeme le bɔbɔe si wotu ɖe Python me na Minecraft Dɔwɔnu & Nyatakakawo ƒe Akpawo. Wozãa dɔ sia tsɔ wɔa JSON faɛlwo na Minecraft mods, siwo dometɔ aɖewoe nye nu tɔxɛwo, blocks, kple entities. Viɖe le eŋu ŋutɔ na menye datapacks siwo wowɔ ɖe ɖoɖo nu wɔwɔ ko o, ke boŋ na MODs hã to Mod ŋkɔ ƒe tɔtrɔ ƒe nɔnɔme dzi.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Nye sukudede me nuteƒekpɔkpɔ .",
                "text": "Tsɔ kpe ɖe nye ŋutɔ nye dɔwo ŋu la, aɖaŋu gbogbo aɖewo hã su asinye tso sukudede me. Zi afisia dzi be nàkpɔ nye LinkedIn ƒe nɔnɔmetata hena nyatakaka bubuwo.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Nye dɔwɔwɔ ŋuti nuteƒekpɔkpɔ .",
                "text": "Tsɔ kpe ɖe nye ŋutɔ nye dɔwo ŋu la, aɖaŋu geɖe hã su asinye tso dɔnyala bibiwo gbɔ. Zi afisia dzi be nàkpɔ nye LinkedIn ƒe nɔnɔmetata hena nyatakaka bubuwo.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Goodwin ƒe Nyatakakadzraɖoƒe .",
                "text": "Nyatakakadzraɖoƒe sia nye nye ŋutɔ nye portfolio nyatakakadzraɖoƒe, wotu kple react.js. Wozãa dɔ sia tsɔ ɖea nye aɖaŋuwo kple dɔwo fiana, eye wònaa mɔnukpɔkpɔ ame siwo ate ŋu anye dɔtɔwo be woate ɖe ŋunye la hã. Wozãa dɔ sia tsɔ wɔa dɔnyala bibiwo le Internet dzi.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patrick ƒe Lua Script Agbalẽdzraɖoƒe .",
                "text": "LUA ŋɔŋlɔdzesiwo ƒe agbalẽdzraɖoƒe si ŋu viɖe le hena etsɔme nufiame. Wozãa agbalẽdzraɖoƒe sia tsɔ wɔa dɔwo le lua scripts me le wo ɖokui si, si ate ŋu ava ɖe vi na dɔ siwo hiã dɔwɔwɔ, elabena zi geɖe la, Lua nyea nuŋɔŋlɔ ƒe gbegbɔgblɔ si zɔna kabakaba wu Python kple Ruby siaa.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrick ƒe Microsoft Excel ƒe agbalẽŋɔŋlɔ ƒe nuŋɔŋlɔwo (VBA) .",
                "text": "VBA ŋɔŋlɔdzesiwo ƒe agbalẽdzraɖoƒe si ŋu viɖe le na Microsoft Excel. Wozãa agbalẽdzraɖoƒe sia tsɔ wɔa dɔwo le Excel ƒe agbalẽviwo me le wo ɖokui si.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Patrick ƒe Neovim ƒe ɖoɖowɔɖi .",
                "text": "Nye ŋutɔ nye neovim ƒe ɖoɖowɔwɔ. Wozãa dɔ sia tsɔ ɖoa ​​Neovim ɖe nye didi nu, siwo dometɔ aɖewoe nye keybindings siwo wowɔ ɖe ɖoɖo nu, tanyawo, kple plugins. Wozãa dɔ sia tsɔ naa Neovim zazã le bɔbɔe wu eye wòwɔa dɔ nyuie wu na nye ŋutɔ nye zazã.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patrick ƒe anyigbatatawo ƒe mɔ̃ .",
                "text": "United States County & State Map Generator aɖe, si wotsɔ Python tu to Geopandas kple Matplotlib agbalẽdzraɖoƒewo zazã me. Wozãa dɔ sia tsɔ wɔa United States ƒe anyigbatatawo, siwo dometɔ aɖewoe nye nutoame kple dukɔa ƒe anyigbatatawo. Wozãa dɔ sia tsɔ wɔa anyigbatata siwo wowɔ ɖe ɖoɖo nu hena nyatakakawo kpɔkpɔ kple wo me dzodzro.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patrick ƒe PowerShell ƒe Agbalẽdzraɖoƒe .",
                "text": "PowerShell ŋɔŋlɔdzesiwo ƒe agbalẽdzraɖoƒe si ŋu viɖe le hena etsɔme nufiame. Viɖe le $Profile script feature ŋu, mekpɔe be esia kpena ɖe ame ŋu ŋutɔ na automating dɔwo tso Windows terminal, abe alesi me nye frequent zãla le Windows OS.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patrick ƒe Ruby Script Agbalẽdzraɖoƒe .",
                "text": "Ruby ŋɔŋlɔdzesiwo ƒe agbalẽdzraɖoƒe si ŋu viɖe le hena etsɔme nufiame. Viɖe le etsɔme ruby ​​ŋu le ketekemɔwo ƒe ŋgɔyiyi ƒe susuwo dzi.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF Aɖaŋuwo Tula .",
                "text": "PDF xɔtula si wowɔ ɖe ɖoɖo nu si wotu kple Python to PDFKIT kple JINJA2 ƒe kekeɖenudɔwo dzi, kpe ɖe HTML kple JSON Formatting ŋu. Wozãa dɔ sia tsɔ wɔa PDF faɛlwo tso aɖaŋu kple dɔwo ƒe xexlẽdzesiwo me. Woateŋu azã dɔ sia atsɔ awɔ PDF ƒe dɔbiagbalẽvi si wowɔ ɖe ɖoɖo nu, si ɖea vi ŋutɔ na dɔbiagbalẽviwo.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandel ƒe nyatakaka ɣaɣlawo ƒe dɔwɔwɔ .",
                "text": "10+ ƒe dɔwɔwɔwo le Rijandel Encryption Algorithm le 128, 192, kple 256 bits me. Wozãa dɔ sia tsɔ ɖea rijandel encryption algorithm le ɖoɖowɔgbalẽ vovovowo me fiana. Wozãa dɔ sia tsɔ wɔa rijandel encryption algorithm ƒe dɔwɔwɔwo ƒe ƒome aɖe.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "SupremeMc Minecraft Mod .",
                "text": "Minecraft mod si tsɔa dɔwɔnu siwo wowɔ ɖe ɖoɖo nu, aʋawɔnuwo, nuvlowɔhawo, blocks, dimensions, kple nu bubu geɖewo kpena ɖe fefea ŋu. Wotu kple Java ƒe tɔtrɔ 8-17 na Minecraft ƒe tɔtrɔ tiatia aɖewo le 1.16 kple 1.20 dome.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tiger ƒe ɖoɖowɔgbalẽ .",
                "text": "Custom programming language si wotu le Go & Rust siaa me be woate gbegɔmeɖela ƒe nɔnɔme kple dɔwɔwɔ kpɔ. Wowɔe le portfolio ƒe nyatakakadzraɖoƒea to web assembly zazã me.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger Tailgating Pros ƒe nyatakakadzraɖoƒe .",
                "text": "Nyatakakadzraɖoƒe aɖe si metu le ƒe 2024 me na Tiger Tailgating Pros, si nye dɔwɔƒe aɖe si tsɔa asi le nu ŋu le Clemson, SC. Wotue kple react.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing mɔ̃ ƒe dɔwɔwɔ .",
                "text": "Ƒome si wu 30+ dɔwɔwɔwo le Turing mɔ̃. Wozãnɛ tsɔ ɖea Turing ƒe blibonyenye fiana na ɖoɖowɔgbalẽ vovovowo hena numekuku, vevietɔ na Tiger ƒe ɖoɖowɔgbalẽ.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tiger ƒe ɖoɖowɔgbalẽ ."
    },
    "contact": {
        "title": "Te ɖe ŋunye .",
        "header": "Kadodo ŋuti nyatakakawo",
        "email": "pattygsocials@gmail.com",
        "description": "Meɖoa nya ŋu na Inquires tso email, LinkedIn gbedasiwo, kple Instagram gbedasiwo me. Magbugbɔ aƒo ka hã ne wotsɔ nye xexlẽdzesi na to dɔbiagbalẽvi dzi alo le mɔ bubu nu, togbɔ be melɔ̃na be nye telefon xexlẽdzesi nanye ame ŋutɔ tɔ hã."
    },
    "formatter": {
        "title": "JSON & YAML Formatter .",
        "description": "JSON & YAML Formatter nye dɔwɔnu si ana nàte ŋu awɔ JSON kple YAML faɛlwo ƒe ɖoɖo. Wotue kple Go kple WebAssembly, eye wowɔe be wòawɔ kaba eye wòawɔ dɔ nyuie. Wotrɔ asi le Formatter la ŋu be wòanɔ bɔbɔe be woazã, kple ŋgɔdonya bɔbɔe aɖe si ana nàte ŋu atsɔ wò JSON alo YAML code la ade eme eye nàwɔe kple asiƒoƒo ɖeka.",
        "more_info1": "Ne èdi nyatakaka bubuwo la, kpɔ Readme si le .",
        "more_info2": "JSON/YAML Formatter ƒe nudzraɖoƒe.",
        "format_as": "Ðoɖo si wowɔ ɖe eŋu abe:",
        "auto_detect": "Auto Detect .",
        "format": "Nɔnɔme ."
    },
    "tiger": {
        "title": "Tiger Gbegbɔgblɔ .",
        "description": "Tiger programming language nye ɖoɖowɔgbalẽ si wowɔ ɖe ɖoɖo nu si wotu ɖe Go & Rust siaa me be woate gbegɔmeɖela ƒe nɔnɔme kple dɔwɔwɔ kpɔ. Wowɔe le portfolio ƒe nyatakakadzraɖoƒea to web assembly zazã me. Tiger programming language nye ɖoɖowɔgbalẽ si wowɔ ɖe ɖoɖo nu si wotu ɖe Go & Rust siaa me be woate gbegɔmeɖela ƒe nɔnɔme kple dɔwɔwɔ kpɔ. Wowɔe le portfolio ƒe nyatakakadzraɖoƒea to web assembly zazã me.",
        "more_info1": "Ne èdi nyatakaka bubuwo la, kpɔ Readme si le .",
        "more_info2": "Tiger ƒe ɖoɖowɔgbalẽ GitHub nudzraɖoƒe.",
        "select_engine": "Tia mɔ̃a:",
        "tiger_code": "Tiger ƒe xexlẽdzesi:",
        "run_tiger": "Duƒuƒu Tiger .",
        "output": "Nusiwo woaɖe tso eme:"
    },
    "tab": {
        "title": "Patrick Goodwin .",
        "description": "Full Stack Software Engineer si le Central Florida ."
    },
    "copy": {
        "text": "Kpɔɖeŋu .",
        "copied": "Wogbugbɔ ŋlɔe!"
    },
    "social_media": {
        "github": "Github ƒe 1999 ƒe ɣleti gbãtɔ me.",
        "instagram": "Instagram .",
        "linkedin": "LinkedIn .",
        "tiktok": "Tiktok .",
        "youtube": "YouTube .",
        "text_strip": "Dze yonyeme ."
    },
    "logotext": "Patrick ."
}