{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Σπίτι",
        "about": "Για εμένα",
        "portfolio": "Χαρτοφυλάκιο",
        "tiger": "Τίγρη γλώσσα",
        "contact": "Επικοινωνήστε μαζί μου"
    },
    "home": {
        "title": "Σπίτι",
        "animated": {
            "first": "Μηχανικός λογισμικού πλήρους στοίβας",
            "second": "Προγραμματιστής ιστού",
            "third": "Προγραμματιστής παιχνιδιών",
            "fourth": "Δημιουργός περιεχομένου"
        },
        "descriptionA": "Έμπειρος μηχανικός λογισμικού πλήρους στοίβας και προγραμματιστής ιστού με ένα αποδεδειγμένο ιστορικό επιτυχημένων αναπτυξιακών έργων, από τη δημιουργία τροποποιήσεων Java για το Minecraft για την ενίσχυση της εμπειρίας των χρηστών στο React.js και την εφαρμογή ασφαλών API REST, ενώ παράλληλα χρησιμοποιεί μεθοδολογίες Agile και αποτελεσματική συνεργασία ομάδας.",
        "descriptionB": "Επιπλέον, είμαι δημιουργός περιεχομένου γεωγραφίας που έχει αξιοποιήσει με επιτυχία τους αλγόριθμους πολλαπλών πλατφορμών κοινωνικών μέσων, όπως το Instagram, το YouTube και το Tiktok, για να κερδίσουν μια αξιοσέβαστη και συναρπαστική βάση οπαδών.",
        "portfolio_button": "Το χαρτοφυλάκιό μου",
        "contact_button": "Επικοινωνήστε μαζί μου",
        "about_button": "Για εμένα"
    },
    "about": {
        "title": "Για εμένα",
        "personal_summary": {
            "title": "Προσωπική περίληψη",
            "text": "Ως έμπειρος προγραμματιστής λογισμικού πλήρους στοίβας με έδρα το Orlando, FL, έχω επιδείξει εμπειρογνωμοσύνη σε διάφορες τεχνολογίες, από Java και C ++ για να αντιδράσει.js και node.js. Με ένα ιστορικό έργων αιχμής, συμπεριλαμβανομένης της ανάπτυξης ενός προγράμματος τροποποίησης της Java για το Minecraft και έναν ανταμείβοντας ιστότοπο για τους οδηγούς φορτηγών, έχω παρουσιάσει ηγεσία και καινοτομία. Η δέσμευσή μου στην αριστεία είναι εμφανής στην ικανότητά μου να εξομαλύνω τη διαχείριση του έργου, να λύσω σύνθετα προβλήματα και να παραδώσει λύσεις υψηλής ποιότητας που ενισχύουν την εμπειρία των χρηστών και την επιτυχία της οργανωτικής."
        },
        "professional_experience": {
            "title": "Επαγγελματική εμπειρία",
            "entries": [
                {
                    "jobtitle": "Junior Software Engineer",
                    "where": "Ασφάλιση ORION180",
                    "date": "2024 - Παρόν"
                },
                {
                    "jobtitle": "Ιδρυτής και πλήρης προγραμματιστής λογισμικού στοίβας",
                    "where": "Υπεροχή",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Μηχανικός λογισμικού πλήρους στοίβας",
                    "where": "Επιταχύνει τη μάθηση",
                    "date": "2023"
                },
                {
                    "jobtitle": "Lead Web Developer (πρόγραμμα σπουδαστών)",
                    "where": "Πρόγραμμα GDI του Πανεπιστημίου Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Επόπτης γραφείου",
                    "where": "Πανεπιστήμιο Clemson",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Τεχνικές δεξιότητες",
            "header1": "Γλώσσες προγραμματισμού",
            "header2": "Πλαίσια και βιβλιοθήκες",
            "header3": "Εργαλεία και τεχνολογίες"
        },
        "services": {
            "title": "Οι υπηρεσίες μου",
            "entries": [
                {
                    "title": "Πλήρης μηχανική στοίβας",
                    "text": "Προσφέρω ολοκληρωμένες λύσεις τόσο σε εξέλιξη εμπρός όσο και σε back-end, εξασφαλίζοντας απρόσκοπτη ολοκλήρωση και λειτουργικότητα σε ολόκληρη τη στοίβα λογισμικού."
                },
                {
                    "title": "Ανάπτυξη ιστού",
                    "text": "Με εμπειρογνωμοσύνη σε πλαίσια HTML, CSS και JavaScript όπως το React.js, δημιουργώ οπτικά ελκυστικές και φιλικές προς το χρήστη ιστοσελίδες προσαρμοσμένες για να ανταποκριθούν στις συγκεκριμένες ανάγκες και προτιμήσεις των πελατών."
                },
                {
                    "title": "Ανάπτυξη παιχνιδιών",
                    "text": "Αξιοποιώντας τις γλώσσες όπως η Java και η C ++, ειδικεύομαι στη δημιουργία εμπειριών παιχνιδιού, από την ιδέα και το σχεδιασμό μέχρι την υλοποίηση και τη βελτιστοποίηση, διασφαλίζοντας την εμπλοκή του παιχνιδιού και την ομαλή απόδοση."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Χαρτοφυλάκιο",
        "filter_by": "Χαρτοφυλάκιο φίλτρων από:",
        "entries": {
            "connect_four": {
                "title": "Συνδέστε τέσσερα",
                "text": "Μαζική οικογένεια άνω των 50+ εφαρμογών του παιχνιδιού Connect Four. Το έργο αυτό περιλαμβάνει υλοποιήσεις σε περισσότερες από 30 διαφορετικές γλώσσες προγραμματισμού, όπως Java, C ++, Python, JavaScript και πολλά άλλα. Επιπλέον, περιλαμβάνει επίσης πάνω από 20+ διαφορετικά πλαίσια ή άλλες μορφές, όπως το React.js, το Ruby on Rails, το ASP.NET και πολλά άλλα.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Ενδοεπιχειρησιακό έργο",
                "text": "Ένα έργο που τεκμηριώνει τη διαλειτουργικότητα μεταξύ διαφορετικών γλωσσών προγραμματισμού. Περιλαμβάνει επί του παρόντος 15 διαφορετικές γλώσσες προγραμματισμού και 18 πρότυπα εκτέλεσης.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "excel_scripts": {
                "title": "Τα σενάρια υπολογιστικών φύλλων Microsoft Excel (VBA)",
                "text": "Μια χρήσιμη βιβλιοθήκη σεναρίων VBA για το Microsoft Excel. Αυτή η βιβλιοθήκη χρησιμοποιείται για την αυτοματοποίηση των εργασιών σε υπολογιστικά φύλλα του Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "minecraft_json_generator": {
                "title": "Γεννήτρια Minecraft JSON",
                "text": "Ελαφριά γεννήτρια JSON χτισμένη στο Python για Minecraft Resource & Data Packs. Το έργο αυτό χρησιμοποιείται για τη δημιουργία αρχείων JSON για mods minecraft, συμπεριλαμβανομένων προσαρμοσμένων αντικειμένων, μπλοκ και οντοτήτων. Πολύ χρήσιμο όχι μόνο για τη δημιουργία προσαρμοσμένων datapacks, αλλά και για τα mods μέσω της λειτουργίας μεταγωγής ονόματος mod.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Η εκπαιδευτική μου εμπειρία",
                "text": "Παράλληλα με τα προσωπικά μου έργα, έχω επίσης αποκτήσει πολλές δεξιότητες από την εκπαιδευτική εμπειρία. Κάντε κλικ εδώ για να δείτε το προφίλ μου στο LinkedIn για περισσότερες πληροφορίες.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Η επαγγελματική μου εμπειρία",
                "text": "Παράλληλα με τα προσωπικά μου έργα, έχω επίσης αποκτήσει πολλές δεξιότητες από την επαγγελματική εμπειρία. Κάντε κλικ εδώ για να δείτε το προφίλ μου στο LinkedIn για περισσότερες πληροφορίες.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Ιστοσελίδα χαρτοφυλακίου Patrick Goodwin",
                "text": "Αυτός ο ιστότοπος είναι ο ιστότοπος του προσωπικού μου χαρτοφυλακίου, που χτίστηκε με το React.js. Το έργο αυτό χρησιμοποιείται για να παρουσιάσει τις δεξιότητες και τα έργα μου, καθώς και να παρέχει μια πλατφόρμα για τους πιθανούς εργοδότες να επικοινωνήσουν μαζί μου. Το έργο αυτό χρησιμοποιείται για τη δημιουργία επαγγελματικής παρουσίας στο διαδίκτυο.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Βιβλιοθήκη Script του Patrick's Lua",
                "text": "Μια χρήσιμη βιβλιοθήκη σεναρίων LUA για μελλοντική αναφορά. Αυτή η βιβλιοθήκη χρησιμοποιείται για την αυτοματοποίηση των εργασιών σε σενάρια LUA, τα οποία μπορούν να είναι χρήσιμα για καθήκοντα απόδοσης, καθώς η LUA είναι συνήθως μια ταχύτερη γλώσσα δέσμης ενεργειών από ό, τι τόσο η Python όσο και η Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "neovim_config": {
                "title": "Το Neovim Config του Patrick",
                "text": "Η προσωπική μου διαμόρφωση NEOVIM. Αυτό το έργο χρησιμοποιείται για τη διαμόρφωση του Neovim στις προτιμήσεις μου, συμπεριλαμβανομένων των προσαρμοσμένων keybindings, των θεμάτων και των plugins. Αυτό το έργο χρησιμοποιείται για να καταστήσει το NEOVIM πιο φιλικό προς το χρήστη και αποτελεσματικό για την προσωπική μου χρήση.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Η γεννήτρια χάρτη του Patrick",
                "text": "Μια γεννήτρια χαρτών και κρατικών χαρτών των Ηνωμένων Πολιτειών, που χτίστηκε με την Python χρησιμοποιώντας τις βιβλιοθήκες Geopandas και Matplotlib. Το έργο αυτό χρησιμοποιείται για τη δημιουργία χαρτών των Ηνωμένων Πολιτειών, συμπεριλαμβανομένων των κομητειών και των κρατικών χαρτών. Το έργο αυτό χρησιμοποιείται για τη δημιουργία προσαρμοσμένων χαρτών για απεικόνιση και ανάλυση δεδομένων.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Βιβλιοθήκη σεναρίου Patrick's PowerShell",
                "text": "Μια χρήσιμη βιβλιοθήκη σεναρίων PowerShell για μελλοντική αναφορά. Χρήσιμο με τη λειτουργία σεναρίου προφίλ $, το βρίσκω εξαιρετικά χρήσιμο για την αυτοματοποίηση των εργασιών από το τερματικό των Windows, καθώς είμαι συχνός χρήστης του Windows OS.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Βιβλιοθήκη σεναρίου Ruby του Patrick",
                "text": "Μια χρήσιμη βιβλιοθήκη σεναρίων Ruby για μελλοντική αναφορά. Χρήσιμο για το μελλοντικό Ruby on Rails αναπτυξιακές έννοιες.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "Builder Skills PDF",
                "text": "Ένας προσαρμοσμένος οικοδόμος PDF που χτίστηκε με την Python μέσω των επεκτάσεων PDFKIT και JINJA2, παράλληλα με τη μορφοποίηση HTML και JSON. Το έργο αυτό χρησιμοποιείται για τη δημιουργία αρχείων PDF από μια λίστα δεξιοτήτων και έργων. Αυτό το έργο μπορεί να χρησιμοποιηθεί για να δημιουργήσει ένα προσαρμοσμένο βιογραφικό σημείωμα PDF, το οποίο είναι πολύ χρήσιμο για εφαρμογές εργασίας.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Έργο κρυπτογράφησης Rijandel",
                "text": "Μια οικογένεια 10+ υλοποιήσεων του αλγόριθμου κρυπτογράφησης Rijandel σε 128, 192 και 256 bits. Το έργο αυτό χρησιμοποιείται για να αποδείξει τον αλγόριθμο κρυπτογράφησης Rijandel σε διαφορετικές γλώσσες προγραμματισμού. Το έργο αυτό χρησιμοποιείται για τη δημιουργία μιας οικογένειας εφαρμογών του αλγόριθμου κρυπτογράφησης Rijandel.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Mod suprememc minecraft",
                "text": "Ένα minecraft mod που προσθέτει προσαρμοσμένα εργαλεία, πανοπλία, όχλους, μπλοκ, διαστάσεις και πολλά άλλα χαρακτηριστικά στο παιχνίδι. Χτισμένο με εκδόσεις Java 8-17 για επιλεγμένες εκδόσεις Minecraft μεταξύ 1,16 και 1,20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Γλώσσα προγραμματισμού τίγρης",
                "text": "Η γλώσσα προγραμματισμού που είναι ενσωματωμένη τόσο στο Go όσο και στη σκουριά για να πειραματιστεί με το σχεδιασμό και την απόδοση του διερμηνέα. Εφαρμόστηκε στον ιστότοπο του χαρτοφυλακίου χρησιμοποιώντας τη συναρμολόγηση ιστού.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Ιστοσελίδα Tiger Tailating Pros",
                "text": "Ένας ιστότοπος που έχτισα το 2024 για την Tiger Tailing Pros, μια εταιρεία tailgating στο Clemson, SC. Χτισμένο με react.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Έργο μηχανής Turing",
                "text": "Οικογένεια με πάνω από 30+ υλοποιήσεις της μηχανής Turing. Χρησιμοποιείται για να αποδείξει την πληρότητα του Turing για διαφορετικές γλώσσες προγραμματισμού για έρευνα, ειδικά για τη γλώσσα προγραμματισμού τίγρης.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Γλώσσα προγραμματισμού τίγρης"
    },
    "contact": {
        "title": "Επικοινωνήστε μαζί μου",
        "header": "Στοιχεία επικοινωνίας",
        "email": "pattygsocials@gmail.com",
        "description": "Απαντώ σε ερωτήσεις από μηνύματα ηλεκτρονικού ταχυδρομείου, μηνύματα LinkedIn και μηνύματα Instagram. Θα καλέσω επίσης εάν ο αριθμός μου παρέχεται μέσω βιογραφικού ή άλλου, αν και προτιμώ να διατηρήσω τον αριθμό τηλεφώνου μου ιδιωτικό."
    },
    "tiger": {
        "title": "Τίγρη γλώσσα",
        "description": "Η γλώσσα προγραμματισμού Tiger είναι μια προσαρμοσμένη γλώσσα προγραμματισμού που χτίστηκε τόσο στο Go όσο και στη Rust για να πειραματιστεί με το σχεδιασμό και την απόδοση του διερμηνέα. Εφαρμόστηκε στον ιστότοπο του χαρτοφυλακίου χρησιμοποιώντας τη συναρμολόγηση ιστού. Η γλώσσα προγραμματισμού Tiger είναι μια προσαρμοσμένη γλώσσα προγραμματισμού που χτίστηκε τόσο στο Go όσο και στη Rust για να πειραματιστεί με το σχεδιασμό και την απόδοση του διερμηνέα. Εφαρμόστηκε στον ιστότοπο του χαρτοφυλακίου χρησιμοποιώντας τη συναρμολόγηση ιστού.",
        "more_info1": "Για περισσότερες πληροφορίες, ανατρέξτε στο readme στο",
        "more_info2": "Tiger Προγραμματισμός Γλώσσας GitHub Repository.",
        "select_engine": "Επιλέξτε κινητήρα:",
        "tiger_code": "Κωδικός τίγρης:",
        "run_tiger": "Τρέχει τίγρη",
        "output": "Παραγωγή:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Μηχανικός λογισμικού πλήρους στοίβας με έδρα την Κεντρική Φλόριντα"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Τικτόκ",
        "youtube": "YouTube",
        "text_strip": "Ακολουθήστε με"
    },
    "logotext": "ΠΑΤΡΙΚΙΟΣ"
}