{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Home",
        "about": "About Me",
        "portfolio": "Portfolio",
        "projects": "Website Projects",
        "tiger": "Tiger Language",
        "formatter": "JSON & YAML Formatter",
        "cube_solver": "Rubix Cube Solver",
        "contact": "Contact Me"
    },
    "home": {
        "title": "Home",
        "animated": {
            "first": "Full Stack Software Engineer",
            "second": "Web Developer",
            "third": "Game Developer",
            "fourth": "Content Creator"
        },
        "footer": "Website now translated & avaliable in 100+ languages!",
        "descriptionA": "Experienced full-stack software engineer & web developer with a demonstrated history of successfully leading development projects, from creating Java modifications for Minecraft to enhancing user experience in React.js and implementing secure REST APIs, while consistently employing agile methodologies and effective team collaboration.",
        "descriptionB": "Additionally, I am a geography content creator who has successfully leveraged the algorithms of multiple social media platforms, including Instagram, YouTube, and TikTok, to gain a respectable and engaging follower base.",
        "portfolio_button": "My Portfolio",
        "contact_button": "Contact Me",
        "about_button": "About Me"
    },
    "about": {
        "title": "About Me",
        "personal_summary": {
            "title": "Personal Summary",
            "text": "As an experienced Full Stack Software Developer based in Orlando, FL, I've demonstrated expertise in various technologies, from Java and C++ to React.js and Node.js. With a track record of spearheading projects, including the development of a Java modification program for Minecraft and a rewarding website for truck drivers, I've showcased leadership and innovation. My commitment to excellence is evident in my ability to streamline project management, solve complex problems, and deliver high-quality solutions that enhance user experience and drive organizational success."
        },
        "professional_experience": {
            "title": "Professional Experience",
            "entries": [
                {
                    "jobtitle": "Junior Software Engineer",
                    "where": "Orion180 Insurance",
                    "date": "2024 - Present"
                },
                {
                    "jobtitle": "Founder & Full Stack Software Developer",
                    "where": "SupremeMC",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Full Stack Software Engineer",
                    "where": "Accelerate Learning",
                    "date": "2023"
                },
                {
                    "jobtitle": "Lead Web Developer (Student Program)",
                    "where": "Clemson University GDI Program",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Desk Supervisor",
                    "where": "Clemson University",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Technical Skills",
            "header1": "Programming Languages",
            "header2": "Frameworks & Libraries",
            "header3": "Tools & Technologies"
        },
        "services": {
            "title": "My Services",
            "entries": [
                {
                    "title": "Full Stack Engineering",
                    "text": "I offer comprehensive solutions across both front-end and back-end development, ensuring seamless integration and functionality throughout the entire software stack."
                },
                {
                    "title": "Web Development",
                    "text": "With expertise in HTML, CSS, and JavaScript frameworks like React.js, I craft visually appealing and user-friendly websites tailored to meet clients' specific needs and preferences."
                },
                {
                    "title": "Game Development",
                    "text": "Leveraging languages such as Java and C++, I specialize in creating immersive gaming experiences, from concept and design to implementation and optimization, ensuring engaging gameplay and smooth performance."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfolio",
        "filter_by": "Filter Portfolio By:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca JSON",
                "text": "A Python project that streamlines language translations. Allows for my website portfolio to be translated into 70+ languages, including Spanish, French, Chinese, Arabic, and many others. This project is used to create a multilingual website portfolio, which is very useful for reaching a wider audience. With this project, over 99% of the world can read my portfolio in a fluent language.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Connect Four",
                "text": "Massive family of over 50+ implementations of the Connect Four game. This project includes implementations in over 30 different programming languages, including Java, C++, Python, JavaScript, and more. Additionally, it also includes over 20+ different frameworks or other formats, including React.js, Ruby on Rails, ASP.NET, and more.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Interop Project",
                "text": "A project that documents interoperability between different programming languages. Currently includes 15 different programming languages and 18 execution patterns.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "JSON & YAML Auto Formatter",
                "text": "A linter & autoformatter for JSON & YAML files. This project is used to format JSON & YAML files, which is very useful for keeping code clean and organized. Built with Go, compiled with WebAssembly, and embedded into my portfolio as a website project. More formats to come in the future.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON Generator",
                "text": "Lightweight JSON generator built in Python for Minecraft resource & data packs. This project is used to generate JSON files for Minecraft mods, including custom items, blocks, and entities. Very useful for not only creating custom datapacks, but for mods as well via the mod name switching feature.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "My Educational Experience",
                "text": "Alongside my personal projects, I also have acquired numerous skills from educational experience. Click here to view my LinkedIn profile for more information.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "My Professional Experience",
                "text": "Alongside my personal projects, I also have acquired numerous skills from professional experience. Click here to view my LinkedIn profile for more information.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Goodwin Portfolio Website",
                "text": "This website is my personal portfolio website, built with React.js. This project is used to showcase my skills and projects, as well as to provide a platform for potential employers to contact me. This project is used to create a professional online presence.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patrick's Lua Script Library",
                "text": "A useful library of Lua scripts for future reference. This library is used to automate tasks in Lua scripts, which can come in handy for performance-needy tasks, as Lua is usually a faster scripting language than both Python and Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrick's Microsoft Excel Spreadsheet Scripts (VBA)",
                "text": "A useful library of VBA scripts for Microsoft Excel. This library is used to automate tasks in Excel spreadsheets.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Patrick's Neovim Config",
                "text": "My personal Neovim configuration. This project is used to configure Neovim to my liking, including custom keybindings, themes, and plugins. This project is used to make Neovim more user-friendly and efficient for my personal use.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patrick's Map Generator",
                "text": "A United States county & state map generator, built with Python using the Geopandas and Matplotlib libraries. This project is used to generate maps of the United States, including county and state maps. This project is used to create custom maps for data visualization and analysis.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patrick's PowerShell Script Library",
                "text": "A useful library of PowerShell scripts for future reference. Useful with the $profile script feature, I find this immensely helpful for automating tasks from the Windows terminal, as I am a frequent user of the Windows OS.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patrick's Ruby Script Library",
                "text": "A useful library of Ruby scripts for future reference. Useful for future Ruby on Rails developmental concepts.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF Skills Builder",
                "text": "A custom PDF builder built with Python via the Pdfkit and Jinja2 extensions, alongside HTML and JSON formatting. This project is used to generate PDF files from a list of skills and projects. This project can be used to create a custom PDF resume, which is very useful for job applications.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandel Encryption Project",
                "text": "A family of 10+ implementations of the Rijandel encryption algorithm in 128, 192, and 256 bits. This project is used to demonstrate the Rijandel encryption algorithm in different programming languages. This project is used to create a family of implementations of the Rijandel encryption algorithm.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "SupremeMC Minecraft Mod",
                "text": "A Minecraft Mod that adds custom tools, armor, mobs, blocks, dimensions, and many more features to the game. Built with Java versions 8-17 for select Minecraft versions between 1.16 and 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tiger Programming Language",
                "text": "Custom programming language built in both Go & Rust to experiment with interpreter design and performance. Implemented on the portfolio website using Web Assembly.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger Tailgating Pros Website",
                "text": "A website I built in 2024 for Tiger Tailgating Pros, a tailgating company in Clemson, SC. Built with React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing Machine Project",
                "text": "Family of over 30+ implementations of the Turing Machine. Used to demonstrate turing completeness for different programming languages for research, especially for the Tiger Programming Language.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tiger Programming Language"
    },
    "contact": {
        "title": "Contact Me",
        "header": "Contact Information",
        "email": "pattygsocials@gmail.com",
        "description": "I respond to inquires from email, LinkedIn messages, and Instagram messages. I also will call back if my number is provided via resume or otherwise, though I prefer to keep my phone number private."
    },
    "formatter": {
        "title": "JSON & YAML Formatter",
        "description": "The JSON & YAML Formatter is a tool that allows you to format JSON and YAML files. It is built with Go and WebAssembly, and it is designed to be fast and efficient. The formatter is designed to be easy to use, with a simple interface that allows you to paste in your JSON or YAML code and format it with the click of a button.",
        "more_info1": "For more information, refer to the README in the",
        "more_info2": "JSON/YAML Formatter Repository.",
        "format_as": "Format As:",
        "auto_detect": "Auto Detect",
        "format": "Format"
    },
    "cube_solver": {
        "title": "Rubix Cube Solver",
        "solve": "Solve"
    },
    "tiger": {
        "title": "Tiger Language",
        "description": "The Tiger Programming Language is a custom programming language built in both Go & Rust to experiment with interpreter design and performance. Implemented on the portfolio website using Web Assembly. The Tiger Programming Language is a custom programming language built in both Go & Rust to experiment with interpreter design and performance. Implemented on the portfolio website using Web Assembly.",
        "more_info1": "For more information, refer to the README in the",
        "more_info2": "Tiger Programming Language GitHub Repository.",
        "select_engine": "Select Engine:",
        "tiger_code": "Tiger Code:",
        "run_tiger": "Run Tiger",
        "output": "Output:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Full Stack Software Engineer based in Central Florida"
    },
    "copy": {
        "text": "Copy",
        "copied": "Copied!"
    },
    "social_media": {
        "github": "GitHub",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "TikTok",
        "youtube": "YouTube",
        "text_strip": "Follow me"
    },
    "logotext": "PATRICK"
}