{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Inicio",
        "about": "Sobre Mí",
        "portfolio": "Portafolio",
        "tiger": "Lenguaje Tiger",
        "contact": "Contáctame"
    },
    "home": {
        "title": "Inicio",
        "animated": {
            "first": "Ingeniero de Software Full Stack",
            "second": "Desarrollador Web",
            "third": "Desarrollador de Videojuegos",
            "fourth": "Creador de Contenido"
        },
        "descriptionA": "Ingeniero de software full-stack y desarrollador web con una historia demostrada de liderar proyectos exitosos de desarrollo, desde crear modificaciones de Java para Minecraft hasta mejorar la experiencia del usuario en React.js e implementar APIs REST seguras, utilizando metodologías ágiles y colaboración efectiva en equipo.",
        "descriptionB": "Además, soy un creador de contenido de geografía que ha aprovechado exitosamente los algoritmos de múltiples plataformas sociales, incluyendo Instagram, YouTube y TikTok, para obtener una base de seguidores respetable y comprometida.",
        "portfolio_button": "Mi Portafolio",
        "contact_button": "Contáctame",
        "about_button": "Sobre Mí"
    },
    "about": {
        "title": "Sobre Mí",
        "personal_summary": {
            "title": "Resumen Personal",
            "text": "Como Desarrollador de Software Full Stack con sede en Orlando, FL, he demostrado experiencia en diversas tecnologías, desde Java y C++ hasta React.js y Node.js. Con un historial de liderar proyectos, incluyendo el desarrollo de una modificación en Java para Minecraft y un sitio web de recompensas para conductores, he demostrado liderazgo e innovación. Mi compromiso con la excelencia es evidente en mi capacidad para optimizar la gestión de proyectos, resolver problemas complejos y ofrecer soluciones de alta calidad que mejoran la experiencia del usuario y el éxito organizacional."
        },
        "professional_experience": {
            "title": "Experiencia Profesional",
            "entries": [
                {
                    "jobtitle": "Ingeniero de Software Junior",
                    "where": "Orion180 Insurance",
                    "date": "2024 - Presente"
                },
                {
                    "jobtitle": "Fundador y Desarrollador Full Stack",
                    "where": "SupremeMC",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Ingeniero de Software Full Stack",
                    "where": "Accelerate Learning",
                    "date": "2023"
                },
                {
                    "jobtitle": "Desarrollador Web Principal (Programa Estudiantil)",
                    "where": "Clemson University GDI Program",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Supervisor de Recepción",
                    "where": "Clemson University",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Habilidades Técnicas",
            "header1": "Lenguajes de Programación",
            "header2": "Frameworks y Bibliotecas",
            "header3": "Herramientas y Tecnologías"
        },
        "services": {
            "title": "Mis Servicios",
            "entries": [
                {
                    "title": "Ingeniería Full Stack",
                    "text": " Ofrezco soluciones integrales en el desarrollo front-end y back-end, asegurando una integración fluida y funcionalidad completa en todo el stack de software."
                },
                {
                    "title": "Desarrollo Web",
                    "text": "Con experiencia en HTML, CSS y frameworks de JavaScript como React.js, diseño sitios web visualmente atractivos y fáciles de usar adaptados a las necesidades específicas de los clientes."
                },
                {
                    "title": "Desarrollo de Videojuegos",
                    "text": "Aprovechando lenguajes como Java y C++, me especializo en crear experiencias de juego inmersivas, desde el concepto y diseño hasta la implementación y optimización, garantizando una jugabilidad atractiva y un rendimiento fluido."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portafolio",
        "filter_by": "Filtrar Portafolio Por:",
        "entries": {
            "connect_four": {
                "title": "Conecta Cuatro",
                "text": "Familia masiva de más de 50 implementaciones del juego Conecta Cuatro. Este proyecto incluye implementaciones en más de 30 lenguajes de programación diferentes, incluyendo Java, C++, Python, JavaScript y más. Además, también incluye más de 20 frameworks o formatos adicionales, incluyendo React.js, Ruby on Rails, ASP.NET y más.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Proyecto de Interoperabilidad",
                "text": "Un proyecto que documenta la interoperabilidad entre diferentes lenguajes de programación. Actualmente incluye 15 lenguajes de programación diferentes y 18 patrones de ejecución.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "excel_scripts": {
                "title": "Scripts para Hojas de Cálculo de Excel (VBA)",
                "text": "Una biblioteca útil de scripts VBA para Microsoft Excel. Esta biblioteca se usa para automatizar tareas en hojas de cálculo de Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "minecraft_json_generator": {
                "title": "Generador de JSON para Minecraft",
                "text": "Generador de JSON liviano construido en Python para paquetes de recursos y datos de Minecraft. Este proyecto se usa para generar archivos JSON para mods de Minecraft, incluyendo ítems, bloques y entidades personalizadas. Muy útil no solo para datapacks personalizados, sino también para mods mediante la función de cambio de nombre del mod.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Mi Experiencia Educativa",
                "text": "Junto con mis proyectos personales, también he adquirido numerosas habilidades de experiencias educativas. Haz clic aquí para ver mi perfil de LinkedIn para más información.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Mi Experiencia Profesional",
                "text": "Junto con mis proyectos personales, también he adquirido numerosas habilidades de experiencias profesionales. Haz clic aquí para ver mi perfil de LinkedIn para más información.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Sitio Web de Portafolio de Patrick Goodwin",
                "text": "Este sitio web es mi portafolio personal, construido con React.js. Este proyecto sirve para mostrar mis habilidades y proyectos, así como proporcionar una plataforma para que posibles empleadores se comuniquen conmigo. También establece una presencia profesional en línea.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Biblioteca de Scripts en Lua de Patrick",
                "text": "Una biblioteca útil de scripts en Lua para referencia futura. Esta biblioteca se utiliza para automatizar tareas en scripts de Lua, que pueden ser útiles en tareas que requieren alto rendimiento, ya que Lua suele ser más rápido que Python y Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "neovim_config": {
                "title": "Configuración de Neovim de Patrick",
                "text": "Mi configuración personal de Neovim. Este proyecto se usa para configurar Neovim a mi gusto, incluyendo combinaciones de teclas personalizadas, temas y plugins. Hace que Neovim sea más fácil de usar y eficiente para mis necesidades personales.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Generador de Mapas de Patrick",
                "text": "Un generador de mapas de condados y estados de EE.UU., construido con Python usando las bibliotecas Geopandas y Matplotlib. Este proyecto se usa para generar mapas de EE.UU., incluyendo mapas de condado y estado. Es útil para crear mapas personalizados para visualización y análisis de datos.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Biblioteca de Scripts de PowerShell de Patrick",
                "text": "Una biblioteca útil de scripts de PowerShell para referencia futura. Muy útil con la función $profile script, la uso mucho para automatizar tareas desde la terminal de Windows, ya que soy un usuario frecuente de este sistema operativo.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Biblioteca de Scripts en Ruby de Patrick",
                "text": "Una biblioteca útil de scripts en Ruby para referencia futura. Útil para conceptos futuros de desarrollo en Ruby on Rails.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "Constructor de PDFs de Habilidades",
                "text": "Un constructor personalizado de PDFs construido con Python mediante las extensiones Pdfkit y Jinja2, junto con formatos HTML y JSON. Este proyecto se utiliza para generar archivos PDF a partir de una lista de habilidades y proyectos. Muy útil para crear un currículum personalizado en PDF para postulaciones laborales.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Proyecto de Encriptación Rijandel",
                "text": "Una familia de más de 10 implementaciones del algoritmo de encriptación Rijandel en 128, 192 y 256 bits. Este proyecto demuestra este algoritmo en diferentes lenguajes de programación y sirve para crear una familia de implementaciones consistentes del mismo.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Mod de Minecraft SupremeMC",
                "text": "Un mod de Minecraft que agrega herramientas personalizadas, armaduras, mobs, bloques, dimensiones y muchas más funciones al juego. Construido con Java 8-17 para versiones de Minecraft entre 1.16 y 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Lenguaje de Programación Tiger",
                "text": "Lenguaje de programación personalizado construido tanto en Go como en Rust para experimentar con diseño de intérpretes y rendimiento. Implementado en el sitio web del portafolio utilizando WebAssembly.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Sitio Web de Tiger Tailgating Pros",
                "text": "Sitio web que desarrollé en 2024 para Tiger Tailgating Pros, una compañía de tailgating en Clemson, SC. Construido con React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Proyecto de Máquina de Turing",
                "text": "Familia de más de 30 implementaciones de la Máquina de Turing. Usado para demostrar la completitud de Turing en diferentes lenguajes de programación, especialmente en el contexto del Lenguaje Tiger.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Lenguaje de Programación Tiger"
    },
    "contact": {
        "title": "Contáctame",
        "header": "Información de Contacto",
        "email": "pattygsocials@gmail.com",
        "description": "Respondo a consultas por correo electrónico, mensajes de LinkedIn e Instagram. También devuelvo llamadas si me proporcionan su número, aunque prefiero mantener mi número de teléfono privado."
    },
    "tiger": {
        "title": "Lenguaje Tiger",
        "description": "El Lenguaje de Programación Tiger es un lenguaje personalizado creado en Go y Rust para experimentar con el diseño de intérpretes y el rendimiento. Implementado en el sitio web del portafolio usando WebAssembly. El Lenguaje de Programación Tiger es un lenguaje personalizado creado en Go y Rust para experimentar con el diseño de intérpretes y el rendimiento. Implementado en el sitio web del portafolio usando WebAssembly.",
        "more_info1": "Para más información, consulta el README en el ",
        "more_info2": "Repositorio de GitHub del Lenguaje Tiger.",
        "select_engine": "Seleccionar Motor:",
        "tiger_code": "Código Tiger:",
        "run_tiger": "Ejecutar Tiger",
        "output": "Salida:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Ingeniero de Software Full Stack con sede en Florida Central"
    },
    "social_media": {
        "github": "GitHub",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "TikTok",
        "youtube": "YouTube",
        "text_strip": "Sígueme"
    },
    "logotext": "PATRICK"
}