{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Kodu",
        "about": "Minust",
        "portfolio": "Portfell",
        "projects": "Veebisaidiprojektid",
        "tiger": "Tiigrikeel",
        "portfolio_translator": "Portfelli tõlkija",
        "formatter": "JSON & Yaml Formatter",
        "cube_solver": "Rubix Cube'i lahendaja",
        "contact": "Võtke minuga ühendust"
    },
    "home": {
        "title": "Kodu",
        "animated": {
            "first": "Täielik virna tarkvarainsener",
            "second": "Veebiarendaja",
            "third": "Mänguarendaja",
            "fourth": "Sisulooja"
        },
        "footer": "Veebisait on nüüd tõlgitud ja kättesaadav 100+ keeles!",
        "descriptionA": "Kogenud täiskirjaga tarkvarainsener ja veebiarendaja, kellel on tõestatud arendusprojektide tõestatud ajalugu, alates Java-modifikatsioonide loomisest Minecrafti jaoks kuni React.js kasutajakogemuse parandamise ja turvaliste REST API-de rakendamiseni, kasutades samal ajal pidevalt vilgas metoodikaid ja tõhusat meeskonna koostööd.",
        "descriptionB": "Lisaks olen geograafia sisu looja, kes on edukalt kasutanud mitme sotsiaalmeedia platvormi algoritme, sealhulgas Instagram, YouTube ja Tiktok, et saada auväärset ja kaasahaaravat järgijabaasi.",
        "portfolio_button": "Minu portfell",
        "contact_button": "Võtke minuga ühendust",
        "about_button": "Minust"
    },
    "about": {
        "title": "Minust",
        "personal_summary": {
            "title": "Isiklik kokkuvõte",
            "text": "Orlandos, FL -s asuva kogenud täieliku virna arendajana olen demonstreerinud teadmisi erinevates tehnoloogiates, alates Java ja C ++ kuni React.js ja Node.j. Odavate projektide kogemustega, sealhulgas Minecrafti Java muutmisprogrammi väljatöötamisega ja veoautojuhtide rahuldust pakkuva veebisaidiga, olen näidanud juhtimist ja innovatsiooni. Minu pühendumus tipptasemele on ilmne minu võimes sujuvamaks muuta projektijuhtimist, lahendada keerulisi probleeme ja pakkuda kvaliteetseid lahendusi, mis suurendavad kasutajakogemust ja suurendavad organisatsiooni edu."
        },
        "professional_experience": {
            "title": "Töökogemus",
            "entries": [
                {
                    "jobtitle": "Juunioride tarkvarainsener",
                    "where": "Orion180 kindlustus",
                    "date": "2024 - kohal"
                },
                {
                    "jobtitle": "Asutaja ja Full Stack tarkvaraarendaja",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Täielik virna tarkvarainsener",
                    "where": "Kiirendage õppimist",
                    "date": "2023"
                },
                {
                    "jobtitle": "Juhtiv veebiarendaja (õpilaste programm)",
                    "where": "Clemsoni ülikooli GDI programm",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Laua juhendaja",
                    "where": "Clemsoni ülikool",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Laua juhendaja",
                    "where": "Clemsoni ülikool",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Tehnilised oskused",
            "header1": "Programmeerimiskeeled",
            "header2": "Raamistik ja raamatukogud",
            "header3": "Tööriistad ja tehnoloogiad"
        },
        "services": {
            "title": "Minu teenused",
            "entries": [
                {
                    "title": "Täielik virnade insener",
                    "text": "Pakun põhjalikke lahendusi nii esi- kui ka tagaosa arendamisel, tagades sujuva integratsiooni ja funktsionaalsuse kogu tarkvara virnas."
                },
                {
                    "title": "Veebiarendus",
                    "text": "HTML-, CSS- ja JavaScripti raamistike nagu React.js teadmistega meisterdan visuaalselt ahvatlevaid ja kasutajasõbralikke veebisaite, mis on kohandatud klientide konkreetsete vajaduste ja eelistuste täitmiseks."
                },
                {
                    "title": "Mängude arendamine",
                    "text": "Liigade abil nagu Java ja C ++, on ma spetsialiseerunud ümbritsevate mängukogemuste loomisele, alates kontseptsioonist ja kujundusest kuni rakendamise ja optimeerimiseni, tagades kaasahaarava mängu ja sujuva jõudluse."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfell",
        "filter_by": "Filtriportfell:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca json",
                "text": "Pythoni projekt, mis sujuvamaks keele tõlkeid. Võimaldab minu veebisaidi portfelli tõlkida 70+ keelt, sealhulgas hispaania, prantsuse, hiina, araabia ja paljude teistesse. Seda projekti kasutatakse mitmekeelse veebisaidi portfelli loomiseks, mis on väga kasulik laiema vaatajaskonnani jõudmiseks. Selle projektiga saab üle 99% maailmast lugeda minu portfelli sujuvas keeles.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Ühendage neli",
                "text": "Massiivne perekond, mis on üle 50 -aastaste ühenduse mängude rakendused. See projekt sisaldab rakendusi enam kui 30 erinevas programmeerimiskeeles, sealhulgas Java, C ++, Python, JavaScript ja palju muud. Lisaks sisaldab see ka üle 20 erineva raamistiku või muid vorminguid, sealhulgas React.js, Ruby on rööbastel, ASP.NET ja palju muud.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "Toidukaupade rakendus",
                "text": "Täielik täis virnaga .NET 9 BLAZOR-serveri rakendus toidukaupade haldamiseks. Rakendus järgib kontrolleri/teenuse/hoidla mustrit koos olemiraamistiku südamikuga püsivuse saamiseks ja sisaldab põhjalikku testkomplekti.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Koostalitlusprojekt",
                "text": "Projekt, mis dokumenteerib koostalitlusvõime erinevate programmeerimiskeelte vahel. Praegu sisaldab 15 erinevat programmeerimiskeelt ja 18 täitmismustrit.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Inventuuriregister",
                "text": "Täisterade demo müügipunkti (POS) register varude haldussüsteemis, mis on ehitatud nurga 17+ ja Node.j.-ga. See rakendus demonstreerib professionaalse kvaliteediga POS-süsteemi, kus on kasutajate autentimine, rollipõhine juurdepääsu juhtimine, varude jälgimine ja mõnitavate maksete töötlemine.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "JSON & YAML Auto Formatter",
                "text": "JSON & YAML -failide Linter & AutoForMatter. Seda projekti kasutatakse JSON & YAML -failide vormindamiseks, mis on koodi puhta ja korraldamise jaoks väga kasulik. Ehitatud koos Go -ga, koostatud WebAssemblyga ja manustatud minu portfelli veebisaidiprojektina. Rohkem vorminguid tulevikus.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON generaator",
                "text": "Kerge JSON -generaator, mis on sisse ehitatud Pythoni Minecrafti ressursside ja andmepakkide jaoks. Seda projekti kasutatakse JSON -failide genereerimiseks Minecrafti modifikatsioonide jaoks, sealhulgas kohandatud üksused, plokid ja üksused. Väga kasulik mitte ainult kohandatud andmepakkide loomiseks, vaid ka modifikatsioonifunktsiooni kaudu modifikatsioonide jaoks.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Minu hariduskogemus",
                "text": "Oma isiklike projektide kõrval olen omandanud ka arvukalt oskusi hariduskogemusest. Lisateabe saamiseks klõpsake siin minu LinkedIni profiili kuvamiseks.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Minu töökogemus",
                "text": "Oma isiklike projektide kõrval olen omandanud ka arvukalt oskusi töökogemusest. Lisateabe saamiseks klõpsake siin minu LinkedIni profiili kuvamiseks.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Goodwini portfelli veebisait",
                "text": "See veebisait on minu isiklik portfelli veebisait, mis on ehitatud koos react.js -ga. Seda projekti kasutatakse minu oskuste ja projektide tutvustamiseks, samuti selleks, et pakkuda potentsiaalsetele tööandjatele platvormi minuga ühendust võtta. Seda projekti kasutatakse professionaalse veebis kohaloleku loomiseks.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patricku Lua skriptiraamatukogu",
                "text": "Kasulik Lua skriptide raamatukogu edaspidiseks viitamiseks. Seda raamatukogu kasutatakse LUA skriptide ülesannete automatiseerimiseks, mis võivad olla kasulikud jõudluse vajalike ülesannete jaoks, kuna Lua on tavaliselt kiirem skriptimiskeel kui nii Python kui ka Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patricku Microsoft Exceli arvutustabeli skriptid (VBA)",
                "text": "VBA skriptide kasulik raamatukogu Microsoft Exceli jaoks. Seda teeki kasutatakse Exceli arvutustabelites olevate ülesannete automatiseerimiseks.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Patricku Neovim Config",
                "text": "Minu isiklik Neovimi konfiguratsioon. Seda projekti kasutatakse neovimi konfigureerimiseks minu maitse järgi, sealhulgas kohandatud võtmepõhised, teemad ja pistikprogrammid. Seda projekti kasutatakse neovimi muutmiseks kasutajasõbralikumaks ja minu isiklikuks kasutamiseks tõhusamaks.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patricku kaardigeneraator",
                "text": "Ameerika Ühendriikide maakonna ja osariigi kaardigeneraator, mis on ehitatud koos Pythoniga, kasutades geopandasid ja Matplotlibi raamatukogusid. Seda projekti kasutatakse Ameerika Ühendriikide, sealhulgas maakonna- ja riiklike kaartide kaartide genereerimiseks. Seda projekti kasutatakse kohandatud kaartide loomiseks andmete visualiseerimiseks ja analüüsimiseks.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patricku PowerShelli stsenaariumi raamatukogu",
                "text": "Powershelli skriptide kasulik teek edaspidiseks viitamiseks. Kasulik $ Profiil Skripti funktsiooni puhul on see minu jaoks tohutult kasulik Windowsi terminalist ülesannete automatiseerimisel, kuna olen Windows OS -i sagedane kasutaja.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patricku Ruby skriptide raamatukogu",
                "text": "Kasulik Ruby -skriptide teek edaspidiseks viitamiseks. Kasulik tulevaste Ruby jaoks Rails'i arengumõisted.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF -i oskuste ehitaja",
                "text": "HTML -i ja JSON -i vormindamise kõrval on Pdfkiti ja Jinja2 laienduste kaudu Pythoniga ehitatud kohandatud PDF -i ehitaja. Seda projekti kasutatakse PDF -failide genereerimiseks oskuste ja projektide loendist. Seda projekti saab kasutada kohandatud PDF -i jätkamise loomiseks, mis on töörakenduste jaoks väga kasulik.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandeli krüptimisprojekt",
                "text": "Rijandeli krüptimise algoritmi 10+ rakendusega perekond 128, 192 ja 256 bitti. Seda projekti kasutatakse Rijandeli krüptimise algoritmi demonstreerimiseks erinevates programmeerimiskeeltes. Seda projekti kasutatakse Rijandeli krüptimise algoritmi rakenduste perekonna loomiseks.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod",
                "text": "Minecrafti mod, mis lisab mängu kohandatud tööriistad, soomused, mobid, plokid, mõõtmed ja palju muud funktsioone. Ehitatud Java versioonidega 8-17 valitud Minecrafti versioonide jaoks vahemikus 1,16 kuni 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tiigri programmeerimiskeel",
                "text": "Nii Go & Rusti sisseehitatud kohandatud programmeerimiskeel, et katsetada tõlgi kujundust ja jõudlust. Rakendatud portfelli veebisaidil, kasutades veebikomplekti.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiigri tagamängude plusside veebisait",
                "text": "Veebisait, mille ehitasin 2024. aastal Tiigri tagaajamise plusside jaoks, Clemsonis, Sc. Ehitatud React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turingi masinaprojekt",
                "text": "Üle 30 -aastase Turingi masina rakendusega perekond. Kasutatakse Turingi täielikkuse demonstreerimiseks erinevate teadusuuringute programmeerimiskeelte jaoks, eriti tiigri programmeerimiskeele jaoks.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tiigri programmeerimiskeel"
    },
    "contact": {
        "title": "Võtke minuga ühendust",
        "header": "Kontaktteave",
        "email": "Pattygsocials@gmail.com",
        "description": "Vastan päringutele e -posti, LinkedIn -i teadetest ja Instagrami sõnumitest. Samuti helistan tagasi, kui minu numbrit pakutakse CV või muul viisil, ehkki eelistan hoida oma telefoninumbrit privaatsena."
    },
    "formatter": {
        "title": "JSON & Yaml Formatter",
        "description": "JSON & Yaml FormAtter on tööriist, mis võimaldab teil vormindada JSON ja YAML -faile. See on ehitatud koos WebAssemblyga ning see on loodud kiireks ja tõhusaks. Vormisaat on mõeldud hõlpsaks kasutamiseks, lihtsa liidesega, mis võimaldab teil kleepida oma JSON -i või YAML -koodi ja vormindada selle ühe nupuvajutusega.",
        "more_info1": "Lisateavet leiate aadressilt Readme",
        "more_info2": "JSON/YAML FORMITERI POOLOSOY.",
        "format_as": "Vorming kui:",
        "auto_detect": "Automaatne tuvastamine",
        "format": "Formaat"
    },
    "cube_solver": {
        "title": "Rubix Cube'i lahendaja",
        "start": "Lahendama"
    },
    "tiger": {
        "title": "Tiigrikeel",
        "description": "Tiigri programmeerimiskeel on kohandatud programmeerimiskeel, mis on ehitatud nii Go & Rust, et katsetada tõlgi disaini kui ka jõudlust. Rakendatud portfelli veebisaidil, kasutades veebikomplekti. Tiigri programmeerimiskeel on kohandatud programmeerimiskeel, mis on ehitatud nii Go & Rust, et katsetada tõlgi disaini kui ka jõudlust. Rakendatud portfelli veebisaidil, kasutades veebikomplekti.",
        "more_info1": "Lisateavet leiate aadressilt Readme",
        "more_info2": "Tiigri programmeerimiskeel GitHubi hoidla.",
        "select_engine": "Valige mootor:",
        "tiger_code": "Tiigrikood:",
        "run_tiger": "Tiigrit korraldama",
        "output": "Väljund:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Kesk -Floridas asuv täielik virna tarkvarainsener"
    },
    "copy": {
        "text": "Koopia",
        "copied": "Kopeeritud!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "Linkedin",
        "tiktok": "Tiktok",
        "youtube": "Youtube",
        "text_strip": "Jälgi mind"
    },
    "languages": {
        "title": "Portfelli tõlkija",
        "description": "Avastage, kuidas minu portfell on külastajatele kättesaadav kogu maailmast, toetades enam kui 100 keelt.",
        "global_accessibility": {
            "title": "Ülemaailmne ligipääsetavus",
            "description": "Minu portfell on saadaval üle {krahv} keelte, muutes selle külastajatele kättesaadavaks kogu maailmast. See mitmekeelne lähenemisviis näitab minu pühendumust tarkvaraarenduse kaasamisele ja globaalsele ulatusele.",
            "stats": {
                "languages_supported": "Toetatud keeled",
                "countries_represented": "Esindatud riigid",
                "continents_covered": "Kohendatud mandrid"
            }
        },
        "features": {
            "title": "Omadused",
            "items": [
                {
                    "title": "Reaalajas tõlge:",
                    "description": "Lülitage keeled koheselt keelevalijaga"
                },
                {
                    "title": "URL-il põhinev keel:",
                    "description": "Keele eelistused säilitatakse URL -is"
                },
                {
                    "title": "Natiivse skripti tugi:",
                    "description": "Skriptide, nagu araabia, hiina, hindi ja palju muud, korralik renderdamine"
                },
                {
                    "title": "Kultuuritundlikkus:",
                    "description": "Tõlked käsitlevad kultuurilist konteksti, mitte ainult sõnasõnalisi tähendusi"
                },
                {
                    "title": "SEO optimeeritud:",
                    "description": "Iga keelevariant on otsingumootorite jaoks optimeeritud"
                }
            ]
        },
        "world_map": {
            "title": "Interaktiivne maailmakaart",
            "description": "Hõljutage kaardil riikide üle, et näha nende toetatud keeli:",
            "languages_label": "Keeled",
            "legend": {
                "supported": "Toetatud keeled",
                "not_supported": "Keeletugi pole"
            },
            "zoom_controls": {
                "zoom_in": "Suum",
                "zoom_out": "Välja suumima",
                "reset": "Lähtestamine vaade"
            }
        },
        "supported_languages": {
            "title": "Toetatud keeled"
        },
        "interactive_country_map": {
            "title": "Interaktiivne maakaart",
            "description": "Hõljutage allpool asuvate riikide kohal, et näha nende toetatud keeli:",
            "language_count": {
                "single": "keel",
                "multiple": "keeled"
            }
        },
        "tooltips": {
            "no_language_support": "Keeletugi pole"
        }
    },
    "logotext": "Patrick"
}