{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Kotiin",
        "about": "Minusta",
        "portfolio": "Salkku",
        "projects": "Verkkosivustoprojektit",
        "tiger": "Tiikerikieli",
        "formatter": "JSON & YAML FORMATTER",
        "cube_solver": "Rubix -kuution ratkaisija",
        "contact": "Ottaa yhteyttä minuun"
    },
    "home": {
        "title": "Kotiin",
        "animated": {
            "first": "Täysin pino -ohjelmistoinsinööri",
            "second": "Web -kehittäjä",
            "third": "Pelin kehittäjä",
            "fourth": "Sisällöntuottaja"
        },
        "footer": "Verkkosivusto, joka on nyt käännetty ja saatavissa yli 100 kielellä!",
        "descriptionA": "Kokenut koko pino-ohjelmistoinsinööri ja web-kehittäjä, jolla on osoitettu historia menestyksekkäästi johtavien kehitysprojektien luomisesta Java-muutoksien luomisesta Minecraftin käyttäjäkokemuksen parantamiseen React.js: ssä ja turvallisten REST-sovellusliittymien toteuttamiseen, samalla kun se käyttää jatkuvasti ketteriä menetelmiä ja tehokasta ryhmäyhteistyötä.",
        "descriptionB": "Lisäksi olen maantieteen sisällön luoja, joka on onnistuneesti hyödyntänyt useiden sosiaalisen median alustojen, kuten Instagram, YouTube ja Tiktok, algoritmeja saadakseen kunnioitetun ja kiinnostavan seuraajapohjan.",
        "portfolio_button": "Minun salkuni",
        "contact_button": "Ottaa yhteyttä minuun",
        "about_button": "Minusta"
    },
    "about": {
        "title": "Minusta",
        "personal_summary": {
            "title": "Henkilökohtainen yhteenveto",
            "text": "Orlandossa sijaitsevan FL: n kokeneena Full Stack -ohjelmistokehittäjänä olen osoittanut asiantuntemusta erilaisista tekniikoista, Java ja C ++ React.js ja Node.js. Olen esittänyt johtajuutta ja innovaatioita, mukaan lukien Minecraft -ohjelman ja aukioiden kuljettajien palkitsevan verkkosivuston kehittäminen Minecraftille ja palkitseva verkkosivusto kuorma -autojen kuljettajille. Sitoutumiseni huippuosaamiseen käy ilmi kyvystäni virtaviivaistaa projektinhallintaa, ratkaista monimutkaisia ​​ongelmia ja tarjota korkealaatuisia ratkaisuja, jotka parantavat käyttökokemusta ja lisäävät organisaation menestystä."
        },
        "professional_experience": {
            "title": "Ammatillinen kokemus",
            "entries": [
                {
                    "jobtitle": "Nuorempi ohjelmistoinsinööri",
                    "where": "Orion180 vakuutus",
                    "date": "2024 - läsnä"
                },
                {
                    "jobtitle": "Perustaja ja täysi pino -ohjelmistokehittäjä",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Täysin pino -ohjelmistoinsinööri",
                    "where": "Kiihdyttää oppimista",
                    "date": "2023"
                },
                {
                    "jobtitle": "Lead Web -kehittäjä (opiskelijaohjelma)",
                    "where": "Clemson University GDI -ohjelma",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Työpöytävalvoja",
                    "where": "Clemsonin yliopisto",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Työpöytävalvoja",
                    "where": "Clemsonin yliopisto",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Tekniset taidot",
            "header1": "Ohjelmointikielet",
            "header2": "Kehykset ja kirjastot",
            "header3": "Työkalut ja tekniikat"
        },
        "services": {
            "title": "Minun palveluni",
            "entries": [
                {
                    "title": "Täysin pinotekniikka",
                    "text": "Tarjoan kattavia ratkaisuja sekä etu- että taustakehityksessä, varmistaen saumattoman integroinnin ja toiminnallisuuden koko ohjelmistopinoon."
                },
                {
                    "title": "Verkkokehitys",
                    "text": "HTML-, CSS- ja JavaScript-kehysten, kuten React.js, asiantuntemuksen kanssa käsittelen visuaalisesti houkuttelevia ja käyttäjäystävällisiä verkkosivustoja, jotka on räätälöity vastaamaan asiakkaiden erityistarpeita ja mieltymyksiä."
                },
                {
                    "title": "Pelikehitys",
                    "text": "Hyödyntämällä kieliä, kuten Java ja C ++, olen erikoistunut syventävien pelikokemusten luomiseen konseptista ja suunnittelusta toteuttamiseen ja optimointiin, varmistaen kiinnostavan pelin ja sujuvan suorituskyvyn."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Salkku",
        "filter_by": "Suodatin salkku:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca JSON",
                "text": "Python -projekti, joka virtaviivaistaa kielen käännöksiä. Mahdollistaa verkkosivuston portfolion kääntämisen yli 70 kielelle, mukaan lukien espanja, ranska, kiina, arabia ja monet muut. Tätä projektia käytetään monikielisen verkkosivustoportfolion luomiseen, mikä on erittäin hyödyllistä tavoittaa laajempi yleisö. Tämän projektin avulla yli 99% maailmasta voi lukea portfolioni sujuvasti kielellä.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Yhdistä neljä",
                "text": "Connect Four -pelin yli 50+ -toteutuksen massiivinen perhe. Tämä projekti sisältää toteutukset yli 30 eri ohjelmointikielellä, mukaan lukien Java, C ++, Python, JavaScript ja muut. Lisäksi se sisältää myös yli 20+ erilaista kehystä tai muita muotoja, mukaan lukien React.js, Ruby on Rails, ASP.NET ja paljon muuta.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "Ruokakauppa",
                "text": "Täydellinen koko pino .NET 9 Blazor Server -sovellus päivittäistavaroiden hallintaan. Sovellus seuraa ohjain/palvelu/arkistokuvio Entity Framework Core -sovelluksella pysyvyyden kannalta ja sisältää kattavan testisarjan.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Interop -projekti",
                "text": "Projekti, joka dokumentoi eri ohjelmointikielten yhteentoimivuuden. Tällä hetkellä sisältää 15 erilaista ohjelmointikieliä ja 18 suoritusmallia.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Varastorekisteri",
                "text": "Täysin pinon demo-myyntipiste (POS) rekisteröinti varastonhallintajärjestelmällä, joka on rakennettu Angular 17+: lla ja Node.js. Tämä sovellus osoittaa ammattimaisen POS-järjestelmän, jossa on käyttäjän todennus, roolipohjainen pääsynhallinta, varaston seuranta ja pilkkamaksujen käsittely.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "JSON & YAML Auto Formatter",
                "text": "Linter ja automaattinen JSON & YAML -tiedostot. Tätä projektia käytetään JSON & YAML -tiedostojen muotoiluun, mikä on erittäin hyödyllistä koodin pitämisessä puhtaana ja järjestettynä. Rakennettu GO: lla, koottu webAssembly -sovelluksella ja upotettu salkkuuni verkkosivustoprojektiksi. Lisää muotoja tulevaisuudessa.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON -generaattori",
                "text": "Kevyt JSON -generaattori, joka on rakennettu pythoniin Minecraft Resource & Data -paketteihin. Tätä projektia käytetään JSON -tiedostojen luomiseen Minecraft -modien, mukaan lukien mukautetut kohteet, lohkot ja yksiköt. Erittäin hyödyllinen paitsi mukautettujen datapakojen luomisessa, myös moduulien kanssa MOD -nimen kytkentäominaisuuden kautta.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Koulutuskokemukseni",
                "text": "Henkilökohtaisten projektien rinnalla olen myös hankkinut lukuisia taitoja koulutuskokemuksesta. Napsauta tätä nähdäksesi LinkedIn -profiilini saadaksesi lisätietoja.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Ammatillinen kokemukseni",
                "text": "Henkilökohtaisten projektien rinnalla olen myös hankkinut useita taitoja ammatilliselta kokemuksesta. Napsauta tätä nähdäksesi LinkedIn -profiilini saadaksesi lisätietoja.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Goodwin Portfolio -sivusto",
                "text": "Tämä verkkosivusto on henkilökohtainen portfolio -verkkosivusto, joka on rakennettu React.js: n kanssa. Tätä hanketta käytetään taitojen ja projektien esittelyyn sekä potentiaalisten työnantajien alustan tarjoamiseen. Tätä projektia käytetään ammattimaisen online -läsnäolon luomiseen.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patrickin Lua -käsikirjoituskirjasto",
                "text": "Hyödyllinen LUA -skriptien kirjasto tulevaa viitettä varten. Tätä kirjastoa käytetään LUA-komentosarjojen tehtävien automatisointiin, jotka voivat olla hyödyllisiä suorituskyvyn tarvittavien tehtävien kannalta, koska Lua on yleensä nopeampi käsikirjoituskieli kuin sekä Python että Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrick's Microsoft Excel -laskentataulukon skriptit (VBA)",
                "text": "Hyödyllinen VBA -skriptien kirjasto Microsoft Excelille. Tätä kirjastoa käytetään Automatisoimaan tehtäviä Excel -taulukkoissa.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Patrickin neovim -kokoonpano",
                "text": "Henkilökohtainen neovim -kokoonpanoni. Tätä projektia käytetään mieltymykseeni Neovimin määrittämiseen, mukaan lukien mukautetut Keybindings, teemat ja laajennukset. Tätä projektia käytetään Neovimin käyttäjäystävällisemmän ja tehokkaamman henkilökohtaiseen käyttöön.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patrickin karttageneraattori",
                "text": "Yhdysvaltain läänin ja osavaltion karttageneraattori, joka on rakennettu pythonilla geopandas- ja matplotlib -kirjastojen avulla. Tätä hanketta käytetään Yhdysvaltojen karttojen luomiseen, mukaan lukien läänin ja osavaltion kartat. Tätä projektia käytetään mukautettujen karttojen luomiseen datan visualisointiin ja analysointiin.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patrickin PowerShell -käsikirjoituskirjasto",
                "text": "Hyödyllinen PowerShell -skriptien kirjasto tulevaa viittausta varten. Hyödyllinen $ PROFECT -komentosarjan ominaisuudella, mielestäni tämä on erittäin hyödyllistä Windows -päätelaitteen tehtävien automatisointiin, koska olen Windows -käyttöjärjestelmän usein käyttäjä.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patrickin Ruby -käsikirjoituskirjasto",
                "text": "Hyödyllinen Ruby Scripts -kirjasto tulevaa viittausta varten. Hyödyllinen tulevaisuuden Ruby on Rails -kehityskonsepteille.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF Skills Builder",
                "text": "Mukautettu PDF -rakentaja, joka on rakennettu pythonilla PDFKIT- ja Jinja2 -laajennusten kautta, HTML- ja JSON -muotoilun rinnalla. Tätä projektia käytetään PDF -tiedostojen luomiseen taitojen ja projektien luettelosta. Tätä projektia voidaan käyttää mukautetun PDF -jatkamisen luomiseen, mikä on erittäin hyödyllistä työhakemuksissa.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandel -salausprojekti",
                "text": "Rijandel -salausalgoritmin 10+ toteutuksen perhe 128, 192 ja 256 bittiä. Tätä hanketta käytetään osoittamaan Rijandel -salausalgoritmi eri ohjelmointikielillä. Tätä hanketta käytetään Rijandel -salausalgoritmin toteutusperheen luomiseen.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod",
                "text": "Minecraft -mod, joka lisää räätälöityjä työkaluja, panssaria, väkijoukkoja, lohkoja, mittoja ja monia muita pelin ominaisuuksia. Rakennettu Java-versioilla 8-17 valituille Minecraft-versioille välillä 1,16-1,20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tiikeri -ohjelmointikieli",
                "text": "Molemmat Go- että Rustissa rakennettujen ohjelmointikieli kokeilemaan tulkkien suunnittelua ja suorituskykyä. Toteutetaan salkun verkkosivustolla verkkokokoonpanon avulla.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger Tailgating Pros -sivusto",
                "text": "Verkkosivusto, jonka rakensin vuonna 2024 Tiger Tailgating Prosille, takaluukun yritys Clemsonissa, SC. Rakennettu React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing Machine -projekti",
                "text": "Yli 30+ Turingin koneiden toteutuksen perhe. Käytetään osoittamaan Turingin täydellisyyttä erilaisille ohjelmointikielille tutkimukselle, etenkin tiikeriohjelmointikielelle.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tiikeri -ohjelmointikieli"
    },
    "contact": {
        "title": "Ottaa yhteyttä minuun",
        "header": "Yhteystiedot",
        "email": "pattygsocials@gmail.com",
        "description": "Vastaan ​​tiedusteluihin sähköpostista, LinkedIn -viesteistä ja Instagram -viesteistä. Soitan myös takaisin, jos numeroni toimitetaan jatkamisen kautta tai muuten, vaikka pidän mieluummin puhelinnumeroni yksityisenä."
    },
    "formatter": {
        "title": "JSON & YAML FORMATTER",
        "description": "JSON & YAML Formatter on työkalu, jonka avulla voit muotoilla JSON- ja YAML -tiedostoja. Se on rakennettu GO: lla ja webSemblyllä, ja se on suunniteltu nopeaksi ja tehokkaaksi. Formatter on suunniteltu helppokäyttöiseksi, yksinkertaisella käyttöliittymällä, jonka avulla voit liittää JSON- tai YAML -koodiin ja muotoilla se painikkeen napsautuksella.",
        "more_info1": "Lisätietoja on Readme",
        "more_info2": "JSON/YAML Formatter -varasto.",
        "format_as": "Muotona:",
        "auto_detect": "Tunnistaa automaattisesti",
        "format": "Muoto"
    },
    "cube_solver": {
        "title": "Rubix -kuution ratkaisija",
        "start": "Ratkaista"
    },
    "tiger": {
        "title": "Tiikerikieli",
        "description": "Tiikeri -ohjelmointikieli on räätälöity ohjelmointikieli, joka on rakennettu sekä Go & Rustissa kokeillakseen tulkkien suunnittelua ja suorituskykyä. Toteutetaan salkun verkkosivustolla verkkokokoonpanon avulla. Tiikeri -ohjelmointikieli on räätälöity ohjelmointikieli, joka on rakennettu sekä Go & Rustissa kokeillakseen tulkkien suunnittelua ja suorituskykyä. Toteutetaan salkun verkkosivustolla verkkokokoonpanon avulla.",
        "more_info1": "Lisätietoja on Readme",
        "more_info2": "Tiger -ohjelmointikieli Github -arkisto.",
        "select_engine": "Valitse moottori:",
        "tiger_code": "Tiikerikoodi:",
        "run_tiger": "Ajaa tiikeriä",
        "output": "Lähtö:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Floridassa sijaitseva Full Stack -ohjelmistoinsinööri"
    },
    "copy": {
        "text": "Kopioida",
        "copied": "Kopioi!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Seurata minua"
    },
    "logotext": "Patrick"
}