{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Accueil",
        "about": "À propos de moi",
        "portfolio": "Portfolio",
        "tiger": "Langage Tiger",
        "contact": "Contactez-moi"
    },
    "home": {
        "title": "Accueil",
        "animated": {
            "first": "Ingénieur Logiciel Full Stack",
            "second": "Développeur Web",
            "third": "Développeur de Jeux",
            "fourth": "Créateur de Contenu"
        },
        "descriptionA": "Ingénieur logiciel full stack et développeur web expérimenté avec un historique démontré de direction réussie de projets de développement, allant de la création de modifications Java pour Minecraft à l'amélioration de l'expérience utilisateur en React.js et à la mise en œuvre d'API REST sécurisées, tout en utilisant constamment des méthodologies agiles et une collaboration d'équipe efficace.",
        "descriptionB": "De plus, je suis un créateur de contenu géographique ayant réussi à exploiter les algorithmes de plusieurs plateformes de médias sociaux, dont Instagram, YouTube et TikTok, pour gagner une base de followers respectable et engageante.",
        "portfolio_button": "Mon Portfolio",
        "contact_button": "Contactez-moi",
        "about_button": "À propos de moi"
    },
    "about": {
        "title": "À propos de moi",
        "personal_summary": {
            "title": "Résumé personnel",
            "text": "En tant que développeur logiciel full stack expérimenté basé à Orlando, FL, j'ai démontré mon expertise dans diverses technologies, de Java et C++ à React.js et Node.js. Ayant dirigé des projets tels que le développement d'un programme de modification Java pour Minecraft et d’un site Web de récompenses pour les conducteurs de camion, j’ai fait preuve de leadership et d’innovation. Mon engagement envers l’excellence se reflète dans ma capacité à optimiser la gestion de projets, à résoudre des problèmes complexes et à livrer des solutions de haute qualité qui améliorent l’expérience utilisateur et assurent le succès organisationnel."
        },
        "professional_experience": {
            "title": "Expérience professionnelle",
            "entries": [
                {
                    "jobtitle": "Ingénieur Logiciel Junior",
                    "where": "Orion180 Insurance",
                    "date": "2024 - Présent"
                },
                {
                    "jobtitle": "Fondateur & Développeur Full Stack",
                    "where": "SupremeMC",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Ingénieur Logiciel Full Stack",
                    "where": "Accelerate Learning",
                    "date": "2023"
                },
                {
                    "jobtitle": "Développeur Web Principal (Programme Étudiant)",
                    "where": "Programme GDI de l’Université de Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Superviseur de Bureau",
                    "where": "Université de Clemson",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Compétences techniques",
            "header1": "Langages de Programmation",
            "header2": "Cadriciels et Bibliothèques",
            "header3": "Outils et Technologies"
        },
        "services": {
            "title": "Mes services",
            "entries": [
                {
                    "title": "Ingénierie Full Stack",
                    "text": "J’offre des solutions complètes sur l’ensemble du développement front-end et back-end, assurant une intégration et une fonctionnalité fluides dans toute la pile logicielle."
                },
                {
                    "title": "Développement Web",
                    "text": "Avec une expertise en HTML, CSS et frameworks JavaScript comme React.js, je conçois des sites Web attrayants et conviviaux, adaptés aux besoins spécifiques de chaque client."
                },
                {
                    "title": "Développement de Jeux",
                    "text": "En utilisant des langages comme Java et C++, je crée des expériences de jeu immersives, de la conception à l’implémentation et à l’optimisation, garantissant une jouabilité engageante et une performance fluide."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfolio",
        "filter_by": "Filtrer le portfolio par :",
        "entries": {
            "connect_four": {
                "title": "Puissance Quatre",
                "text": "Grande famille de plus de 50 implémentations du jeu Puissance Quatre. Ce projet inclut des implémentations dans plus de 30 langages de programmation, dont Java, C++, Python, JavaScript, et plus encore. Il comprend également plus de 20 frameworks ou formats différents, y compris React.js, Ruby on Rails, ASP.NET, etc.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Projet d’interopérabilité",
                "text": "Un projet qui documente l’interopérabilité entre différents langages de programmation. Comprend actuellement 15 langages de programmation différents et 18 modèles d'exécution.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "excel_scripts": {
                "title": "Scripts VBA pour Microsoft Excel",
                "text": "Bibliothèque utile de scripts VBA pour Microsoft Excel. Cette bibliothèque est utilisée pour automatiser les tâches dans les feuilles de calcul Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "minecraft_json_generator": {
                "title": "Générateur JSON pour Minecraft",
                "text": "Générateur JSON léger construit en Python pour les packs de données et ressources Minecraft. Permet de générer des fichiers JSON pour les mods Minecraft, y compris des objets, blocs et entités personnalisés.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Mon expérience éducative",
                "text": "En plus de mes projets personnels, j’ai acquis de nombreuses compétences grâce à mon parcours éducatif. Cliquez ici pour consulter mon profil LinkedIn pour plus d’informations.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Mon expérience professionnelle",
                "text": "En plus de mes projets personnels, j’ai acquis de nombreuses compétences grâce à mon expérience professionnelle. Cliquez ici pour consulter mon profil LinkedIn pour plus d’informations.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Site Web Portfolio de Patrick Goodwin",
                "text": "Ce site est mon portfolio personnel, construit avec React.js. Il sert à présenter mes compétences et projets, tout en offrant un moyen de contact professionnel.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Bibliothèque Lua de Patrick",
                "text": "Bibliothèque utile de scripts Lua pour référence future. Particulièrement utile pour les tâches exigeantes en performance, car Lua est souvent plus rapide que Python ou Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "neovim_config": {
                "title": "Configuration Neovim de Patrick",
                "text": "Ma configuration personnelle de Neovim, incluant des raccourcis personnalisés, des thèmes et des plugins, afin d’améliorer l'efficacité et la convivialité.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Générateur de cartes de Patrick",
                "text": "Générateur de cartes des comtés et États-Unis, construit en Python avec Geopandas et Matplotlib. Utile pour la visualisation et l’analyse de données.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Bibliothèque PowerShell de Patrick",
                "text": "Bibliothèque utile de scripts PowerShell pour automatiser les tâches via le terminal Windows, intégrée avec le fichier $profile.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Bibliothèque Ruby de Patrick",
                "text": "Bibliothèque utile de scripts Ruby pour référence future. Particulièrement utile pour des concepts de développement Ruby on Rails.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "Générateur de PDF de compétences",
                "text": "Générateur de fichiers PDF construit avec Python, Pdfkit et Jinja2. Permet de générer des CV ou présentations PDF personnalisés à partir de projets et compétences.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Projet de chiffrement Rijandel",
                "text": "Famille de 10+ implémentations de l’algorithme de chiffrement Rijandel en 128, 192 et 256 bits dans différents langages de programmation.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Mod Minecraft SupremeMC",
                "text": "Mod Minecraft ajoutant des outils personnalisés, armures, créatures, blocs, dimensions, et plus encore. Développé avec Java 8-17 pour les versions 1.16 à 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Langage de programmation Tiger",
                "text": "Langage de programmation personnalisé développé en Go et Rust pour expérimenter avec la conception d’interpréteurs et la performance. Intégré au site via WebAssembly.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Site Web Tiger Tailgating Pros",
                "text": "Site Web construit en 2024 pour Tiger Tailgating Pros, une entreprise de tailgating à Clemson, SC. Construit avec React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Projet de machine de Turing",
                "text": "Famille de 30+ implémentations de la machine de Turing, utilisée pour démontrer la complétude de Turing dans divers langages, notamment pour le langage Tiger.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Langage de programmation Tiger"
    },
    "contact": {
        "title": "Contactez-moi",
        "header": "Informations de contact",
        "email": "pattygsocials@gmail.com",
        "description": "Je réponds aux demandes envoyées par courriel, messages LinkedIn et messages Instagram. Je rappelle également si mon numéro est fourni via CV ou autre, bien que je préfère le garder privé."
    },
    "tiger": {
        "title": "Langage Tiger",
        "description": "Le langage de programmation Tiger est un langage personnalisé développé en Go et Rust pour expérimenter la conception et la performance d’un interpréteur. Intégré au site via WebAssembly.",
        "more_info1": "Pour plus d’informations, consultez le README dans le ",
        "more_info2": "répertoire GitHub du langage de programmation Tiger.",
        "select_engine": "Sélectionner un moteur :",
        "tiger_code": "Code Tiger :",
        "run_tiger": "Exécuter Tiger",
        "output": "Sortie :"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Ingénieur logiciel Full Stack basé en Floride centrale"
    },
    "social_media": {
        "github": "GitHub",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "TikTok",
        "youtube": "YouTube",
        "text_strip": "Suivez-moi"
    },
    "logotext": "PATRICK"
}