{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Maison",
        "about": "Sur moi",
        "portfolio": "Portefeuille",
        "projects": "Projets de site Web",
        "tiger": "Langue tigre",
        "formatter": "Formateur JSON & YAML",
        "cube_solver": "Solveur de cube Rubix",
        "contact": "Contactez-moi"
    },
    "home": {
        "title": "Maison",
        "animated": {
            "first": "Ingénieur logiciel complet",
            "second": "Développeur Web",
            "third": "Développeur de jeux",
            "fourth": "Créateur de contenu"
        },
        "footer": "Site Web est maintenant traduit et avaliable en plus de 100 langues!",
        "descriptionA": "Ingénieur logiciel complet expérimenté et développeur Web avec une histoire démontrée de projets de développement à la tête, de la création de modifications Java pour Minecraft à l'amélioration de l'expérience utilisateur dans React.js et de la mise en œuvre d'API Secure REST, tout en utilisant constamment des méthodologies agiles et une collaboration d'équipe efficace.",
        "descriptionB": "De plus, je suis un créateur de contenu en géographie qui a réussi à tirer parti des algorithmes de plusieurs plateformes de médias sociaux, notamment Instagram, YouTube et Tiktok, pour obtenir une base de suiveurs respectable et engageante.",
        "portfolio_button": "Mon portefeuille",
        "contact_button": "Contactez-moi",
        "about_button": "Sur moi"
    },
    "about": {
        "title": "Sur moi",
        "personal_summary": {
            "title": "Résumé",
            "text": "En tant que développeur de logiciels complet expérimenté basé à Orlando, en FL, j'ai démontré une expertise dans diverses technologies, de Java et C ++ à React.js et Node.js. Avec un historique de projets de lance, y compris le développement d'un programme de modification Java pour Minecraft et un site Web enrichissant pour les chauffeurs de camions, j'ai présenté le leadership et l'innovation. Mon engagement envers l'excellence est évident dans ma capacité à rationaliser la gestion de projet, à résoudre des problèmes complexes et à fournir des solutions de haute qualité qui améliorent l'expérience des utilisateurs et stimulent la réussite organisationnelle."
        },
        "professional_experience": {
            "title": "Expérience professionnelle",
            "entries": [
                {
                    "jobtitle": "Ingénieur logiciel junior",
                    "where": "Assurance Orion180",
                    "date": "2024 - présent"
                },
                {
                    "jobtitle": "Fondateur et développeur de logiciels complète",
                    "where": "Suprémc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Ingénieur logiciel complet",
                    "where": "Accélérer l'apprentissage",
                    "date": "2023"
                },
                {
                    "jobtitle": "Développeur Web principal (programme étudiant)",
                    "where": "Programme GDI de l'Université Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Superviseur de bureau",
                    "where": "Université de Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Superviseur de bureau",
                    "where": "Université de Clemson",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Compétences techniques",
            "header1": "Langues de programmation",
            "header2": "Frameworks et bibliothèques",
            "header3": "Outils et technologies"
        },
        "services": {
            "title": "Mes services",
            "entries": [
                {
                    "title": "Ingénierie complète",
                    "text": "J'offre des solutions complètes sur le développement frontal et back-end, assurant une intégration et des fonctionnalités transparentes tout au long de la pile logicielle."
                },
                {
                    "title": "Développement Web",
                    "text": "Avec une expertise dans les cadres HTML, CSS et JavaScript comme react.js, j'abretient des sites Web visuellement attrayants et conviviaux adaptés pour répondre aux besoins et aux préférences spécifiques des clients."
                },
                {
                    "title": "Développement de jeux",
                    "text": "Tirant des langues telles que Java et C ++, je me spécialise dans la création d'expériences de jeu immersives, du concept et de la conception à la mise en œuvre et à l'optimisation, assurant un gameplay engageant et des performances lisses."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portefeuille",
        "filter_by": "Portfolio de filtre par:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca JSON",
                "text": "Un projet Python qui rationalise les traductions linguistiques. Permet à mon portefeuille de sites Web d'être traduit en plus de 70 langues, y compris l'espagnol, le français, le chinois, l'arabe et bien d'autres. Ce projet est utilisé pour créer un portefeuille de sites Web multilingue, qui est très utile pour atteindre un public plus large. Avec ce projet, plus de 99% du monde peut lire mon portefeuille dans une langue courante.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Connectez quatre",
                "text": "Famille massive de plus de plus de 50 implémentations du jeu Connect Four. Ce projet comprend des implémentations dans plus de 30 langages de programmation différents, notamment Java, C ++, Python, JavaScript, etc. De plus, il comprend également plus de 20+ cadres ou autres formats différents, notamment React.js, Ruby on Rails, ASP.NET, etc.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "Application d'épicerie",
                "text": "Une application complète de serveur Blazor .tack complet .tack 9 pour gérer les éléments d'épicerie. L'application suit le modèle de contrôleur / service / référentiel avec le noyau du cadre d'entité pour la persistance et comprend une suite de test complète.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Projet d'interop",
                "text": "Un projet qui documente l'interopérabilité entre différents langages de programmation. Comprend actuellement 15 langages de programmation différents et 18 modèles d'exécution.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Registre des stocks",
                "text": "Un point de vente de démo complet (POS) Registre avec un système de gestion des stocks construit avec Angular 17+ et Node.js. Cette application démontre un système POS de qualité professionnelle avec authentification des utilisateurs, contrôle d'accès basé sur les rôles, suivi des stocks et traitement des paiements simulés.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "Fondeur automatique JSON & YAML",
                "text": "Un linter & autoforatter pour les fichiers JSON et YAML. Ce projet est utilisé pour formater les fichiers JSON et YAML, ce qui est très utile pour garder le code propre et organisé. Construit avec Go, compilé avec WebAssembly, et intégré à mon portefeuille en tant que projet de site Web. Plus de formats à venir dans le futur.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Générateur JSON Minecraft",
                "text": "Générateur JSON léger intégré à Python pour les packs de ressources et de données Minecraft. Ce projet est utilisé pour générer des fichiers JSON pour les mods Minecraft, y compris des éléments personnalisés, des blocs et des entités. Très utile non seulement pour créer des sacs de données personnalisés, mais aussi pour les mods via la fonction de commutation de nom de mod.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Mon expérience éducative",
                "text": "Parallèlement à mes projets personnels, j'ai également acquis de nombreuses compétences de l'expérience éducative. Cliquez ici pour afficher mon profil LinkedIn pour plus d'informations.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Mon expérience professionnelle",
                "text": "Parallèlement à mes projets personnels, j'ai également acquis de nombreuses compétences de l'expérience professionnelle. Cliquez ici pour afficher mon profil LinkedIn pour plus d'informations.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Site Web de portefeuille Patrick Goodwin",
                "text": "Ce site Web est mon site Web de portefeuille personnel, construit avec react.js. Ce projet est utilisé pour présenter mes compétences et mes projets, ainsi que pour fournir une plate-forme aux employeurs potentiels pour me contacter. Ce projet est utilisé pour créer une présence en ligne professionnelle.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Bibliothèque de script Lua de Patrick",
                "text": "Une bibliothèque utile de scripts LUA pour référence future. Cette bibliothèque est utilisée pour automatiser les tâches dans les scripts LUA, qui peuvent être utiles pour les tâches qui ont besoin de performances, car Lua est généralement un langage de script plus rapide que Python et Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrick's Microsoft Excel Spreetheet Scripts (VBA)",
                "text": "Une bibliothèque utile de scripts VBA pour Microsoft Excel. Cette bibliothèque est utilisée pour automatiser les tâches dans les feuilles de calcul Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Configation Neovim de Patrick",
                "text": "Ma configuration personnelle Neovim. Ce projet est utilisé pour configurer Neovim à mon goût, y compris les clés personnalisées, les thèmes et les plugins. Ce projet est utilisé pour rendre Neovim plus convivial et efficace pour mon usage personnel.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Générateur de cartes de Patrick",
                "text": "Un générateur de cartes du comté et de l'État des États-Unis, construit avec Python à l'aide des bibliothèques Geopandas et Matplotlib. Ce projet est utilisé pour générer des cartes des États-Unis, y compris les cartes du comté et de l'État. Ce projet est utilisé pour créer des cartes personnalisées pour la visualisation et l'analyse des données.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Bibliothèque de script PowerShell de Patrick",
                "text": "Une bibliothèque utile des scripts PowerShell pour une référence future. Utile avec la fonction de script de profil $, je trouve cela extrêmement utile pour automatiser les tâches à partir du terminal Windows, car je suis un utilisateur fréquent du système d'exploitation Windows.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Bibliothèque de script Ruby de Patrick",
                "text": "Une bibliothèque utile de scripts Ruby pour une référence future. Utile pour le futur Ruby sur les concepts de développement des rails.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF Skills Builder",
                "text": "Un constructeur PDF personnalisé construit avec Python via les extensions PDFKIT et Jinja2, aux côtés de la mise en forme HTML et JSON. Ce projet est utilisé pour générer des fichiers PDF à partir d'une liste de compétences et de projets. Ce projet peut être utilisé pour créer un curriculum vitae PDF personnalisé, ce qui est très utile pour les candidatures.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Projet de cryptage Rijandel",
                "text": "Une famille de plus de 10 implémentations de l'algorithme de cryptage Rijandel en 128, 192 et 256 bits. Ce projet est utilisé pour démontrer l'algorithme de cryptage Rijandel dans différents langages de programmation. Ce projet est utilisé pour créer une famille d'implémentations de l'algorithme de cryptage Rijandel.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod",
                "text": "Un mod Minecraft qui ajoute des outils personnalisés, des armures, des foules, des blocs, des dimensions et bien d'autres fonctionnalités du jeu. Construit avec les versions Java 8-17 pour sélectionner les versions Minecraft entre 1,16 et 1,20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Langage de programmation Tiger",
                "text": "Le langage de programmation personnalisé construit à la fois Go & Rust pour expérimenter la conception et les performances des interprètes. Implémenté sur le site Web du portefeuille à l'aide de l'assemblage Web.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Site Web de Tiger Tregating Pros",
                "text": "Un site Web que j'ai construit en 2024 pour Tiger Tailgating Pros, une entreprise de talonnage à Clemson, SC. Construit avec React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Projet de machine Turing",
                "text": "Famille de plus de 30 implémentations de la machine Turing. Utilisé pour démontrer l'exhaustivité de Turing pour différents langages de programmation pour la recherche, en particulier pour le langage de programmation Tiger.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Langage de programmation Tiger"
    },
    "contact": {
        "title": "Contactez-moi",
        "header": "Coordonnées",
        "email": "pattygsocials@gmail.com",
        "description": "Je réponds aux demandes des e-mails, des messages LinkedIn et des messages Instagram. Je rappellerai également si mon numéro est fourni par CV ou autrement, bien que je préfère garder mon numéro de téléphone privé."
    },
    "formatter": {
        "title": "Formateur JSON & YAML",
        "description": "Le formateur JSON & YAML est un outil qui vous permet de formater les fichiers JSON et YAML. Il est construit avec Go et WebAssembly, et il est conçu pour être rapide et efficace. Le formateur est conçu pour être facile à utiliser, avec une interface simple qui vous permet de coller dans votre code JSON ou YAML et de le formater en cliquant sur un bouton.",
        "more_info1": "Pour plus d'informations, reportez-vous à la lecture dans le",
        "more_info2": "Référentiel de format JSON / YAML.",
        "format_as": "Format comme:",
        "auto_detect": "Détection automatique",
        "format": "Format"
    },
    "cube_solver": {
        "title": "Solveur de cube Rubix",
        "start": "Résoudre"
    },
    "tiger": {
        "title": "Langue tigre",
        "description": "Le langage de programmation Tiger est un langage de programmation personnalisé construit dans Go & Rust pour expérimenter la conception et les performances des interprètes. Implémenté sur le site Web du portefeuille à l'aide de l'assemblage Web. Le langage de programmation Tiger est un langage de programmation personnalisé construit dans Go & Rust pour expérimenter la conception et les performances des interprètes. Implémenté sur le site Web du portefeuille à l'aide de l'assemblage Web.",
        "more_info1": "Pour plus d'informations, reportez-vous à la lecture dans le",
        "more_info2": "Tiger Programming Langing GitHub Repository.",
        "select_engine": "Sélectionnez le moteur:",
        "tiger_code": "Code de tigre:",
        "run_tiger": "Courir Tiger",
        "output": "Sortir:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Ingénieur logiciel complet basé dans le centre de la Floride"
    },
    "copy": {
        "text": "Copie",
        "copied": "Copié!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "Liendin",
        "tiktok": "Tiktok",
        "youtube": "Youtube",
        "text_strip": "Suis-moi"
    },
    "logotext": "Patrick"
}