{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Áit",
        "about": "Maidir liomsa",
        "portfolio": "Plaiscf",
        "projects": "Tionscadail láithreán gréasáin",
        "tiger": "Teanga Tíogair",
        "portfolio_translator": "Aistritheoir punainne",
        "formatter": "Formatter Json & Yaml",
        "cube_solver": "Rubix Ciúb Réitigh",
        "contact": "Déan teagmháil liom"
    },
    "home": {
        "title": "Áit",
        "animated": {
            "first": "Innealtóir Bogearraí Stack Iomlán",
            "second": "Forbróir gréasáin",
            "third": "Forbróir cluiche",
            "fourth": "Cruthaitheoir Ábhar"
        },
        "footer": "Láithreán Gréasáin Aistrithe & Avableiable anois i 100+ Teanga!",
        "descriptionA": "Taithí ar Innealtóir Bogearraí agus Forbróir Gréasáin Taithí le stair léirithe de thionscadail forbartha atá i gceannas go rathúil, ó mhodhnuithe Java a chruthú do Minecraft chun taithí an úsáideora a fheabhsú i React.js agus APIs REST slán a chur i bhfeidhm, agus modheolaíochtaí Agile agus comhoibriú éifeachtach foirne a fhostú go comhsheasmhach.",
        "descriptionB": "Ina theannta sin, is cruthaitheoir ábhair thíreolaíochta mé a bhfuil na halgartaim de na hardáin il -mheáin shóisialta a ghiaráil go rathúil, lena n -áirítear Instagram, YouTube, agus Tiktok, chun bonn leanúnach agus tarraingteach a fháil.",
        "portfolio_button": "Mo phunann",
        "contact_button": "Déan teagmháil liom",
        "about_button": "Maidir liomsa"
    },
    "about": {
        "title": "Maidir liomsa",
        "personal_summary": {
            "title": "Achoimre phearsanta",
            "text": "Mar fhorbróir bogearraí stac iomlán a bhfuil taithí aige in Orlando, FL, léirigh mé saineolas i dteicneolaíochtaí éagsúla, ó Java agus C ++ go React.js agus Node.js. Le cuntas teiste ar thionscadail cheannródaíocha, lena n -áirítear clár modhnaithe Java a fhorbairt do Minecraft agus suíomh gréasáin luachmhar do thiománaithe trucailí, thaispeáin mé ceannaireacht agus nuálaíocht. Tá mo thiomantas do shármhaitheas le feiceáil i mo chumas chun bainistíocht tionscadail a shruthlíniú, fadhbanna casta a réiteach, agus réitigh ardchaighdeáin a sheachadadh a fheabhsaíonn taithí an úsáideora agus a spreagann rath eagraíochtúil."
        },
        "professional_experience": {
            "title": "Taithí ghairmiúil",
            "entries": [
                {
                    "jobtitle": "Innealtóir Bogearraí Sóisearach",
                    "where": "Árachas Orion180",
                    "date": "2024 - i láthair"
                },
                {
                    "jobtitle": "Forbróir Bogearraí Bunaitheoir & Iomlán Stack",
                    "where": "SuppremeMC",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Innealtóir Bogearraí Stack Iomlán",
                    "where": "Luasghéarú ar an bhfoghlaim",
                    "date": "2023"
                },
                {
                    "jobtitle": "Príomh -Fhorbróir Gréasáin (Clár na Mac Léinn)",
                    "where": "Clár GDI Ollscoil Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Maoirseoir deisce",
                    "where": "Ollscoil Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Maoirseoir deisce",
                    "where": "Ollscoil Clemson",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Scileanna teicniúla",
            "header1": "Teangacha Clárúcháin",
            "header2": "Creataí & Leabharlanna",
            "header3": "Uirlisí & Teicneolaíochtaí"
        },
        "services": {
            "title": "Mo Sheirbhísí",
            "entries": [
                {
                    "title": "Innealtóireacht Stack Iomlán",
                    "text": "Tairgim réitigh chuimsitheacha ar fud na forbartha tosaigh agus na cúlraí araon, ag cinntiú comhtháthú agus feidhmiúlacht gan uaim ar fud an chairn bhogearraí ar fad."
                },
                {
                    "title": "Forbairt gréasáin",
                    "text": "Le saineolas i gcreataí HTML, CSS, agus JavaScript mar React.js, déanaim ceardaíocht a dhéanamh ar shuíomhanna gréasáin atá tarraingteach ó thaobh amhairc de agus atá éasca le húsáid chun freastal ar riachtanais agus roghanna sonracha na gcliant."
                },
                {
                    "title": "Forbairt cluichí",
                    "text": "Teangacha ar nós Java agus C ++ a ghiaráil, déanaim speisialtóireacht ar eispéiris chearrbhachais tumtha a chruthú, ó choincheap agus ó dhearadh go cur i bhfeidhm agus leas iomlán a bhaint, ag cinntiú go bhfuil gameplay agus feidhmíocht réidh ann."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Plaiscf",
        "filter_by": "Punann Scagtha le:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca Json",
                "text": "Tionscadal Python a dhéanann aistriúcháin teanga a shruthlíniú. Ceadaíonn sé go n -aistreofaí mo phunann láithreán gréasáin go 70+ teanga, lena n -áirítear Spáinnis, Fraincis, Sínis, Araibis, agus go leor eile. Úsáidtear an tionscadal seo chun punann láithreán gréasáin ilteangach a chruthú, rud atá an -úsáideach chun lucht féachana níos leithne a bhaint amach. Leis an tionscadal seo, is féidir le níos mó ná 99% den domhan mo phunann a léamh i dteanga líofa.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Ceangail a ceathair",
                "text": "Teaghlach ollmhór de bhreis is 50+ cur i bhfeidhm an chluiche Connect Four. Cuimsíonn an tionscadal seo cur i bhfeidhm i níos mó ná 30 teanga chlársceidealaithe, lena n -áirítear Java, C ++, Python, JavaScript, agus níos mó. Ina theannta sin, tá os cionn 20+ creatlach éagsúil nó formáidí eile ann, lena n -áirítear React.js, Ruby ar Rails, ASP.NET, agus níos mó.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "Aip grósaeireachta",
                "text": "Feidhmchlár iomlán iomlán. Leanann an t -iarratas an patrún rialaitheora/seirbhíse/stór le Creat Creatlach Eintitis le haghaidh marthanachta agus tá sraith tástála cuimsitheach ann.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Tionscadal idirghabhála",
                "text": "Tionscadal a dhéanann doiciméadú ar idir -inoibritheacht idir teangacha cláir éagsúla. Faoi láthair tá 15 teanga chlársceidealaithe agus 18 bpatrún forghníomhaithe.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Clár fardail",
                "text": "Cláraigh Pointe Díolacháin Phointe Díolacháin (POS) Stack lán le córas bainistíochta fardail a tógadh le uilleach 17+ agus node.js. Taispeánann an t-iarratas seo córas POS grád gairmiúil le fíordheimhniú úsáideora, rialú rochtana bunaithe ar ról, rianú fardail, agus próiseáil íocaíochta bréige.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "Formatter Auto Json & Yaml",
                "text": "Linter & autoformatter do chomhaid JSON & YAML. Úsáidtear an tionscadal seo chun comhaid JSON & YAML a fhormáidiú, atá an -úsáideach chun cód a choinneáil glan agus eagraithe. Tógtha le Go, tiomsaithe le webassembly, agus leabaithe i mo phunann mar thionscadal láithreán gréasáin. Níos mó formáidí le teacht amach anseo.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Gineadóir Minecraft JSON",
                "text": "Gineadóir JSON éadrom tógtha i Python le haghaidh pacáistí acmhainní & sonraí minecraft. Úsáidtear an tionscadal seo chun comhaid JSON a ghiniúint le haghaidh mods minecraft, lena n -áirítear míreanna saincheaptha, bloic agus aonáin. An -úsáideach ní hamháin chun sonraí saincheaptha a chruthú, ach le haghaidh mods chomh maith tríd an ngné lasctha ainm mod.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Mo thaithí oideachais",
                "text": "Chomh maith le mo thionscadail phearsanta, tá go leor scileanna faighte agam freisin ó thaithí oideachais. Cliceáil anseo chun mo phróifíl LinkedIn a fheiceáil le haghaidh tuilleadh eolais.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Mo thaithí ghairmiúil",
                "text": "Chomh maith le mo thionscadail phearsanta, tá go leor scileanna faighte agam ó thaithí ghairmiúil. Cliceáil anseo chun mo phróifíl LinkedIn a fheiceáil le haghaidh tuilleadh eolais.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Láithreán Gréasáin Punann Patrick Goodwin",
                "text": "Is é an láithreán gréasáin seo mo shuíomh gréasáin punainne pearsanta, tógtha le react.js. Úsáidtear an tionscadal seo chun mo chuid scileanna agus tionscadal a thaispeáint, chomh maith le hardán a sholáthar d'fhostóirí ionchasacha chun teagmháil a dhéanamh liom. Úsáidtear an tionscadal seo chun láithreacht ghairmiúil ar líne a chruthú.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Leabharlann Script Lua Patrick",
                "text": "Leabharlann úsáideach de scripteanna Lua le haghaidh tagartha amach anseo. Úsáidtear an leabharlann seo chun tascanna a uathoibriú i scripteanna Lua, ar féidir leo teacht chun cinn i leith tascanna a bhfuil géarghá leo, mar is gnách gur teanga scriptithe níos tapúla í Lua ná Python agus Ruby araon.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Scripteanna Scarbhileog Microsoft Excel Patrick (VBA)",
                "text": "Leabharlann úsáideach de scripteanna VBA do Microsoft Excel. Úsáidtear an leabharlann seo chun tascanna a uathoibriú i scarbhileoga Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Cumraíocht Neovim Patrick",
                "text": "Mo chumraíocht neovim phearsanta. Úsáidtear an tionscadal seo chun Neovim a chumrú le mo thaitneamh, lena n -áirítear eochair -chineálacha saincheaptha, téamaí, agus forlíontáin. Úsáidtear an tionscadal seo chun neovim a dhéanamh níos éasca le húsáid agus níos éifeachtaí le haghaidh mo úsáide pearsanta.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Gineadóir Léarscáil Patrick",
                "text": "Gineadóir Léarscáil Chontae agus Stáit na Stát Aontaithe, a tógadh le Python ag baint úsáide as leabharlanna geopandas agus matplotlib. Úsáidtear an tionscadal seo chun léarscáileanna de na Stáit Aontaithe a ghiniúint, lena n -áirítear léarscáileanna contae agus stáit. Úsáidtear an tionscadal seo chun léarscáileanna saincheaptha a chruthú le haghaidh léirshamhlú agus anailís sonraí.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Leabharlann Script PowerShell Patrick's",
                "text": "Leabharlann úsáideach de scripteanna PowerShell le haghaidh tagartha amach anseo. Tá sé úsáideach leis an ngné scripte $ próifíl, is dóigh liom go bhfuil sé seo an -chabhrach chun tascanna a uathoibriú ón gcríochfort Windows, mar is minic a bhíonn mé ag úsáid an Windows OS.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Leabharlann Script Ruby Patrick",
                "text": "Leabharlann úsáideach de scripteanna Ruby le haghaidh tagartha amach anseo. Úsáideach do Ruby ar Choincheapa Forbraíochta Ráillí sa todhchaí.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "Tógálaí Scileanna PDF",
                "text": "Tógálaí saincheaptha PDF a tógadh le Python trí shíneadh PDFKit agus Jinja2, in éineacht le formáidiú HTML agus JSON. Úsáidtear an tionscadal seo chun comhaid PDF a ghiniúint ó liosta scileanna agus tionscadal. Is féidir an tionscadal seo a úsáid chun atosú PDF saincheaptha a chruthú, rud atá an -úsáideach le haghaidh feidhmchlár poist.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Tionscadal Criptithe Rijandel",
                "text": "Teaghlach de 10+ cur i bhfeidhm an algartam criptithe Rijandel i 128, 192, agus 256 giotán. Úsáidtear an tionscadal seo chun an algartam criptithe Rijandel a léiriú i dteangacha cláir éagsúla. Úsáidtear an tionscadal seo chun teaghlach de chur i bhfeidhm an algartam criptithe Rijandel a chruthú.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Mod suprememc minecraft",
                "text": "Mod Minecraft a chuireann uirlisí saincheaptha, armúr, mobs, bloic, toisí, agus go leor gnéithe eile sa chluiche. Tógtha le leaganacha Java 8-17 le haghaidh leaganacha minecraft a roghnú idir 1.16 agus 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Teanga chlársceidealaithe Tíogair",
                "text": "Teanga chlárúcháin saincheaptha a tógadh i Go & Rust araon chun triail a bhaint as dearadh agus feidhmíocht ateangairí. Arna chur i bhfeidhm ar shuíomh gréasáin na punainne ag baint úsáide as Tionól Gréasáin.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Suíomh Gréasáin Buntáistí Tailgating Tiger",
                "text": "Láithreán gréasáin a thóg mé i 2024 le haghaidh Tiger Tailgating Pros, cuideachta eireaball i Clemson, SC. Tógtha le react.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Tionscadal Meaisín Turing",
                "text": "Teaghlach de níos mó ná 30+ cur i bhfeidhm an Turing Machine. Úsáidte chun iomláine Turing a léiriú do theangacha cláir éagsúla le haghaidh taighde, go háirithe don teanga chlársceidealaithe Tíogair.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Teanga chlársceidealaithe Tíogair"
    },
    "contact": {
        "title": "Déan teagmháil liom",
        "header": "Eolas Teagmhála",
        "email": "pattygsocials@gmail.com",
        "description": "Freagraím do fhiosrúcháin ó ríomhphost, ó theachtaireachtaí LinkedIn, agus ó theachtaireachtaí Instagram. Glaofaidh mé ar ais freisin má sholáthraítear mo uimhir trí atosú nó ar shlí eile, cé gur fearr liom m’uimhir theileafóin a choinneáil príobháideach."
    },
    "formatter": {
        "title": "Formatter Json & Yaml",
        "description": "Is uirlis é an formatter JSON & YAML a ligeann duit comhaid JSON agus YAML a fhormáidiú. Tá sé tógtha le dul agus le webassembly, agus tá sé deartha le bheith tapa agus éifeachtach. Tá an formáidí deartha le bheith éasca le húsáid, le comhéadan simplí a ligeann duit greamaigh i do chód JSON nó YAML agus é a fhormáidiú le cliceáil ar an gcnaipe.",
        "more_info1": "Le haghaidh tuilleadh eolais, féach an ReadMe sa",
        "more_info2": "Stór Formatter JSON/YAML.",
        "format_as": "Formáid mar:",
        "auto_detect": "Braith uathoibríoch",
        "format": "Formáil"
    },
    "cube_solver": {
        "title": "Rubix Ciúb Réitigh",
        "start": "Réiteach"
    },
    "tiger": {
        "title": "Teanga Tíogair",
        "description": "Is teanga chlársceidealaithe saincheaptha í an Tiger Clársceidealaithe a tógadh i Go & Rust chun triail a bhaint as dearadh agus feidhmíocht ateangairí. Arna chur i bhfeidhm ar shuíomh gréasáin na punainne ag baint úsáide as Tionól Gréasáin. Is teanga chlársceidealaithe saincheaptha í an Tiger Clársceidealaithe a tógadh i Go & Rust chun triail a bhaint as dearadh agus feidhmíocht ateangairí. Arna chur i bhfeidhm ar shuíomh gréasáin na punainne ag baint úsáide as Tionól Gréasáin.",
        "more_info1": "Le haghaidh tuilleadh eolais, féach an ReadMe sa",
        "more_info2": "TEACHANNA TEACHTAIREACHTA TEAGHLAIGH GITHUB.",
        "select_engine": "Roghnaigh Inneall:",
        "tiger_code": "Cód Tíogair:",
        "run_tiger": "Rith Tíogair",
        "output": "Aschur:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Innealtóir Bogearraí Stack Iomlán lonnaithe i Lár Florida"
    },
    "copy": {
        "text": "Cóip",
        "copied": "Cóipeáilte!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Dearagram",
        "linkedin": "Linkedin",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Lean Mise"
    },
    "languages": {
        "title": "Aistritheoir punainne",
        "description": "Faigh amach conas atá mo phunann inrochtana do chuairteoirí ar fud an domhain le tacaíocht do níos mó ná 100 teanga.",
        "global_accessibility": {
            "title": "Inrochtaineacht dhomhanda",
            "description": "Tá mo phunann ar fáil i dTeangacha os cionn {Count}, rud a fhágann go bhfuil sé inrochtana do chuairteoirí ar fud an domhain. Léiríonn an cur chuige ilteangach seo mo thiomantas do chuimsitheacht agus do shroichint dhomhanda i bhforbairt bogearraí.",
            "stats": {
                "languages_supported": "Teangacha tacaithe",
                "countries_represented": "Tíortha a bhfuil ionadaíocht acu",
                "continents_covered": "Mór -ranna clúdaithe"
            }
        },
        "features": {
            "title": "Bheith",
            "items": [
                {
                    "title": "Aistriúchán fíor-ama:",
                    "description": "Athraigh teangacha láithreach leis an roghnóir teanga"
                },
                {
                    "title": "Teanga URL-bhunaithe:",
                    "description": "Caomhnaítear roghanna teanga san URL"
                },
                {
                    "title": "Tacaíocht scripte dúchais:",
                    "description": "Scripteanna a dhéanamh go cuí cosúil le Araibis, Sínis, Hiondúis, agus níos mó"
                },
                {
                    "title": "Íogaireacht chultúrtha:",
                    "description": "Breithníonn aistriúcháin comhthéacs cultúrtha, ní hamháin bríonna liteartha"
                },
                {
                    "title": "Optamaithe Sinsearach:",
                    "description": "Tá gach leagan teanga optamaithe le haghaidh innill chuardaigh"
                }
            ]
        },
        "world_map": {
            "title": "Léarscáil Domhanda Idirghníomhach",
            "description": "Hover thar thíortha ar an léarscáil chun a dteangacha tacaithe a fheiceáil:",
            "languages_label": "Teanga",
            "legend": {
                "supported": "Teangacha tacaithe",
                "not_supported": "Gan Tacaíocht Teanga"
            },
            "zoom_controls": {
                "zoom_in": "Súmáil isteach",
                "zoom_out": "Súmáil amach",
                "reset": "Amharc Athshocraithe"
            }
        },
        "supported_languages": {
            "title": "Teangacha tacaithe"
        },
        "interactive_country_map": {
            "title": "Léarscáil tuaithe idirghníomhach",
            "description": "Hover thar thíortha thíos chun a dteangacha tacaithe a fheiceáil:",
            "language_count": {
                "single": "béarlagair",
                "multiple": "teanga"
            }
        },
        "tooltips": {
            "no_language_support": "Gan Tacaíocht Teanga"
        }
    },
    "logotext": "Pádraig"
}