{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Dachaigh",
        "about": "Mu mo dheidhinn",
        "portfolio": "Pasgan",
        "projects": "Pròiseactan làrach-lìn",
        "tiger": "Cànan tìgear",
        "formatter": "Ùine JSON & Yaml",
        "cube_solver": "Solarver CUBIX CUBE",
        "contact": "Cuir fios thugam"
    },
    "home": {
        "title": "Dachaigh",
        "animated": {
            "first": "Innleadair bathar-bog làn chruaidh",
            "second": "Leasaiche lìn",
            "third": "Leasaiche geama",
            "fourth": "CRUTHACHADH Susbaint"
        },
        "footer": "Làrach-lìn a-nis eadar-theangachadh & a tha rim faighinn ann an 100+ cànan 100+!",
        "descriptionA": "Einnseanair Bathar-bog Làn-Stack làn-chàireachadh làn-chàireachadh làn-chàireachadh làn-ghlan-stac",
        "descriptionB": "A bharrachd air an sin, tha mi nam eòlaiche susbaint cruinn-eòlas a fhuair e gu soirbheachail, Instagram, Youtube, agus Ionad Luchd-leantainn Dìomhaireachd is tarraingeach.",
        "portfolio_button": "Mo phasgan",
        "contact_button": "Cuir fios thugam",
        "about_button": "Mu mo dheidhinn"
    },
    "about": {
        "title": "Mu mo dheidhinn",
        "personal_summary": {
            "title": "Geàrr-chunntas Pearsanta",
            "text": "Mar leasaiche-claige làn chruach àrd stèidhichte ann an Orlando, fl a dhealbhaich e eòlas ann an diofar theicneòlasan, bho Java agus C ++ agus Nede.js. Le clàr slighe de phròiseactan aghaidh, a 'toirt a-steach leasachadh prògram beag Java airson Minecraft agus làrach-lìn buannachdail do dhraibhearan truca, tha mi air ceannardas agus ùr-ghnàthachadh a thaisbeanadh. Tha mo dhealas airson sàr-mhathais follaiseach anns a 'chomas agam gus fuasgladhan iom-fhillte a lìbhrigeadh a chuireas ri eòlas luchd-cleachdaidh agus a' stiùireadh soirbheachas eagrachaidh."
        },
        "professional_experience": {
            "title": "Eòlas proifeasanta",
            "entries": [
                {
                    "jobtitle": "Innleadair bathar-bog òigridh",
                    "where": "Orion180 àrachas",
                    "date": "2024 - an-diugh"
                },
                {
                    "jobtitle": "Founder & Làn-chleachdadh Làn-stuthan Stack",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Innleadair bathar-bog làn chruaidh",
                    "where": "Luathachadh ionnsachadh",
                    "date": "2023"
                },
                {
                    "jobtitle": "Prìomh leasaiche lìn (Prògram Oileanach)",
                    "where": "Prògram GDI Oilthigh Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Neach-stiùiridh deasg",
                    "where": "Oilthigh Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Neach-stiùiridh deasg",
                    "where": "Oilthigh Clemson",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Sgilean Teicnigeach",
            "header1": "Cànanan Prògramadh",
            "header2": "Frèamaichean & leabharlannan",
            "header3": "Innealan & teicneòlasan"
        },
        "services": {
            "title": "Mo sheirbheisean",
            "entries": [
                {
                    "title": "Innleadaireachd Clò-chruaidh",
                    "text": "Bidh mi a 'tabhann fuasglaidhean coileanta thar gach cuid leasachadh aghaidh agus crìoch air ais, a' dèanamh cinnteach gum bi amalachadh agus comas-gnìomha gun fhiosta air feadh a 'chruach-bhàmh-bhathar-bog gu lèir."
                },
                {
                    "title": "Leasachadh lìn",
                    "text": "Le eòlas ann an HTML, CSS, agus Javas na frèamraidhean mar Reacks.js, tha mi a 'dèanamh làraich-lìn tarraingeach agus càirdeil do luchd-cleachdaidh gus coinneachadh ri feumalachdan agus roghainnean sònraichte luchd-cleachdaidh."
                },
                {
                    "title": "Leasachadh Gèam",
                    "text": "Cànanan lughdachadh leithid Java agus C ++, tha mi a 'cruthachadh eòlasan gèam truaidh, bho bhun-bheachd agus dealbhadh, a' dèanamh cinnteach à cuirm geama agus rèidh."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Pasgan",
        "filter_by": "Pasgan sìoltachan le:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca JSON",
                "text": "Pròiseact python a bhios a 'sgioblachadh eadar-theangachadh cànain. A 'ceadachadh mo pasgan làrach-lìn eadar-theangachadh gu 70+ Cànanan, a' toirt a-steach Spàinntis, Fraingis, Arabach, agus mòran eile. Tha am pròiseact seo air a chleachdadh gus làrach-lìn ioma-chànanach a chruthachadh, a tha glè fheumail air luchd-èisteachd nas fharsainge a ruighinn. Leis a 'phròiseact seo, faodaidh còrr air 99% den t-saoghal mo chùram a leughadh ann an cànan fileanta.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Ceangail ceithir",
                "text": "Teaghlach mòr de chòrr air 50+ cruthachaidh de cheithir geama Ceangailte. Tha am pròiseact seo a 'toirt a-steach structaran ann an còrr air 30 de chànanan prògramadh, a' toirt a-steach Java, Python, Javas, agus barrachd. A bharrachd air an sin, tha e cuideachd a 'toirt a-steach còrr air 20+ frèam fhilmichean no cruthan eile, nam measg retact.js, ruby ​​air rèil, ASP.net agus barrachd agus barrachd.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "App grosaireachd",
                "text": "Làn-stac iomlan .Net 9 tagradh Blazor Frithealaiche airson a bhith a 'riaghladh nithean grosaireachd. Tha an tagradh a 'leantainn Pàtran Rianadair / Seirbheis / Ath-stòradh le Frèam ENTIFrity City airson Someringce Entersurce Stand.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Pròiseact Interop",
                "text": "Pròiseact a tha ag inntinn a 'dèanamh ath-dhealbhachadh eadar diofar chànanan prògramaidh. An-dràsta tha 15 cànanan prògramadh de dhiofar chànanan agus 18 pàtrain cur gu bàs.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Clàr Cunntais",
                "text": "LÀRACH DEMO làn-stac làn-stac (Pìos) le Siostam Riaghlaidh Cunntais air a thogail le ceàrnaiche ceàrnach 17+ agus bòd.js. Tha an tagradh seo a 'sealltainn siostam pasgan aig ìre proifeasanta le dearbhadh cleachdaiche, smachd ruigsinneachd stèidhichte air dreuchd, clàr-seilbhe roinneadh, agus giullachd pàighidh meallta.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "Ùine JSON & Yaml Auto",
                "text": "Linter & fèin-leasachail airson faidhlichean JSON & Yaml. Tha am pròiseact seo air a chleachdadh gus foirmean JSON & Yampl a chruthachadh, a tha glè fheumail airson còd a chumail glan agus air a chuir air dòigh. Air a thogail le Go, air a chur ri chèile le Wagalebobry, agus freumhaichte a-steach don phasgan agam mar phròiseact làrach-lìn. Barrachd chruthan ri thighinn san àm ri teachd.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Gineadair minecraft JSON",
                "text": "Gineadair Bookight JSON air a thogail ann am Python airson Goireasan Mèinntc & Pacaidean dàta. Tha am pròiseact seo air a chleachdadh gus faidhlichean Jicors a ghineadh airson Mòdan Minecraft, a 'toirt a-steach stuthan gnàthaichte, blocaichean, agus eintiteasan. Gu math feumail airson nach e a-mhàin a 'cruthachadh dàta gnàthaichte, ach airson Mòdan a bharrachd air feart ath-atharrachadh ainm a' Mhòid.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Mo eòlas foghlaim",
                "text": "Còmhla ri mo phròiseactan pearsanta, tha mi cuideachd air grunn sgilean fhaighinn bho eòlas foghlaim. Cliog an seo gus sùil a thoirt air a 'phròifil Lintentin agam airson tuilleadh fiosrachaidh.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Mo eòlas proifeasanta",
                "text": "Còmhla ri mo phròiseactan pearsanta, tha mi cuideachd air grunn sgilean fhaighinn bho eòlas proifeasanta. Cliog an seo gus sùil a thoirt air a 'phròifil Lintentin agam airson tuilleadh fiosrachaidh.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Làrach-lìn pasgan Patfolio Patfown",
                "text": "Is e an làrach-lìn seo mo làrach-lìn portfolio pearsanta, air a thogail le react.js. Tha am pròiseact seo air a chleachdadh gus mo sgilean agus mo phàrantan a thaisbeanadh, a bharrachd air àrd-ùrlar a thoirt seachad airson luchd-fastaidh a dh 'fhaodadh fios a chuir thugam. Tha am pròiseact seo air a chleachdadh gus làthaireachd proifeasanta air-loidhne a chruthachadh.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Leabharlann sgriobt lua patrick",
                "text": "Leabharlann feumail de sgriobtaichean lua airson iomradh san àm ri teachd. Tha an leabharlann seo air a chleachdadh gus gnìomhan a dhèanamh fèin-ghluasadach ann an sgriobtaichean Lua, a dh 'fhaodadh a thighinn a-steach airson gnìomhan feumach coileanaidh, oir mar as trice tha Lua mar chànan sgrìobhaidh nas luaithe agus ruby ​​mar as trice.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Sgriobtaichean spreadhaidh Microsoft Aidicollaich Patrick (VBA)",
                "text": "Leabharlann feumail de sgriobtaichean VBA airson Microsoft Excel. Tha an leabharlann seo air a chleachdadh gus gnìomhan a dhèanamh fèin-ghluasadach ann an claigesheets Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Config Neovim Patrick",
                "text": "Mo rèiteachadh pearsanta neo-làthaireach. Tha am pròiseact seo air a chleachdadh gus Neovim a rèiteachadh gus mo choiteachadh, a 'gabhail a-steach prìomh ainmean àbhaisteach, cuspairean agus plugins. Tha am pròiseact seo air a chleachdadh gus a dhèanamh nas fhasg Neovim agus èifeachdach airson mo chleachdadh pearsanta.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Gineadair mapa patrick",
                "text": "Gineadair mapa na Stàitean & Mapa Stàite na Stàitean Aonaichte Stàitean, air a thogail le Python a 'cleachdadh leabharlann Geopdadas agus Matplotlib. Tha am pròiseact seo air a chleachdadh gus mapaichean de na Stàitean Aonaichte a ghineadh, a 'toirt a-steach siorrachd agus mapaichean stàite. Tha am pròiseact seo air a chleachdadh gus mapaichean gnàthaichte a chruthachadh airson sealladh dàta agus mion-sgrùdadh.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Leabharlann Sgriobt de Powerthellhell Patrick",
                "text": "Leabharlann feumail de sgriobtaichean cumhetsfets airson iomradh san àm ri teachd. Feumail leis a 'phrìomh fheart sgriobt $ Pròiseact, tha mi nam fìor chuideachail airson gnìomhan fèin-ghluasadach bho cheann-uidhe Windows, oir tha mi nam neach-cleachdaidh tric de na h-US OS.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Leabharlann Sgriobt Rubrick Patrick",
                "text": "Leabharlann feumail de sgriobtaichean Ruby airson iomradh san àm ri teachd. Feumail airson ruby ​​san àm ri teachd air rèilichean leasachaidh a dhèanamh air bun-bheachdan leasachaidh.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "Neach-togail sgilean PDFF",
                "text": "Neach-togail pdf gnàthaichte a chaidh a thogail le Python tro na leudachain PFFKit agus Jinja2, còmhla ri cruth HTML agus JSON. Tha am pròiseact seo air a chleachdadh gus faidhlichean PDF a ghineadh bho liosta de sgilean agus phròiseactan. Faodar am pròiseact seo a chleachdadh gus ath-thòiseachadh PDF Cusbaigeach a chruthachadh, a tha glè fheumail airson tagraidhean obrach.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Pròiseact Criotryd Rijsanl",
                "text": "Teaghlach de 10+ cunntais de Algorithm Encrydm Rijandel ann an 128, 192, agus 256 pìosan. Tha am pròiseact seo air a chleachdadh gus a bhith a 'nochdadh Algorithm Encryption Rijandel ann an diofar chànanan prògramaidh. Tha am pròiseact seo air a chleachdadh gus teaghlach de bhuileachadh a chruthachadh de algorithm criomataidh Rijandm.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Mod Minemccraft Minecraft",
                "text": "Mod minecraft a chuireas innealan àbhaisteach, armachd, mobs, blocaichean, tomhasan, agus mòran a bharrachd nam feartan san gheama. Air a thogail le dreachan java 8-17 airson dreachan MINECRACT a thaghadh eadar 1.16 agus 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Cànan prògramadh tìgear",
                "text": "Cànan prògramadh àbhaisteach air a thogail anns gach cuid Go & Rùthan gus dealbhadh is coileanadh eadar-theangachaidh a dhèanamh. Air a bhuileachadh air an làrach-lìn a 'chùmhnain a' cleachdadh Seanadh Lìn.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tìgear làrach-lìn ProS a 'tarraing",
                "text": "Làrach-lìn a thog mi ann an 2024 airson Tìgear Tìglaidh Tìgear, companaidh tailgation ann an Clemson, SC. Air a thogail le react.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Pròiseact Machine Trighd",
                "text": "Teaghlach de chòrr air 30+ Cruthachadh an inneal troimh-chladail. Air a chleachdadh gus ar-a-mach àrda airson diofar chànanan prògramaidh airson rannsachadh, gu sònraichte dha cànan prògramadh tìgear.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Cànan prògramadh tìgear"
    },
    "contact": {
        "title": "Cuir fios thugam",
        "header": "Fiosrachadh conaltraidh",
        "email": "pattygoscials@gmail.com",
        "description": "Bidh mi a 'freagairt cheistean bho phost-d, teachdaireachdan ceangailte agus teachdaireachdan Instagram. Cuiridh mi fios air ais ma thèid an àireamh agam a thoirt seachad tro ath-thòiseachadh no air dhòigh eile, ged is fheàrr leam an àireamh fòn agam a chumail prìobhaideach."
    },
    "formatter": {
        "title": "Ùine JSON & Yaml",
        "description": "Tha an cruth Json & Yaml na inneal a leigeas leat foirmean JSON agus YAML a chruthachadh. Tha e air a thogail le Go agus Haseasssebly, agus tha e air a dhealbhadh gus a bhith luath agus èifeachdach. Tha an cruth air a dhealbhadh gus a bhith furasta a chleachdadh, le eadar-aghaidh shìmplidh a leigeas leat a bhith a 'pasgadh san chòd json no yaml agad agus a chruth ris le cliog air putan.",
        "more_info1": "Airson tuilleadh fiosrachaidh, thoir sùil air an leughadair anns an",
        "more_info2": "Stòr-cruth JSON / Yaml.",
        "format_as": "Cruth mar:",
        "auto_detect": "Lorg fèin-ghluasadach",
        "format": "Cruth"
    },
    "cube_solver": {
        "title": "Solarver CUBIX CUBE",
        "start": "Fuasgladh"
    },
    "tiger": {
        "title": "Cànan tìgear",
        "description": "Tha an cànan prògramadh tìgear na chànan prògramaidh àbhaisteach a chaidh a thogail anns gach cuid Go & Rùthan gus dealbhadh is coileanadh eadar-theangair a dhèanamh. Air a bhuileachadh air an làrach-lìn a 'chùmhnain a' cleachdadh Seanadh Lìn. Tha an cànan prògramadh tìgear na chànan prògramaidh àbhaisteach a chaidh a thogail anns gach cuid Go & Rùthan gus dealbhadh is coileanadh eadar-theangair a dhèanamh. Air a bhuileachadh air an làrach-lìn a 'chùmhnain a' cleachdadh Seanadh Lìn.",
        "more_info1": "Airson tuilleadh fiosrachaidh, thoir sùil air an leughadair anns an",
        "more_info2": "Dreuchd Tìgidh Gnìomh Cànan Github cànain.",
        "select_engine": "Tagh einnsean:",
        "tiger_code": "Còd Tìgear:",
        "run_tiger": "Ruith tìgear",
        "output": "Toradh:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Einnseanair Bathar-bog lìonaidh stèidhichte ann am meadhan Florida"
    },
    "copy": {
        "text": "Leth-bhreac",
        "copied": "Copaidh!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "Youtube",
        "text_strip": "Lean mi"
    },
    "logotext": "Patrick"
}