{
    "name": "Patrick Goodwin rehegua .",
    "menu": {
        "home": "Óga",
        "about": "Che rehegua .",
        "portfolio": "Cartera rehegua .",
        "projects": "Proyectos de página web rehegua .",
        "tiger": "Tigre Ñe’ẽ .",
        "formatter": "Formatador JSON & YAML rehegua .",
        "cube_solver": "Rubix Cubo Solviador rehegua .",
        "contact": "Contactar con me ."
    },
    "home": {
        "title": "Óga",
        "animated": {
            "first": "Ingeniero de Software Pila Completa rehegua .",
            "second": "Web apohare .",
            "third": "Ñembosarái apoha .",
            "fourth": "Contenido apohare ."
        },
        "footer": "Página web ko'ágã oñembohasáva & avaliable en 100+ idiomas!",
        "descriptionA": "Ingeniero de Software & Desarrollador Web experimentado orekóva experimentado orekóva tembiasa ojehechaukáva omotenondéva exitosamente umi proyecto desarrollo, omoheñóiva modificación Java Minecraft-pe guarã omomba'eguasúvo experiencia usuario react.js ha omoañetévo API de Rest Secure, péicha avei omomba'apo metodología ágil ha colaboración efectiva equipo.",
        "descriptionB": "Adicionalmente, che ha’e peteĩ creador de contenido geografía rehegua oaprovecha porãva’ekue umi algoritmo múltiple plataforma de medios sociales-pe, oikehápe Instagram, YouTube ha Tiktok, ohupyty haĝua peteĩ base seguidora respetable ha atractiva.",
        "portfolio_button": "Che cartera .",
        "contact_button": "Contactar con me .",
        "about_button": "Che rehegua ."
    },
    "about": {
        "title": "Che rehegua .",
        "personal_summary": {
            "title": "Resumen personal rehegua .",
            "text": "Peteĩ desarrollador software pila completa experimentada ramo oñemopyendáva Orlando, FL-pe, ahechauka katupyry opaichagua tecnología-pe, Java ha C++ guive React.js ha Node.js peve. Oguerekóva peteĩ historial umi proyecto de spearheading rehegua, oikehápe desarrollo peteĩ programa de modificación Java Minecraft-pe ĝuarã ha peteĩ página web recompensa umi camionero-pe ĝuarã, ahechauka liderazgo ha innovación. Che compromiso excelencia rehegua ojehecha che capacidad-pe a’agiliza haĝua proyecto gestión, asoluciona haĝua umi problema complejo ha ame’ẽ haĝua solución de alta calidad omomba’eguasúva experiencia usuario-pe ha omongu’éva éxito organizacional."
        },
        "professional_experience": {
            "title": "Experiencia Profesional rehegua .",
            "entries": [
                {
                    "jobtitle": "Ingeniero de Software Junior rehegua .",
                    "where": "Orión180 Seguro rehegua .",
                    "date": "2024 - ko’áĝagua ."
                },
                {
                    "jobtitle": "Fundador & Software Pila Full apohare .",
                    "where": "SupremeMc rehegua .",
                    "date": "2020 - 2024 rehegua."
                },
                {
                    "jobtitle": "Ingeniero de Software Pila Completa rehegua .",
                    "where": "Oñembo’e pya’e haguã aprendizaje .",
                    "date": "2023 rehegua."
                },
                {
                    "jobtitle": "Omotenonde Web apoha (Programa temimbo’e rehegua) .",
                    "where": "Programa GDI Universidad Clemson rehegua .",
                    "date": "2021 - 2022 rehegua."
                },
                {
                    "jobtitle": "Supervisor de escritorio rehegua .",
                    "where": "Mbo’ehaovusu Clemson .",
                    "date": "2021 - 2022 rehegua."
                }
            ]
        },
        "technical_skills": {
            "title": "Katupyry Técnico rehegua art .",
            "header1": "Ñe’ẽtekuaa rehegua art .",
            "header2": "Marcos & Bibliotecas rehegua .",
            "header3": "Tembiporu ha tecnología rehegua ."
        },
        "services": {
            "title": "Che servicio-kuéra rehegua .",
            "entries": [
                {
                    "title": "Ingeniería de pila completa rehegua .",
                    "text": "Aikuave’ẽ solución integral mokõive desarrollo front-end ha back-end rupive, oaseguráva integración ha funcionalidad sin costura pe pila software pukukue javeve."
                },
                {
                    "title": "Web Ñemoheñói .",
                    "text": "Oguerekóva katupyry HTML, CSS ha JavaScript frameworks-pe React.js-icha, amoheñói artesanía umi página web ojehecharamóva ha ojeporúva ojepuru hag̃ua oñembohovái hag̃ua cliente-kuéra remikotevẽ ha jeporavopyre."
                },
                {
                    "title": "Ñembosarái ñemoheñói .",
                    "text": "Oaprovecháva umi lenguaje ha’eháicha Java ha C++, añembokatupyry amoheñóivo experiencias de juego inmerso, concepto ha diseño guive implementación ha optimización peve, oaseguráva atractivo juego ha rendimiento suave."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Cartera rehegua .",
        "filter_by": "Cartera de filtros por:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca JSON .",
                "text": "Peteĩ proyecto Python omohenda porãva ñe’ẽ ñembohasa. Oheja che página web cartera oñembohasa 70+ ñe’ẽme, umíva apytépe español, francés, chino, árabe ha heta ambue. Ko tembiaporã ojepuru ojejapo hag̃ua peteĩ cartera multilingüe página web rehegua, oipytyvõvaiterei oñeguahẽ hag̃ua peteĩ público tuichavévape. Ko tembiaporã rupive, 99% rupi ko yvy ape ári ikatu omoñe’ẽ che cartera peteĩ ñe’ẽ porãme.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Oñembojoaju irundy .",
                "text": "Familia masiva ohasáva 50+ implementación Connect Four Game. Ko tembiaporãme oike umi implementación 30 ñeꞌepykuaa iñambuévape, umíva apytépe Java, C++, Python, JavaScript ha hetave. Avei, oike avei 20+ marco iñambuéva térã ambue formato, umíva apytépe React.js, Ruby on Rails, ASP.NET, ha hetave.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Proyecto interop rehegua .",
                "text": "Peteĩ proyecto ohaihápe interoperabilidad opaichagua lenguaje de programación apytépe. Ko’áĝa oike 15 lenguaje de programación iñambuéva ha 18 patrón ejecución rehegua.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "JSON & YAML AUTO FORMATER GUARANI .",
                "text": "Peteĩ linter & autoformatista umi archivo JSON & YAML-pe g̃uarã. Ko tembiaporã ojepuru oñemboheko hag̃ua JSON & YAML vorekuéra, ideprovechoitereíva oñeñongatu hag̃ua código ipotĩ ha oñembosakoꞌi hag̃ua. Oñemopu’ãva GO ndive, oñembyatýva WebAssembly ndive, ha oñemboguapýva che cartera-pe proyecto sitio web ramo. Hetave formato oúva tenonderãme.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft json generador rehegua .",
                "text": "Generador JSON peso ligero oñemopu’ãva Python-pe Minecraft Resource & Data Packs-pe g̃uarã. Ko tembiaporã ojepuru ojejapo hag̃ua JSON vorekuéra Minecraft mods-pe g̃uarã, umíva apytépe umi mbaꞌe ojejapóva, bloque ha entidad. Iporãiterei ndaha’éi ojejapo hag̃ua datokuéra jeporupyre añónte, ha katu mods-pe g̃uarã avei Mod réra ñembohasa mba’ekuaarã rupive.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Che experiencia educativa rehegua .",
                "text": "Che proyecto personal ykére, avei ahupyty heta katupyry experiencia educativa-gui. Emboguejy ko’ápe rehecha haĝua che perfil LinkedIn-pe reikuaave haĝua.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Che experiencia profesional rehegua .",
                "text": "Che proyecto personal ykére, avei ahupyty heta katupyry experiencia profesional-gui. Emboguejy ko’ápe rehecha haĝua che perfil LinkedIn-pe reikuaave haĝua.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Goodwin cartera página web .",
                "text": "Ko página web ha’e che página web cartera personal, oñemopu’ãva react.js ndive. Ko proyecto ojeporu ojehechauka haguã che katupyry ha proyecto, avei ome'ê haguã peteî plataforma umi potencial empleador-kuérape guarã oñemoî haguã chendive. Ko proyecto ojeporu omoheñóivo presencia profesional en línea.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patrick's Lua guión biblioteca .",
                "text": "Peteĩ biblioteca útil umi script LUA rehegua ojehecha hag̃ua tenonderãme. Ko aranduka’aty ojepuru ojejapo hag̃ua tembiaporã umi script LUA-pe, ikatúva ou porã umi tembiapo oikotevẽva rendimiento-pe g̃uarã, LUA ha’égui jepi peteĩ ñe’ẽ scripting pya’eveva mokõive Python ha Ruby-gui.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrick's Microsoft Excel Hoja de cálculo Scripts (VBA) rehegua .",
                "text": "Peteĩ aranduka’i iporãva VBA script Microsoft Excel-pe g̃uarã. Ko aranduka’aty ojepuru ojejapo hag̃ua tembiapoukapy ojejapo hag̃ua Excel kuatiaroguekuérape.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Patrick's Neovim config .",
                "text": "Che Configuración Neovim Personal rehegua. Ko tembiaporã ojepuru oñemboheko hag̃ua NEOVIM che gustahápe, umíva apytépe umi clave personalizada, tema ha plugins. Ko tembiaporã ojepuru ojejapo hag̃ua Neovim ojepurukuaa ha hekopete che jeporu personal-pe g̃uarã.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patrick generador de mapas .",
                "text": "Peteĩ generador de mapas del condado de Estados Unidos & Estado, oñemopu’ãva Python ndive oiporúva umi biblioteca Geopandas ha Matplotlib. Ko tembiaporã ojepuru ojejapo hag̃ua mapa Estados Unidos-pegua, umíva apytépe oĩ umi mapa condado ha estatal. Ko tembiaporã ojepuru ojejapo hag̃ua mapa personalizado ojejapo hag̃ua datokuéra jehechauka ha análisis.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patrick's PowerShell Ñe'ẽryru .",
                "text": "Peteĩ aranduka’i iporãva PowerShell script-kuéra rehegua ojehecha hag̃ua tenonderãme. Iporãva $PROFILE script mba’ekuaarã ndive, ajuhu kóva tuicha oipytyvõha ojejapo hag̃ua tembiapo automatización rehegua Windows terminal-gui, che ha’égui peteĩ puruhára py’ỹi Windows OS-pe.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patrick's Ruby Script Biblioteca .",
                "text": "Peteĩ biblioteca útil Ruby Scripts rehegua ojehecha hag̃ua tenonderãme. Iporã umi Conceptos de Desarrollo Rubio Futuro-pe guarã.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF katupyry apoha .",
                "text": "Peteĩ PDF apoha jeporupyre oñemopu’ãva Python ndive umi pdfkit ha jinja2 extensión rupive, HTML ha JSON formato ykére. Ko tembiaporã ojepuru ojejapo hag̃ua PDF rembiapokue peteĩ katupyry ha tembiaporãgui. Ko tembiaporã ikatu ojepuru ojejapo hag̃ua peteĩ PDF je’epyre jeporupyre, ha’éva peteĩ mba’e ideprovechoitereíva umi aplicación tembiaporãme g̃uarã.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Proyecto de cifrado Rijandel rehegua .",
                "text": "Peteĩ familia 10+ implementación algoritmo cifrado Rijandel rehegua 128, 192 ha 256 bits-pe. Ko tembiaporã ojepuru ojehechauka hag̃ua algoritmo cifrado Rijandel rehegua opaichagua lenguaje de programación-pe. Ko tembiaporã ojepuru ojejapo hag̃ua peteĩ familia implementación rehegua algoritmo cifrado Rijandel rehegua.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "SupremeMc Minecraft mod .",
                "text": "Peteĩ mod Minecraft omoĩva tembipuru personalizado, armadura, multitud, bloque, dimensiones ha heta mba’e ñembosaráipe. Oñemopu’ãva Java versión 8-17 reheve umi versión Minecraft ojeporavóvape g̃uarã 1,16 ha 1,20 mbytépe.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tigre Ñe’ẽtekuaa rehegua .",
                "text": "Lenguaje de programación personalizado oñemopu’ãva mokõive Go & Rust-pe oñeha’ã hag̃ua diseño ha rendimiento intérprete rehegua. Oñemoañetéva página web cartera oiporúva Asamblea Web.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger Tailgating Pros página web .",
                "text": "Peteĩ página web amopu’ãva’ekue 2024-pe Tigre Tailgating Pros-pe ĝuarã, peteĩ empresa de tailgating Clemson, SC-pe. Oñemopu’ãva React.Js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Proyecto Máquina de Turing rehegua .",
                "text": "Familia orekóva 30+ implementación máquina Turing-pe. Ojepuru ojehechauka hag̃ua Turing Completidad opaichagua lenguaje de programación rehegua investigación-pe g̃uarã, ko’ýte lenguaje de programación Tigre-pe g̃uarã.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tigre Ñe’ẽtekuaa rehegua ."
    },
    "contact": {
        "title": "Contactar con me .",
        "header": "Marandu rehegua art .244 .",
        "email": "pattygsocials@gmail.com .",
        "description": "Ambohovái umi consulta correo electrónico, marandu LinkedIn ha Instagram-gui. Avei ahenóita oñeme’ẽramo che número currículum rupive térã ambue mba’épe, jepémo aipotave añongatu che número de teléfono privado."
    },
    "formatter": {
        "title": "Formatador JSON & YAML rehegua .",
        "description": "JSON & YAML Formatter haꞌehína peteĩ tembipuru ohejáva ndéve emohenda JSON ha Yaml rembiapokue. Oñemopu’ã Go ha WebAssembly rupive, ha ojejapo pya’e ha hekopete. Pe formato ojejapo ndahasýi hag̃ua ojepuru hag̃ua, peteĩ interfaz simple reheve ohejáva ndéve remboguapy nde código JSON térã YAML-pe ha eformata peteĩ botón clic rupive.",
        "more_info1": "Ojeikuaave hag̃ua, ehecha pe readme oĩva pe .",
        "more_info2": "JSON/YAML Formatter ryru.",
        "format_as": "Formato ha’eháicha: .",
        "auto_detect": "Auto Detección rehegua .",
        "format": "Formato rehegua ."
    },
    "cube_solver": {
        "title": "Rubix Cubo Solviador rehegua .",
        "solve": "Mbo'aipo'i"
    },
    "tiger": {
        "title": "Tigre Ñe’ẽ .",
        "description": "Pe lenguaje de programación TIGER ha’e peteĩ lenguaje de programación personalizado oñemopu’ãva mokõive Go & Rust-pe oñeha’ã haĝua diseño ha rendimiento intérprete rehegua. Oñemoañetéva página web cartera oiporúva Asamblea Web. Pe lenguaje de programación TIGER ha’e peteĩ lenguaje de programación personalizado oñemopu’ãva mokõive Go & Rust-pe oñeha’ã haĝua diseño ha rendimiento intérprete rehegua. Oñemoañetéva página web cartera oiporúva Asamblea Web.",
        "more_info1": "Ojeikuaave hag̃ua, ehecha pe readme oĩva pe .",
        "more_info2": "Tigre Ñe’ẽtekuaa rehegua GitHub Repositorio.",
        "select_engine": "Eiporavo Motor: .",
        "tiger_code": "Código Tigre rehegua: .",
        "run_tiger": "Tigre de carrera .",
        "output": "Osẽva: ."
    },
    "tab": {
        "title": "Patrick Goodwin rehegua .",
        "description": "Ingeniero de software de pila completa oñemopyendáva Florida Central-pe ."
    },
    "copy": {
        "text": "copia rehegua .",
        "copied": "Copiada!"
    },
    "social_media": {
        "github": "Github .",
        "instagram": "Instagram .",
        "linkedin": "LinkedIn rehegua .",
        "tiktok": "Tiktok rehegua .",
        "youtube": "YouTube .",
        "text_strip": "Chemoirũ ."
    },
    "logotext": "Patrick ."
}