{
    "name": "Patrick maikai",
    "menu": {
        "home": "KA HOME",
        "about": "E pili ana iaʻu",
        "portfolio": "Prtofolii",
        "projects": "Nā papahana papahana pūnaewele pūnaewele",
        "tiger": "'Ōlelo Tiger",
        "formatter": "Jon & Yaml Computer",
        "cube_solver": "Rubix Cube Solver",
        "contact": "Kāhea mai iaʻu"
    },
    "home": {
        "title": "KA HOME",
        "animated": {
            "first": "ʻO ka mīkini mīkini kamepiula spack",
            "second": "Hoʻouka ka Pūnaewele",
            "third": "Nā Mea Hana Pūnaewele",
            "fourth": "Hōʻikeʻike Pūʻali"
        },
        "footer": "Pūnaewele i kēia manawa unuhiʻia & Avaliable ma 100+ mau'ōlelo!",
        "descriptionA": "Ua loaʻa i nā polokalamuʻenehana piha-stack a me ka hoʻolālā pūnaewele me ka mōʻaukala i hōʻikeʻia e hoʻonui ai i ka hoʻohanaʻana i ka hoʻohanaʻana i nā mika.",
        "descriptionB": "Eia kekahi,ʻo wau he mea hana hoʻokūkū Geotory e hana pono ai i nā algorithms e loaʻa ana i kahi papa hana lehulehu.",
        "portfolio_button": "Koʻu portfolio",
        "contact_button": "Kāhea mai iaʻu",
        "about_button": "E pili ana iaʻu"
    },
    "about": {
        "title": "E pili ana iaʻu",
        "personal_summary": {
            "title": "ʻO ka hōʻuluʻulu pilikino",
            "text": "E like me ka mea e loaʻa ai kahi polokalamu SECT SECHT FACK FACK i hoʻokumuʻia ma Orlando, Fl, hōʻike wau i nā loea i nāʻenehana likeʻole Me kahi papa inoa o nā papahana i'ōleloʻia, me ka hoʻomohalaʻana o kahi papahana hoʻololi o kahi minecrat no ka minecraft ʻO koʻu kuleana eʻikeʻia ai koʻu hiki keʻike i ka hiki ke hoʻokuʻi i ka hoʻokele limahana, e hoʻopau i nā pilikia kiʻekiʻe, a e hoʻopuka i nā pilikia kiʻekiʻe e hoʻonui ai i nā mea hoʻohana a hoʻokele i kaʻike ma luna."
        },
        "professional_experience": {
            "title": "Hōʻailona naʻauao",
            "entries": [
                {
                    "jobtitle": "ʻO Keʻena Pūnaewele Pūnaewele",
                    "where": "ʻO Oro180",
                    "date": "2024 - Hōʻike"
                },
                {
                    "jobtitle": "ʻO ka mea hoʻokumu a me nā mea hoʻopuka pūnaewele piha",
                    "where": "Hoomea1moremc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "ʻO ka mīkini mīkini kamepiula spack",
                    "where": "Loaʻa ka aʻoʻana",
                    "date": "2023"
                },
                {
                    "jobtitle": "E alakaʻi i ka Hoʻolālā Pūnaewele (papahana haumāna)",
                    "where": "Clemson University GDI Polokalamu",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Papa papa",
                    "where": "Ke Kulanui o Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Papa papa",
                    "where": "Ke Kulanui o Clemson",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Nā Lāʻikepili",
            "header1": "Nā'ōlelo pānaehana",
            "header2": "Nā Frameworks & Nā hale waihona puke",
            "header3": "Nā Mea Hana & Koina"
        },
        "services": {
            "title": "Nā lawelawe",
            "entries": [
                {
                    "title": "Piha piha",
                    "text": "Hāʻawi wau i nā hopena i hikiʻole i nā hopena i waena o ka palena mua a me ka hope o ke kūkuluʻana a me keʻano o ka hoʻopiliʻana a me ka hana ma keʻano holoʻokoʻa."
                },
                {
                    "title": "Hoʻomākaʻi Web",
                    "text": "Me kaʻikeʻana i ka HTML, CSS, a me nā kiʻi kiʻiʻole e like me React.js"
                },
                {
                    "title": "HoʻokalaʻIke Hoʻohālikelike",
                    "text": "ʻO nā mea i hala e like me ka java a me c ++, e hoʻomaʻamaʻa wau i ka hanaʻana i nā pāʻani pāʻani a me ka hoʻolālāʻana e hana ana i ka pāʻani pāʻani a me ka hoʻolālāʻana."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Prtofolii",
        "filter_by": "Kānana kānana e:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca Json",
                "text": "ʻO kahi palapala python Hāʻawi i kaʻu pūnaewele Portfolio e unuhiʻia i loko o 700 mau'ōlelo, me Sepania, Farani, ka poʻe Arabia, a me nā mea'ē aʻe. Hoʻohanaʻia kēia pāhana e hana i kahi waihona pūnaewele pūnaeweleʻo Multiʻilio,ʻo ia ka mea maikaʻi loa no ka hikiʻana i kahi mea kūkā kūkā. Me kēia papahana, ma luna o 99% o ka honua e hiki i ka honua ke heluhelu i koʻu awa i kahi'ōlelo maikaʻi.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Hōʻikeʻike",
                "text": "ʻO kaʻohana nui o luna o 50+ e hoʻokūkū ana i nā pāʻaniʻehāʻehā. Loaʻa kēia hana i nā lako hana ma mua o 30 mau'ōlelo hoʻolālā maʻamau, e komo pū me Java, c ++,ʻo Poython,ʻikeʻia. Eia kekahi, komo pū kekahi ma luna o 20+ mau mea hana likeʻole a me nā pepa'ē aʻe, me nā hana'ē aʻe, a hui pū me Ruby, aʻoi aku hoʻi.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "'Āke Paʻa",
                "text": "He papa piha piha piha. Ma muli o ka noiʻana i ka mea lawelawe / lawelawe / lawelawe / repository",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Hoʻolaha Polokalamu",
                "text": "He papahana e pili ana i nā palapala e pili ana i waena o nā'ōlelo maʻamau likeʻole. Aia i kēia manawa 15 mau'ōlelo maʻamau maʻamau a me 18 mau hiʻohiʻona hoʻokō.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Kākoʻo Inventory",
                "text": "ʻO kahi kiko'ī piha piha o ke kūʻai aku (pos) i hoʻopaʻa inoa me ka'ōnaehana hoʻokele inventory i kūkuluʻia me Anguland 17+ a me Node.js.js.js.js.js.js.js.js.js.js.js.js.js.js.js.js.js.js.js.js.js.js.js.js.js.js.js.js.j Hōʻike kēia noi i kahi'ōnaehana Pos a me ka hōʻoiaʻana i ka hōʻoiaʻana i ka mea hoʻohana,ʻo ka mana komo komoʻana, e nānā ana i ka hoʻoiliʻana.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "ʻO Jon & Yaml Auto Proder",
                "text": "ʻO kahi lingter & autopetter no Jon & Yaml Files. Hoʻohanaʻia kēia papahana e hoʻonohonoho i nā faila Jon & Yaml, he mea maikaʻi loa ia no ka mālamaʻana i ke code a hoʻonohonohoʻia. Kūkuluʻia me Go, hoʻopiʻiʻia me ka pūnaewele, a hoʻopiliʻia i loko o kaʻu waihona ma keʻano he papahana pūnaewele. Nā mea hou aʻe e hiki mai i ka wā e hiki mai ana.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "MINECRAFT JONSRARA",
                "text": "Ua kūkuluʻiaʻo Lightweight Jon Generator i ka Python no MYCHON NO MII MILYCE & Nā kiʻiʻikepili. Hoʻohanaʻia kēia papahana e hana i nā faila json no nā miscrat minectub he mau'āpana o nā minet, me nā poloka kūʻai aku, a me nā kumu kūʻai. He mea kūpono loa no ka hoʻohanaʻana i nāʻikepili maʻamau, akā naʻe nā mods me ka mod no ka hana hoʻololi mode.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "ʻO koʻuʻike hoʻonaʻauao",
                "text": "Me kaʻu mau papahana pilikino, loaʻa nō wau i nāʻike lehulehu mai kaʻike hoʻonaʻauao mai ka hoʻonaʻauao. Kaomi ma aneʻi e nānā i kaʻu moʻokāki LinkedIn no kaʻike hou aku.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "ʻO kaʻuʻike loea",
                "text": "Me kaʻu mau papahana pilikino, ua loaʻa nō iā wau nāʻike lehulehu mai kaʻike loea mai keʻike. Kaomi ma aneʻi e nānā i kaʻu moʻokāki LinkedIn no kaʻike hou aku.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Goodwil mau pūnaewele",
                "text": "ʻO kēia pūnaewele kaʻu pūnaewele Portfolio, kūkuluʻia me Roact.js. Hoʻohanaʻia kēia papahana e hōʻike i kaʻu mau akamai a me nā hana, e like me ka hāʻawiʻana i kahi kahua no nā mea hana e hiki mai iaʻu. Hoʻohanaʻia kēiaʻano hana e hana i kahi hanaʻoihana pūnaewele pūnaewele.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "ʻO ka hale waihona pukeʻo Patrick's Lit",
                "text": "He hale waihona waiwai o nā palapala kākau no ka'ōlelo e hiki mai ana. Hoʻohanaʻia kēia waihona kālā e hana i nā hana ma nā palapala i hiki ke hele i ka hana hana ma mua o Python a me Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "ʻO ka Pūnaeweleʻo Patrick's Micros",
                "text": "He hale waihona waiwai o VBA i nā palapala VBA no Microsoft Excel. Hoʻohanaʻia kēia waihona kālā e hoʻopili i nā hana i nā haʻawina exfl.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Ua hoʻonohonohoʻo Patrick's Nerick",
                "text": "ʻO kaʻu hoʻonohonoho pūnaewele pūnaewele pūnaewele pūnaewele pūnaewele. Hoʻohanaʻia kēia papahana e hoʻonohonoho iā NevIM i koʻu makemake, me nā kumu kūʻai maʻamau, nā kumuwaiwai, a me nā plugins. Hoʻohanaʻia kēia papahana e hana hou iā Nevim hou aku i ka mea hoʻohana-aloha a me ka maikaʻi no kaʻu hoʻohana pilikino.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "ʻO ka papa inoa o Patrick",
                "text": "A moku'āinaʻoʻAmelika Hui PūʻIa & Hui Pūʻulu Pūnaewele, kūkuluʻia me Python me ka hoʻohanaʻana i nā hale waihona puke a me nā MatPlotlib. Hoʻohanaʻia kēia papahana e hoʻoulu i nā palapala oʻAmelika Hui PūʻIa, me nā palapala'āina a me nā palapala'āina. Hoʻohanaʻia kēia papahana e hana i nā koho maʻamau maʻamau no kaʻikeʻike a me ka hoʻokauʻana.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "ʻO ka hale waihona pukeʻo Patrick",
                "text": "Kahi hale waihona waiwai o nā leka uila no nā leka e hiki mai ana. Hoʻohana me ka helu o ka helu helu kālā,ʻike wau i kēia mea kōkua i ka hanaʻana i nā hana o ka Windows.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "ʻO ka hale waihona pukeʻo Patrick",
                "text": "He hale waihona waiwai o nā kope o nā ruby ​​no ka mea e hiki mai ana. Maikaʻi no nā ruby ​​e hiki mai ana ma nāʻano hana maʻamau.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "ʻO ka mea kūʻai mai PDF",
                "text": "Ua kūkuluʻia kahi hale kūʻai PDF maʻamau me Python ma o ka PDFKIT a me Jinja2 Hoʻohanaʻia kēia papahana e hoʻoulu i nā faila pdf mai kahi papa inoa o nā mākau a me nā papahana. Hiki i kēiaʻoihana ke hana i ka hoʻolālā houʻana ma ka PDF maʻamau, kahi pono kūpono loa no nā noi noi.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "ʻO ka Polokalamu BIMIndel",
                "text": "ʻO kahiʻohana o 10+ e hoʻopili ana i ka algorithm intrrithm o ka rhijathm i 128, 192, a me 256, a me 256, a me 256, a me 256, a me 256, a me 256, a me 256, a me 256, a me 256 Hoʻohanaʻia kēia papahana e hōʻike i ka hoʻohuihuiʻo Rujaxt ma nā'ōlelo haʻahaʻa'ē aʻe. Hoʻohanaʻia kēia papahana e hana i kahiʻohana o ka hoʻokōʻana i ka algorithm comjandel.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Minestmc minecraft miner",
                "text": "He modraft mod e hoʻohui ai i nā mea hana hana maʻamau, nā mea kaua, nā mobs, nā mea hou aku, a me nā hiʻohiʻona hou, a me nā hiʻohiʻona hou aku, a me nā hiʻohiʻona hou, a me nā hiʻohiʻona hou aku, a me nā hiʻohiʻona hou aku, Ua kūkuluʻia me nā inoa inoa Java 8-17 no ka kohoʻana i nā minecraft ma waena o 1.16 a me 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "'Termlelo Tiger Polokalamu",
                "text": "ʻO ka'ōlelo maʻamau i kūkuluʻia ma keʻanoʻelua a me ka hanaʻana i ka hoʻokolohua me ka hoʻolālā unuhi'ōlelo a me ka hana. Hoʻokōʻia ma ke kahua waihona waihona e hoʻohana ana i ka hui pūnaewele.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "TIGER TEKSETER INFORS USER",
                "text": "Kahi pūnaewele i kūkuluʻia ma 2024 no ka Tiger Tailgating Pros, kahi hui Tailging ma Clemson, SC. Kūkuluʻia me react.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "ʻO ka hoʻolālāʻana o ka mīkini mīkini",
                "text": "ʻO kaʻohana o ka 30+ nā hoʻokō o ka mīkini paʻi. Ua hoʻohanaʻia e hōʻike i ka hoʻopaʻaʻana i ka pihaʻana no nā'ōleloʻokoʻa no ka noiʻi no ka noiʻi, he'ōlelo nui no ka'ōleloʻo tiiger.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "'Termlelo Tiger Polokalamu"
    },
    "contact": {
        "title": "Kāhea mai iaʻu",
        "header": "Hoʻokaʻaʻikeʻike",
        "email": "Pattygsross@gmail.com",
        "description": "Ua pane wau e nīnau mai i nā leka uila mai nā leka uila, a me nā leka Instagram. E kāhea aku nō hoʻi wau inā hāʻawiʻia kaʻu helu ma o ka hoʻomau a iʻole,ʻoiai makemake wau e mālama i kaʻu helu kelepona."
    },
    "formatter": {
        "title": "Jon & Yaml Computer",
        "description": "ʻO JSON & YSML Computer kahi mea hana e hiki ai iāʻoe ke hoʻololi iā Jon a me nā faila Yon lāuaʻo Yaml Files. Kūkuluʻia ia me ka hele a me ka pūnaewele, a ua hoʻolālāʻia e wikiwiki a me ka maikaʻi. Hoʻolālāʻia ka mea hoʻohālikelike e hoʻohana maʻalahi i ka hoʻohanaʻana, me kahi interface maʻalahi e hiki ai iāʻoe ke kau i kāu helu a me ka hoʻopiliʻana me ka pihi o kahi pihi.",
        "more_info1": "No kaʻike hou aku, e pili i ka mea heluhelu i ka",
        "more_info2": "Json / yaml profile repository.",
        "format_as": "Format AS:",
        "auto_detect": "ʻIkeʻo Auto",
        "format": "Hoʻohui"
    },
    "cube_solver": {
        "title": "Rubix Cube Solver",
        "start": "Sove"
    },
    "tiger": {
        "title": "'Ōlelo Tiger",
        "description": "ʻO ka'ōleloʻo Tiger Programom kahi'ōlelo papahana maʻamau i kūkuluʻia ma ka heleʻelua a hele i ka hoʻokolohua a me ka hana. Hoʻokōʻia ma ke kahua waihona waihona e hoʻohana ana i ka hui pūnaewele. ʻO ka'ōleloʻo Tiger Programom kahi'ōlelo papahana maʻamau i kūkuluʻia ma ka heleʻelua a hele i ka hoʻokolohua a me ka hana. Hoʻokōʻia ma ke kahua waihona waihona e hoʻohana ana i ka hui pūnaewele.",
        "more_info1": "No kaʻike hou aku, e pili i ka mea heluhelu i ka",
        "more_info2": "ʻO Tiger Hoʻolālā Hoʻolālā GitHub Respository.",
        "select_engine": "E koho i ka mīkini:",
        "tiger_code": "TIGER code:",
        "run_tiger": "Holo i ka tiger",
        "output": "Kālā:"
    },
    "tab": {
        "title": "Patrick maikai",
        "description": "ʻO ka mīkiniʻenehana kikowaena pūnaewele e pili ana i ke kikowaena waena o Florida"
    },
    "copy": {
        "text": "Kope",
        "copied": "Kopeʻia!"
    },
    "social_media": {
        "github": "GitHub",
        "instagram": "Instagram",
        "linkedin": "Linkedin",
        "tiktok": "Tiktook",
        "youtube": "YouTube",
        "text_strip": "Hāhai iaʻu"
    },
    "logotext": "Pāpale"
}