{
    "name": "पैट्रिक गुडविन",
    "menu": {
        "home": "घर",
        "about": "मेरे बारे में",
        "portfolio": "पोर्टफोलियो",
        "projects": "वेबसाइट परियोजनाएँ",
        "tiger": "टाइगर भाषा",
        "formatter": "JSON & YAML फॉर्मेटर",
        "cube_solver": "रूबिक्स क्यूब सॉल्वर",
        "contact": "मुझसे संपर्क करें"
    },
    "home": {
        "title": "घर",
        "animated": {
            "first": "पूर्ण स्टैक सॉफ्टवेयर इंजीनियर",
            "second": "वेब डेवलपर",
            "third": "खेल डेवलपर",
            "fourth": "सामग्री निर्माता"
        },
        "footer": "वेबसाइट अब 100+ भाषाओं में अनुवादित और उपलब्धि योग्य है!",
        "descriptionA": "अनुभवी पूर्ण-स्टैक सॉफ्टवेयर इंजीनियर और वेब डेवलपर सफलतापूर्वक अग्रणी विकास परियोजनाओं के एक प्रदर्शन वाले इतिहास के साथ, Minecraft के लिए जावा संशोधनों को बनाने से लेकर React.js में उपयोगकर्ता अनुभव को बढ़ाने और सुरक्षित REST API को लागू करने के लिए, जबकि लगातार एजाइल कार्यप्रणाली और प्रभावी टीम सहयोग को नियोजित करते हैं।",
        "descriptionB": "इसके अतिरिक्त, मैं एक भूगोल सामग्री निर्माता हूं, जिसने एक सम्मानजनक और आकर्षक अनुयायी आधार हासिल करने के लिए इंस्टाग्राम, YouTube और Tiktok सहित कई सोशल मीडिया प्लेटफार्मों के एल्गोरिदम का सफलतापूर्वक लाभ उठाया है।",
        "portfolio_button": "मेरा पोर्टफोलियो",
        "contact_button": "मुझसे संपर्क करें",
        "about_button": "मेरे बारे में"
    },
    "about": {
        "title": "मेरे बारे में",
        "personal_summary": {
            "title": "व्यक्तिगत सारांश",
            "text": "ऑरलैंडो, एफएल में स्थित एक अनुभवी पूर्ण स्टैक सॉफ्टवेयर डेवलपर के रूप में, मैंने विभिन्न प्रौद्योगिकियों में विशेषज्ञता का प्रदर्शन किया है, जावा और सी ++ से लेकर रिएक्ट.जेएस और नोड.जे.एस. स्पीयरहेड प्रोजेक्ट्स के एक ट्रैक रिकॉर्ड के साथ, जिसमें Minecraft के लिए एक जावा संशोधन कार्यक्रम के विकास और ट्रक ड्राइवरों के लिए एक पुरस्कृत वेबसाइट शामिल है, मैंने नेतृत्व और नवाचार का प्रदर्शन किया है। उत्कृष्टता के लिए मेरी प्रतिबद्धता परियोजना प्रबंधन को सुव्यवस्थित करने, जटिल समस्याओं को हल करने और उच्च गुणवत्ता वाले समाधान देने की मेरी क्षमता में स्पष्ट है जो उपयोगकर्ता अनुभव को बढ़ाता है और संगठनात्मक सफलता को बढ़ाता है।"
        },
        "professional_experience": {
            "title": "पेशेवर अनुभव",
            "entries": [
                {
                    "jobtitle": "कनिष्ठ सॉफ्टवेयर इंजीनियर",
                    "where": "Orion180 बीमा",
                    "date": "2024 - वर्तमान"
                },
                {
                    "jobtitle": "संस्थापक और पूर्ण स्टैक सॉफ्टवेयर डेवलपर",
                    "where": "सुप्रीमम",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "पूर्ण स्टैक सॉफ्टवेयर इंजीनियर",
                    "where": "सीखने में तेजी लाएं",
                    "date": "2023"
                },
                {
                    "jobtitle": "लीड वेब डेवलपर (छात्र कार्यक्रम)",
                    "where": "क्लेम्सन यूनिवर्सिटी जीडीआई कार्यक्रम",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "डेस्क पर्यवेक्षक",
                    "where": "क्लेम्सन यूनिवर्सिटी",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "डेस्क पर्यवेक्षक",
                    "where": "क्लेम्सन यूनिवर्सिटी",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "तकनीकी कौशल",
            "header1": "प्रोग्रामिंग भाषा",
            "header2": "रूपरेखा और पुस्तकालय",
            "header3": "औजार और प्रौद्योगिकी"
        },
        "services": {
            "title": "मेरी सेवाएं",
            "entries": [
                {
                    "title": "पूर्ण स्टैक इंजीनियरिंग",
                    "text": "मैं पूरे सॉफ्टवेयर स्टैक में सहज एकीकरण और कार्यक्षमता सुनिश्चित करने के लिए फ्रंट-एंड और बैक-एंड दोनों विकास दोनों में व्यापक समाधान प्रदान करता हूं।"
                },
                {
                    "title": "वेब विकास",
                    "text": "HTML, CSS, और JavaScript फ्रेमवर्क जैसे React.js में विशेषज्ञता के साथ, मैं ग्राहकों की विशिष्ट आवश्यकताओं और वरीयताओं को पूरा करने के लिए दृष्टिगत रूप से आकर्षक और उपयोगकर्ता के अनुकूल वेबसाइटों को शिल्प करता हूं।"
                },
                {
                    "title": "खेल विकास",
                    "text": "जावा और सी ++ जैसी भाषाओं का लाभ उठाते हुए, मैं अवधारणा और डिजाइन से लेकर कार्यान्वयन और अनुकूलन तक, आकर्षक गेमप्ले और चिकनी प्रदर्शन सुनिश्चित करने के लिए इमर्सिव गेमिंग अनुभव बनाने में विशेषज्ञता रखता हूं।"
                }
            ]
        }
    },
    "portfolio": {
        "title": "पोर्टफोलियो",
        "filter_by": "फ़िल्टर पोर्टफोलियो द्वारा:",
        "entries": {
            "biblioteca": {
                "title": "बिब्लियोटेका जोंसन",
                "text": "एक पायथन परियोजना जो भाषा अनुवादों को सुव्यवस्थित करती है। मेरी वेबसाइट पोर्टफोलियो को 70+ भाषाओं में अनुवादित करने की अनुमति देता है, जिसमें स्पेनिश, फ्रेंच, चीनी, अरबी और कई अन्य शामिल हैं। इस परियोजना का उपयोग एक बहुभाषी वेबसाइट पोर्टफोलियो बनाने के लिए किया जाता है, जो व्यापक दर्शकों तक पहुंचने के लिए बहुत उपयोगी है। इस परियोजना के साथ, 99% से अधिक दुनिया एक धाराप्रवाह भाषा में मेरे पोर्टफोलियो को पढ़ सकती है।",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "कनेक्ट फोर",
                "text": "कनेक्ट फोर गेम के 50+ से अधिक कार्यान्वयन का विशाल परिवार। इस परियोजना में 30 से अधिक विभिन्न प्रोग्रामिंग भाषाओं में कार्यान्वयन शामिल हैं, जिनमें जावा, सी ++, पायथन, जावास्क्रिप्ट, और बहुत कुछ शामिल हैं। इसके अतिरिक्त, इसमें 20+ से अधिक अलग -अलग फ्रेमवर्क या अन्य प्रारूप भी शामिल हैं, जिनमें React.js, रूबी ऑन रेल, ASP.NET, और बहुत कुछ शामिल हैं।",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "किराने का ऐप",
                "text": "किराने की वस्तुओं के प्रबंधन के लिए एक पूर्ण पूर्ण-स्टैक .NET 9 ब्लेज़र सर्वर एप्लिकेशन। आवेदन दृढ़ता के लिए इकाई फ्रेमवर्क कोर के साथ नियंत्रक/सेवा/रिपॉजिटरी पैटर्न का अनुसरण करता है और इसमें एक व्यापक परीक्षण सूट शामिल है।",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "अंतर -प्रोजेक्ट",
                "text": "एक परियोजना जो विभिन्न प्रोग्रामिंग भाषाओं के बीच अंतर -प्रदर्शन का दस्तावेजीकरण करती है। वर्तमान में 15 अलग -अलग प्रोग्रामिंग भाषाएं और 18 निष्पादन पैटर्न शामिल हैं।",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "इन्वेंट्री रजिस्टर",
                "text": "एक पूर्ण-स्टैक डेमो प्वाइंट ऑफ सेल (पीओएस) इन्वेंट्री प्रबंधन प्रणाली के साथ रजिस्टर कोणीय 17+ और नोड.जे.एस. यह एप्लिकेशन उपयोगकर्ता प्रमाणीकरण, भूमिका-आधारित एक्सेस कंट्रोल, इन्वेंट्री ट्रैकिंग और मॉक पेमेंट प्रोसेसिंग के साथ एक पेशेवर-ग्रेड पीओएस सिस्टम को प्रदर्शित करता है।",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "JSON & YAML ऑटो फॉर्मेटर",
                "text": "JSON और YAML फ़ाइलों के लिए एक Linter और Autoformatter। इस परियोजना का उपयोग JSON और YAML फ़ाइलों को प्रारूपित करने के लिए किया जाता है, जो कोड को साफ और व्यवस्थित रखने के लिए बहुत उपयोगी है। गो के साथ निर्मित, WebAssembly के साथ संकलित, और एक वेबसाइट परियोजना के रूप में मेरे पोर्टफोलियो में एम्बेडेड। भविष्य में आने वाले अधिक प्रारूप।",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "मिनीक्राफ्ट जेएसओएन जनरेटर",
                "text": "Minecraft संसाधन और डेटा पैक के लिए पायथन में निर्मित लाइटवेट JSON जनरेटर। इस परियोजना का उपयोग कस्टम आइटम, ब्लॉक और संस्थाओं सहित Minecraft mods के लिए JSON फ़ाइलों को उत्पन्न करने के लिए किया जाता है। न केवल कस्टम डेटापैक बनाने के लिए बहुत उपयोगी है, बल्कि MOD के साथ -साथ MOD नाम स्विचिंग सुविधा के माध्यम से भी उपयोगी है।",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "मेरा शैक्षिक अनुभव",
                "text": "अपनी व्यक्तिगत परियोजनाओं के साथ, मैंने शैक्षिक अनुभव से कई कौशल भी हासिल किए हैं। अधिक जानकारी के लिए मेरी लिंक्डइन प्रोफाइल देखने के लिए यहां क्लिक करें।",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "मेरा पेशेवर अनुभव",
                "text": "अपनी व्यक्तिगत परियोजनाओं के साथ, मैंने पेशेवर अनुभव से कई कौशल भी हासिल किए हैं। अधिक जानकारी के लिए मेरी लिंक्डइन प्रोफाइल देखने के लिए यहां क्लिक करें।",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "पैट्रिक गुडविन पोर्टफोलियो वेबसाइट",
                "text": "यह वेबसाइट मेरी व्यक्तिगत पोर्टफोलियो वेबसाइट है, जिसे React.js के साथ बनाया गया है। इस परियोजना का उपयोग मेरे कौशल और परियोजनाओं को प्रदर्शित करने के लिए किया जाता है, साथ ही साथ संभावित नियोक्ताओं को मुझसे संपर्क करने के लिए एक मंच प्रदान करने के लिए भी। इस परियोजना का उपयोग एक पेशेवर ऑनलाइन उपस्थिति बनाने के लिए किया जाता है।",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "पैट्रिक की लुआ स्क्रिप्ट लाइब्रेरी",
                "text": "भविष्य के संदर्भ के लिए LUA स्क्रिप्ट का एक उपयोगी पुस्तकालय। इस लाइब्रेरी का उपयोग लुआ स्क्रिप्ट में कार्यों को स्वचालित करने के लिए किया जाता है, जो प्रदर्शन-बेयडी कार्यों के लिए काम आ सकता है, क्योंकि लुआ आमतौर पर पायथन और रूबी दोनों की तुलना में एक तेज स्क्रिप्टिंग भाषा है।",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "पैट्रिक Microsoft Excel स्प्रेडशीट स्क्रिप्ट (VBA)",
                "text": "Microsoft Excel के लिए VBA स्क्रिप्ट का एक उपयोगी लाइब्रेरी। इस लाइब्रेरी का उपयोग एक्सेल स्प्रेडशीट में कार्यों को स्वचालित करने के लिए किया जाता है।",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "पैट्रिक का नेविम कॉन्फ़िगरेशन",
                "text": "मेरा व्यक्तिगत NEOVIM कॉन्फ़िगरेशन। इस परियोजना का उपयोग मेरी पसंद के अनुसार, कस्टम कीबाइंडिंग, थीम और प्लगइन्स सहित नेविम को कॉन्फ़िगर करने के लिए किया जाता है। इस परियोजना का उपयोग मेरे व्यक्तिगत उपयोग के लिए NEOVIM को अधिक उपयोगकर्ता के अनुकूल और कुशल बनाने के लिए किया जाता है।",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "पैट्रिक का नक्शा जनरेटर",
                "text": "एक संयुक्त राज्य काउंटी और राज्य मानचित्र जनरेटर, जो कि जियोपैंडस और मैटप्लोटलिब लाइब्रेरी का उपयोग करके पायथन के साथ बनाया गया है। इस परियोजना का उपयोग काउंटी और राज्य के नक्शे सहित संयुक्त राज्य अमेरिका के नक्शे उत्पन्न करने के लिए किया जाता है। इस परियोजना का उपयोग डेटा विज़ुअलाइज़ेशन और विश्लेषण के लिए कस्टम मानचित्र बनाने के लिए किया जाता है।",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "पैट्रिक की पॉवरशेल स्क्रिप्ट लाइब्रेरी",
                "text": "भविष्य के संदर्भ के लिए PowerShell स्क्रिप्ट का एक उपयोगी पुस्तकालय। $ प्रोफ़ाइल स्क्रिप्ट सुविधा के साथ उपयोगी, मुझे विंडोज टर्मिनल से कार्यों को स्वचालित करने के लिए यह बहुत उपयोगी लगता है, क्योंकि मैं विंडोज ओएस का लगातार उपयोगकर्ता हूं।",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "पैट्रिक रूबी स्क्रिप्ट लाइब्रेरी",
                "text": "भविष्य के संदर्भ के लिए रूबी स्क्रिप्ट का एक उपयोगी पुस्तकालय। रेल विकासात्मक अवधारणाओं पर भविष्य के रूबी के लिए उपयोगी।",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "पीडीएफ कौशल बिल्डर",
                "text": "HTML और JSON फॉर्मेटिंग के साथ, PDFKIT और JINJA2 एक्सटेंशन के माध्यम से पायथन के साथ बनाया गया एक कस्टम पीडीएफ बिल्डर। इस परियोजना का उपयोग कौशल और परियोजनाओं की सूची से पीडीएफ फ़ाइलों को उत्पन्न करने के लिए किया जाता है। इस परियोजना का उपयोग कस्टम पीडीएफ रिज्यूमे बनाने के लिए किया जा सकता है, जो नौकरी के अनुप्रयोगों के लिए बहुत उपयोगी है।",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "रिजांडेल एन्क्रिप्शन प्रोजेक्ट",
                "text": "128, 192 और 256 बिट्स में रिजांडेल एन्क्रिप्शन एल्गोरिथ्म के 10+ कार्यान्वयन का एक परिवार। इस परियोजना का उपयोग विभिन्न प्रोग्रामिंग भाषाओं में रिजांडेल एन्क्रिप्शन एल्गोरिथ्म को प्रदर्शित करने के लिए किया जाता है। इस परियोजना का उपयोग रिजंडेल एन्क्रिप्शन एल्गोरिथ्म के कार्यान्वयन के परिवार को बनाने के लिए किया जाता है।",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "सुप्रेमक माइनक्राफ्ट मॉड",
                "text": "एक Minecraft मॉड जो कस्टम टूल, कवच, मोब, ब्लॉक, आयाम और खेल में कई और सुविधाओं को जोड़ता है। 1.16 और 1.20 के बीच चुनिंदा Minecraft संस्करणों के लिए जावा संस्करण 8-17 के साथ निर्मित।",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "बाघ प्रोग्रामिंग भाषा",
                "text": "दुभाषिया डिजाइन और प्रदर्शन के साथ प्रयोग करने के लिए गो एंड रस्ट दोनों में निर्मित कस्टम प्रोग्रामिंग भाषा। वेब असेंबली का उपयोग करके पोर्टफोलियो वेबसाइट पर लागू किया गया।",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "टाइगर टेलगेटिंग पेशेवरों की वेबसाइट",
                "text": "एक वेबसाइट जिसे मैंने 2024 में टाइगर टेलगेटिंग प्रो के लिए बनाया था, क्लेम्सन, एससी में एक टेलगेटिंग कंपनी। React.js के साथ निर्मित।",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "ट्यूरिंग मशीन प्रोजेक्ट",
                "text": "ट्यूरिंग मशीन के 30 से अधिक कार्यान्वयन का परिवार। अनुसंधान के लिए विभिन्न प्रोग्रामिंग भाषाओं के लिए ट्यूरिंग पूर्णता का प्रदर्शन करने के लिए उपयोग किया जाता है, विशेष रूप से टाइगर प्रोग्रामिंग भाषा के लिए।",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "बाघ प्रोग्रामिंग भाषा"
    },
    "contact": {
        "title": "मुझसे संपर्क करें",
        "header": "संपर्क जानकारी",
        "email": "pattygsocials@gmail.com",
        "description": "मैं ईमेल, लिंक्डइन संदेशों और इंस्टाग्राम मैसेज से पूछताछ का जवाब देता हूं। यदि मेरा नंबर फिर से शुरू होता है या अन्यथा, मैं अपने फोन नंबर को निजी रखना पसंद करता हूं, तो मैं भी वापस कॉल करूंगा।"
    },
    "formatter": {
        "title": "JSON & YAML फॉर्मेटर",
        "description": "JSON & YAML फॉर्मेटर एक उपकरण है जो आपको JSON और YAML फ़ाइलों को प्रारूपित करने की अनुमति देता है। यह GO और WebAssembly के साथ बनाया गया है, और यह तेज और कुशल होने के लिए डिज़ाइन किया गया है। फॉर्मेटर को एक साधारण इंटरफ़ेस के साथ उपयोग करने में आसान होने के लिए डिज़ाइन किया गया है, जो आपको अपने JSON या YAML कोड में पेस्ट करने की अनुमति देता है और इसे एक बटन के क्लिक के साथ प्रारूपित करता है।",
        "more_info1": "अधिक जानकारी के लिए, में Readme का संदर्भ लें",
        "more_info2": "JSON/YAML फॉर्मेटर रिपॉजिटरी।",
        "format_as": "प्रारूप के रूप में:",
        "auto_detect": "ऑटो का पता लगाने",
        "format": "प्रारूप"
    },
    "cube_solver": {
        "title": "रूबिक्स क्यूब सॉल्वर",
        "start": "हल करना"
    },
    "tiger": {
        "title": "टाइगर भाषा",
        "description": "टाइगर प्रोग्रामिंग भाषा एक कस्टम प्रोग्रामिंग भाषा है जो दुभाषिया डिजाइन और प्रदर्शन के साथ प्रयोग करने के लिए गो एंड रस्ट दोनों में बनाई गई है। वेब असेंबली का उपयोग करके पोर्टफोलियो वेबसाइट पर लागू किया गया। टाइगर प्रोग्रामिंग भाषा एक कस्टम प्रोग्रामिंग भाषा है जो दुभाषिया डिजाइन और प्रदर्शन के साथ प्रयोग करने के लिए गो एंड रस्ट दोनों में बनाई गई है। वेब असेंबली का उपयोग करके पोर्टफोलियो वेबसाइट पर लागू किया गया।",
        "more_info1": "अधिक जानकारी के लिए, में Readme का संदर्भ लें",
        "more_info2": "टाइगर प्रोग्रामिंग लैंग्वेज GitHub रिपॉजिटरी।",
        "select_engine": "इंजन का चयन करें:",
        "tiger_code": "टाइगर कोड:",
        "run_tiger": "बाघ चलाना",
        "output": "आउटपुट:"
    },
    "tab": {
        "title": "पैट्रिक गुडविन",
        "description": "सेंट्रल फ्लोरिडा में स्थित फुल स्टैक सॉफ्टवेयर इंजीनियर"
    },
    "copy": {
        "text": "प्रतिलिपि",
        "copied": "कॉपी!"
    },
    "social_media": {
        "github": "GitHub",
        "instagram": "Instagram",
        "linkedin": "Linkedin",
        "tiktok": "टिकटोक",
        "youtube": "YouTube",
        "text_strip": "मेरे पीछे आओ"
    },
    "logotext": "पैट्रिक"
}