{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Dom",
        "about": "O meni",
        "portfolio": "Portfelj",
        "projects": "Projekti web stranica",
        "tiger": "Jezik tigra",
        "formatter": "Json & yaml fortter",
        "cube_solver": "Solver Rubix Cube",
        "contact": "Kontaktirajte me"
    },
    "home": {
        "title": "Dom",
        "animated": {
            "first": "Full Stack Software Inženjer",
            "second": "Web programer",
            "third": "Programer za igre",
            "fourth": "Stvoritelj sadržaja"
        },
        "footer": "Web stranica je sada prevedena i postavljena na 100+ jezika!",
        "descriptionA": "Iskusni softverski inženjer i web programer s punim slojevima s demonstriranom poviješću uspješno vodećih razvojnih projekata, od stvaranja Java modifikacija za Minecraft do poboljšanja korisničkog iskustva u React.JS-u i primjene sigurnih REST API-ja, dok dosljedno koristi agilne metodologije i učinkovitu suradnju tima.",
        "descriptionB": "Uz to, ja sam kreator geografskog sadržaja koji je uspješno iskoristio algoritme više platformi društvenih medija, uključujući Instagram, YouTube i Tiktok, kako bi stekao respektabilnu i privlačnu bazu sljedbenika.",
        "portfolio_button": "Moj portfelj",
        "contact_button": "Kontaktirajte me",
        "about_button": "O meni"
    },
    "about": {
        "title": "O meni",
        "personal_summary": {
            "title": "Osobni sažetak",
            "text": "Kao iskusan programer softvera sa punim snopom sa sjedištem u Orlandu, FL, pokazao sam stručnost u raznim tehnologijama, od Java i C ++ do React.js i Node.js. S zapisnicima o projektima koji su se vodili, uključujući razvoj programa modifikacije Java za Minecraft i korisnu web stranicu za vozače kamiona, predstavio sam vodstvo i inovacije. Moja predanost izvrsnosti vidljivo je u mojoj sposobnosti da pojednostavljujem upravljanje projektima, riješim složene probleme i pružamo visokokvalitetna rješenja koja poboljšavaju korisničko iskustvo i potiču organizacijski uspjeh."
        },
        "professional_experience": {
            "title": "Profesionalno iskustvo",
            "entries": [
                {
                    "jobtitle": "Junior softverski inženjer",
                    "where": "Orion180 osiguranje",
                    "date": "2024. - sadašnjost"
                },
                {
                    "jobtitle": "Osnivač i softver Full Stack",
                    "where": "Suprememc",
                    "date": "2020. - 2024"
                },
                {
                    "jobtitle": "Full Stack Software Inženjer",
                    "where": "Ubrzati učenje",
                    "date": "2023"
                },
                {
                    "jobtitle": "Vodeći programer (studentski program)",
                    "where": "GDI program Sveučilišta Clemson",
                    "date": "2021. - 2022"
                },
                {
                    "jobtitle": "Nadzornik stola",
                    "where": "Sveučilište Clemson",
                    "date": "2021. - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Tehničke vještine",
            "header1": "Programski jezici",
            "header2": "Okviri i knjižnice",
            "header3": "Alati i tehnologije"
        },
        "services": {
            "title": "Moje usluge",
            "entries": [
                {
                    "title": "Full Stack Engineering",
                    "text": "Nudim sveobuhvatna rješenja u razvoju prednjeg i back-end-a, osiguravajući besprijekornu integraciju i funkcionalnost u cijelom softverskom snopu."
                },
                {
                    "title": "Razvijanje web",
                    "text": "S stručnošću u okvirima HTML, CSS i JavaScript poput React.js, izrađujem vizualno privlačne i korisničke web stranice prilagođene zadovoljavanju specifičnih potreba i preferencija klijenata."
                },
                {
                    "title": "Razvoj igre",
                    "text": "Koristeći jezike kao što su Java i C ++, specijalizirao sam se za stvaranje uronjenih igračkih iskustava, od koncepta i dizajna do implementacije i optimizacije, osiguravanja angažiranja igranja i glatkih performansi."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfelj",
        "filter_by": "Filter portfelj od:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca json",
                "text": "Python projekt koji pojednostavljuje jezične prijevode. Omogućuje prevođenje portfelja moje web stranice na 70+ jezika, uključujući španjolski, francuski, kineski, arapski i mnoge druge. Ovaj se projekt koristi za stvaranje višejezičnog portfelja web stranica, što je vrlo korisno za postizanje šire publike. Ovim projektom preko 99% svijeta može pročitati moj portfelj tečnim jezikom.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Spojite četiri",
                "text": "Masivna obitelj od preko 50+ implementacija Connect Four Game. Ovaj projekt uključuje implementacije u preko 30 različitih programskih jezika, uključujući Java, C ++, Python, JavaScript i još mnogo toga. Uz to, uključuje i preko 20+ različitih okvira ili drugih formata, uključujući React.js, Ruby on Rails, ASP.NET i još mnogo toga.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Interop projekt",
                "text": "Projekt koji dokumentira interoperabilnost između različitih programskih jezika. Trenutno uključuje 15 različitih programskih jezika i 18 obrazaca izvršenja.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "JSON & YAML Auto formatter",
                "text": "LINTER & AUTOMORMERTER za datoteke JSON & YAML. Ovaj se projekt koristi za formatiranje JSON & YAML datoteka, što je vrlo korisno za održavanje koda čistog i organiziranog. Izgrađen s GO -om, sastavljenim s Webassembly -om i ugrađen u moj portfelj kao projekt web stranice. Više formata koji dolaze u budućnosti.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON generator",
                "text": "Lagani JSON generator ugrađen u Python za Minecraft resurse i pakete podataka. Ovaj se projekt koristi za generiranje JSON datoteka za Minecraft modove, uključujući prilagođene stavke, blokove i entitete. Vrlo korisno ne samo za stvaranje prilagođenih Datapacks -a, već i za modove putem značajke prebacivanja imena mod.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Moje obrazovno iskustvo",
                "text": "Uz svoje osobne projekte, stekao sam i brojne vještine od obrazovnog iskustva. Kliknite ovdje da biste vidjeli moj LinkedIn profil za više informacija.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Moje profesionalno iskustvo",
                "text": "Pored svojih osobnih projekata, stekao sam i brojne vještine od profesionalnog iskustva. Kliknite ovdje da biste vidjeli moj LinkedIn profil za više informacija.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Web stranica portfelja Patrick Goodwin",
                "text": "Ova web stranica je moja web stranica za osobni portfelj, izgrađena s react.js. Ovaj se projekt koristi za prikazivanje mojih vještina i projekata, kao i za pružanje platforme za potencijalne poslodavce da me kontaktiraju. Ovaj se projekt koristi za stvaranje profesionalne internetske prisutnosti.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patrickova knjižnica skripte Lua",
                "text": "Korisna biblioteka LUA skripta za buduću referencu. Ova se knjižnica koristi za automatizaciju zadataka u LUA skriptama, što može biti korisno za zadatke potrebne performanse, jer je LUA obično brži scenarijski jezik od Pythona i Rubyja.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrickovi skripte proračunske tablice Microsoft Excel (VBA)",
                "text": "Korisna biblioteka VBA skripta za Microsoft Excel. Ova se knjižnica koristi za automatizaciju zadataka u Excel proračunskim tablicama.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Patrickov Neovim config",
                "text": "Moja osobna Neovim konfiguracija. Ovaj se projekt koristi za konfiguriranje Neisima po mojoj želji, uključujući prilagođena ključa, teme i dodatke. Ovaj se projekt koristi kako bi Neovima učinio korisnijim i učinkovitijim za moju osobnu upotrebu.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patrickova generator karte",
                "text": "Generator karata županije i države Sjedinjenih Država, izgrađen s Pythonom koristeći knjižnice Geopandas i Matplotlib. Ovaj se projekt koristi za generiranje karata Sjedinjenih Država, uključujući županijske i državne karte. Ovaj se projekt koristi za stvaranje prilagođenih karata za vizualizaciju i analizu podataka.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patrickova biblioteka skripte PowerShell",
                "text": "Korisna biblioteka PowerShell skripta za buduću referencu. Korisno s značajkom $ profila skripte, smatram da je ovo neizmjerno korisno za automatizaciju zadataka s Windows terminala, jer sam čest korisnik Windows OS -a.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patrickova biblioteka scenarija Ruby",
                "text": "Korisna biblioteka Ruby skripti za buduću referencu. Korisno za budući rubin na razvojnim konceptima.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF Graditelj vještina",
                "text": "Prilagođeni PDF graditelj izgrađen s Python -om preko proširenja PDFKit i Jinja2, uz oblikovanje HTML i JSON. Ovaj se projekt koristi za generiranje PDF datoteka s popisa vještina i projekata. Ovaj se projekt može koristiti za stvaranje prilagođenog životopisa PDF -a, što je vrlo korisno za aplikacije za posao.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Projekt šifriranja Rijandela",
                "text": "Obitelj od 10+ implementacija algoritma za šifriranje Rijandela u 128, 192 i 256 bita. Ovaj se projekt koristi za demonstriranje algoritma šifriranja Rijandela na različitim programskim jezicima. Ovaj se projekt koristi za stvaranje obitelji implementacije algoritma za šifriranje Rijandela.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod",
                "text": "Minecraft mod koji u igru ​​dodaje prilagođene alate, oklop, mafije, blokove, dimenzije i još mnogo značajki. Izgrađena s Java verzijama 8-17 za odabrane verzije Minecraft-a između 1,16 i 1,20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tiger programski jezik",
                "text": "Prilagođeni programski jezik ugrađen u Go & Rust za eksperimentiranje s dizajnom i performansama tumača. Implementirano na web mjestu portfelja pomoću web sastavljanja.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Web stranica Tiger Repging Pros",
                "text": "Web stranica koju sam sagradio 2024. godine za Tiger Tailgating Pros, tvrtku za repnule u Clemsonu, SC. Izgrađen s React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing Machine Project",
                "text": "Obitelj od preko 30+ implementacija Turingovog stroja. Koristi se za pokazivanje cjelovitosti Turinga za različite programijske jezike za istraživanje, posebno za programski jezik tigra.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tiger programski jezik"
    },
    "contact": {
        "title": "Kontaktirajte me",
        "header": "Kontakt podatke",
        "email": "pattygsocials@gmail.com",
        "description": "Odgovaram na upite iz e -pošte, LinkedIn poruka i Instagram poruka. Nazvat ću i ako se moj broj osigura putem životopisa ili na neki drugi način, premda radije držim svoj telefonski broj privatnim."
    },
    "formatter": {
        "title": "Json & yaml fortter",
        "description": "JSON & YAML Fortter je alat koji vam omogućuje formatiranje JSON i YAML datoteka. Izgrađen je s Go i Webassembly -om, a dizajniran je tako da bude brz i učinkovit. Formter je dizajniran tako da bude jednostavan za upotrebu, s jednostavnim sučeljem koje vam omogućuje zalijepiti u svoj JSON ili YAML kôd i formatirati ga klikom na gumb.",
        "more_info1": "Za više informacija pogledajte ReadMe u",
        "more_info2": "JSON/YAML FORFORTER SPOZITORIJA.",
        "format_as": "Format kao:",
        "auto_detect": "Automatsko otkrivanje",
        "format": "Format"
    },
    "cube_solver": {
        "title": "Solver Rubix Cube",
        "solve": "Riješiti"
    },
    "tiger": {
        "title": "Jezik tigra",
        "description": "Tiger programski jezik je prilagođeni programski jezik izgrađen i u Go & Rust kako bi eksperimentirao s dizajnom i performansama tumača. Implementirano na web mjestu portfelja pomoću web sastavljanja. Tiger programski jezik je prilagođeni programski jezik izgrađen i u Go & Rust kako bi eksperimentirao s dizajnom i performansama tumača. Implementirano na web mjestu portfelja pomoću web sastavljanja.",
        "more_info1": "Za više informacija pogledajte ReadMe u",
        "more_info2": "Tiger Programski jezik GitHub spremište.",
        "select_engine": "Odaberite motor:",
        "tiger_code": "Tiger kod:",
        "run_tiger": "Trčati tigar",
        "output": "Izlaz:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Full Stack softverski inženjer sa sjedištem u središnjoj Floridi"
    },
    "copy": {
        "text": "Kopirati",
        "copied": "Kopirano!"
    },
    "social_media": {
        "github": "Ždrijeb",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Slijedite me"
    },
    "logotext": "Patrick"
}