{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Lakay",
        "about": "Sou mwen",
        "portfolio": "Dosye",
        "tiger": "Lang tig",
        "contact": "Kontakte mwen"
    },
    "home": {
        "title": "Lakay",
        "animated": {
            "first": "Full Engineer Software Stack",
            "second": "Developer entènèt",
            "third": "Pwomotè jwèt",
            "fourth": "Kreyatè kontni"
        },
        "descriptionA": "Ki gen eksperyans plen-chemine enjenyè lojisyèl & pwomotè entènèt ak yon istwa demontre nan pwojè devlopman siksè ki mennen, ki soti nan kreye modifikasyon Java pou Minecraft amelyore eksperyans itilizatè nan react.js ak mete ann aplikasyon APIs sekirite REST, pandan y ap toujou anplwaye metodoloji ajil ak kolaborasyon ekip efikas.",
        "descriptionB": "Anplis de sa, mwen se yon kreyatè kontni jewografi ki te avèk siksè exploitées algoritm yo nan plizyè tribin medya sosyal, ki gen ladan Instagram, YouTube, ak Tiktok, jwenn yon baz respektab ak angaje.",
        "portfolio_button": "Pòtfolyo mwen an",
        "contact_button": "Kontakte mwen",
        "about_button": "Sou mwen"
    },
    "about": {
        "title": "Sou mwen",
        "personal_summary": {
            "title": "Rezime pèsonèl",
            "text": "Kòm yon pwomotè ki gen eksperyans plen lojisyèl chemine ki baze nan Orlando, FL, mwen te demontre ekspètiz nan divès teknoloji, ki soti nan Java ak C ++ react.js ak Node.js. Avèk yon dosye track nan pwojè dirijan, ki gen ladan devlopman nan yon pwogram modifikasyon Java pou Minecraft ak yon sit entènèt rekonpanse pou chofè kamyon, mwen te prezante lidèchip ak inovasyon. Angajman mwen nan ekselans se evidan nan kapasite mwen nan rasyonalize jesyon pwojè, rezoud pwoblèm konplèks, ak delivre solisyon-wo kalite ki amelyore eksperyans itilizatè ak kondwi siksè òganizasyonèl."
        },
        "professional_experience": {
            "title": "Eksperyans pwofesyonèl",
            "entries": [
                {
                    "jobtitle": "Junior Software Engineer",
                    "where": "Orion180 Asirans",
                    "date": "2024 - Prezante"
                },
                {
                    "jobtitle": "Fondatè & Full Stack Software Developer",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Full Engineer Software Stack",
                    "where": "Akselere Aprantisaj",
                    "date": "2023"
                },
                {
                    "jobtitle": "Plon Developer Web (Pwogram Elèv)",
                    "where": "Clemson University GDI Pwogram",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Sipèvizè biwo",
                    "where": "Clemson University",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Ladrès teknik",
            "header1": "Lang pwogramasyon",
            "header2": "FrameWorks & Bibliyotèk",
            "header3": "Zouti ak teknoloji"
        },
        "services": {
            "title": "Sèvis mwen yo",
            "entries": [
                {
                    "title": "Jeni plen chemine",
                    "text": "Mwen ofri solisyon konplè atravè tou de devan-fen ak back-end devlopman, asire entegrasyon san pwoblèm ak fonctionnalités nan tout chemine a lojisyèl tout antye."
                },
                {
                    "title": "Devlopman entènèt",
                    "text": "Avèk ekspètiz nan HTML, CSS, ak JavaScript fondasyon tankou react.js, mwen navèt vizyèlman apèl ak user-zanmitay sit entènèt pwepare satisfè bezwen espesifik kliyan yo ak preferans."
                },
                {
                    "title": "Devlopman jwèt",
                    "text": "Swe lang tankou Java ak C ++, mwen espesyalize nan kreye eksperyans Gaming Immersion, ki soti nan konsèp ak konsepsyon nan aplikasyon ak optimize, asire angaje jeu ak pèfòmans lis."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Dosye",
        "filter_by": "Filtre pòtfolyo pa:",
        "entries": {
            "connect_four": {
                "title": "Konekte kat",
                "text": "Fanmi masiv ki gen plis pase 50+ en nan jwèt la Connect kat. Pwojè sa a gen ladan en nan plis pase 30 lang pwogramasyon diferan, ki gen ladan Java, C ++, Piton, JavaScript, ak plis ankò. Anplis de sa, li gen ladan tou plis pase 20+ estrikti diferan oswa lòt fòma, ki gen ladan react.js, Ruby sou ray, asp.net, ak plis ankò.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Pwojè Interop",
                "text": "Yon pwojè ki dokimante enteroperabilite ant diferan lang pwogramasyon. Kounye a gen ladan 15 diferan lang pwogramasyon ak 18 modèl ekzekisyon.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "excel_scripts": {
                "title": "Microsoft Excel Scripts calcul (VBA)",
                "text": "Yon bibliyotèk itil nan VBA Scripts pou Microsoft Excel. Se bibliyotèk sa a itilize otomatize travay nan tableur Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON dèlko",
                "text": "Lejè JSON dèlko bati nan Python pou Minecraft Resous & Done pake. Pwojè sa a itilize pou jenere dosye JSON pou mods Minecraft, ki gen ladan atik koutim, blòk, ak antite. Trè itil pou pa sèlman kreye datapacks koutim, men pou mods kòm byen atravè karakteristik nan oblije chanje non mod.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Eksperyans edikasyon mwen an",
                "text": "Ansanm ak pwojè pèsonèl mwen, mwen te akeri tou anpil ladrès nan eksperyans edikasyon. Klike la a pou wè pwofil LinkedIn mwen an pou plis enfòmasyon.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Eksperyans pwofesyonèl mwen an",
                "text": "Ansanm ak pwojè pèsonèl mwen, mwen te tou te akeri anpil ladrès nan eksperyans pwofesyonèl. Klike la a pou wè pwofil LinkedIn mwen an pou plis enfòmasyon.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Goodwin Pòtfolyo Sit wèb",
                "text": "Sit entènèt sa a se sit entènèt pèsonèl mwen pòtfolyo, bati ak react.js. Pwojè sa a itilize pou montre konpetans mwen yo ak pwojè yo, osi byen ke pou bay yon platfòm pou potansyèl anplwayè yo kontakte mwen. Pwojè sa a itilize pou kreye yon prezans pwofesyonèl sou entènèt.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Bibliyotèk Lua Lua Patrick la",
                "text": "Yon bibliyotèk itil nan Lua Scripts pou referans nan lavni. Se bibliyotèk sa a itilize otomatize travay nan Lua Scripts, ki ka vini an sou la men pou pèfòmans-moun ki nan bezwen travay, kòm Lua se nòmalman yon pi vit lang scripting pase tou de Piton ak Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "neovim_config": {
                "title": "Patrick a neovim config",
                "text": "Konfigirasyon pèsonèl mwen Neovim. Se pwojè sa a itilize nan konfigirasyon Neovim senpati mwen, ki gen ladan KeyBindings koutim, tèm, ak grefon. Pwojè sa a itilize pou fè Neovim plis user-zanmitay ak efikas pou itilizasyon pèsonèl mwen.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Kat dèlko Patrick la",
                "text": "Yon dèlko kat jeyografik Konte & Eta Etazini, ki te bati ak Piton lè l sèvi avèk bibliyotèk yo Geopandas ak Matplotlib. Pwojè sa a itilize pou jenere kat Etazini, ki gen ladan kat konte ak eta. Pwojè sa a itilize pou kreye kat koutim pou vizyalizasyon done ak analiz.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Bibliyotèk script PowerShell Patrick la",
                "text": "Yon bibliyotèk itil nan Scripts poechèl pou referans nan lavni. Itil ak karakteristik nan script $ pwofil, mwen jwenn sa a ekstrèmman itil pou otomatize travay soti nan Tèminal la Windows, menm jan mwen se yon itilizatè souvan nan Windows OS la.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Ruby bibliyotèk Patrick a",
                "text": "Yon bibliyotèk itil nan Scripts Ruby pou referans nan lavni. Itil pou lavni Ruby sou konsèp devlopman ray.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF Ladrès Builder",
                "text": "Yon mason PDF koutim bati ak Python via ekstansyon yo PDFKIT ak Jinja2, ansanm ak HTML ak JSON fòma. Pwojè sa a itilize pou jenere dosye PDF nan yon lis ladrès ak pwojè. Pwojè sa a ka itilize yo kreye yon koutim PDF rezime, ki se trè itil pou aplikasyon pou travay.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Pwojè chifreman Rijandel",
                "text": "Yon fanmi ki gen 10+ en nan algorithm nan chifreman Rijandel nan 128, 192, ak 256 Bits. Pwojè sa a itilize pou demontre algorithm nan chifreman Rijandel nan diferan lang pwogramasyon. Pwojè sa a itilize pou kreye yon fanmi nan en nan algorithm nan chifreman Rijandel.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod",
                "text": "Yon mod Minecraft ki ajoute zouti koutim, zam, foul, blòk, dimansyon, ak anpil plis karakteristik nan jwèt la. Bati ak Java vèsyon 8-17 pou chwazi vèsyon Minecraft ant 1.16 ak 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Lang pwogramasyon tig",
                "text": "Lang pwogramasyon koutim bati nan tou de ale & rouye fè eksperyans ak konsepsyon entèprèt ak pèfòmans. Aplike sou sit entènèt la pòtfolyo lè l sèvi avèk asanble entènèt.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger Tailgating Pros Sit wèb",
                "text": "Yon sit entènèt mwen bati nan 2024 pou Tiger Tailgating avantaj, yon konpayi tailgating nan Clemson, SC. Bati ak react.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing Pwojè Machine",
                "text": "Fanmi ki gen plis pase 30+ en nan machin nan Turing. Itilize yo demontre Turing konplè pou lang pwogramasyon diferan pou rechèch, espesyalman pou lang nan pwogramasyon Tiger.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Lang pwogramasyon tig"
    },
    "contact": {
        "title": "Kontakte mwen",
        "header": "Enfòmasyon pou kontakte",
        "email": "pattygsocials@gmail.com",
        "description": "Mwen reponn a mande nan imèl, mesaj LinkedIn, ak mesaj Instagram. Mwen menm tou mwen pral rele tounen si se nimewo mwen bay atravè rezime oswa otreman, menm si mwen pito kenbe nimewo telefòn mwen prive."
    },
    "tiger": {
        "title": "Lang tig",
        "description": "Lang nan pwogramasyon Tiger se yon langaj pwogramasyon koutim bati nan tou de ale & rouye fè eksperyans ak konsepsyon entèprèt ak pèfòmans. Aplike sou sit entènèt la pòtfolyo lè l sèvi avèk asanble entènèt. Lang nan pwogramasyon Tiger se yon langaj pwogramasyon koutim bati nan tou de ale & rouye fè eksperyans ak konsepsyon entèprèt ak pèfòmans. Aplike sou sit entènèt la pòtfolyo lè l sèvi avèk asanble entènèt.",
        "more_info1": "Pou plis enfòmasyon, gade nan Readme a nan la",
        "more_info2": "Tiger Programming Language Github Repository.",
        "select_engine": "Chwazi motè:",
        "tiger_code": "Kòd Tiger:",
        "run_tiger": "Kouri tig",
        "output": "Sòti:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Full Stack Engineer Software ki baze nan Central Florid"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "Lye",
        "tiktok": "Tiktok",
        "youtube": "Youtube",
        "text_strip": "Swiv mwen"
    },
    "logotext": "Patrick"
}