{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Otthon",
        "about": "Rólam",
        "portfolio": "Portfólió",
        "projects": "Weboldal -projektek",
        "tiger": "Tigrisnyelv",
        "formatter": "JSON & YAML FORMATTER",
        "cube_solver": "Rubix Cube -megoldó",
        "contact": "Vegye fel a kapcsolatot velem"
    },
    "home": {
        "title": "Otthon",
        "animated": {
            "first": "Teljes verem szoftvermérnök",
            "second": "Webfejlesztő",
            "third": "Játékfejlesztő",
            "fourth": "Tartalomkészítő"
        },
        "footer": "A weboldal most lefordítva és Avalable 100+ nyelven!",
        "descriptionA": "Tapasztalt teljes verem szoftvermérnök és webfejlesztő, amelynek bizonyított története sikeresen vezet a fejlesztési projektekhez, a Java módosítások létrehozásától a Minecraft számára a React.JS felhasználói élményének javításáig és a biztonságos REST API-k megvalósításáig, miközben következetesen alkalmazzák agilis módszertanokat és hatékony csapat-együttműködést.",
        "descriptionB": "Ezenkívül földrajzi tartalom -készítő vagyok, aki sikeresen kihasználta a több közösségi média platformjainak, köztük az Instagram, a YouTube és a Tiktok algoritmusait, hogy tiszteletreméltó és vonzó követő bázist szerezzen.",
        "portfolio_button": "A portfólióm",
        "contact_button": "Vegye fel a kapcsolatot velem",
        "about_button": "Rólam"
    },
    "about": {
        "title": "Rólam",
        "personal_summary": {
            "title": "Személyes összefoglaló",
            "text": "Mint tapasztalt, teljes verem szoftverfejlesztő, Orlando, Florida székhellyel, különféle technológiákban mutattam be szakértelmet, a Java -tól és a C ++ -tól a React.js és a Node.js. A vezetési projektek eredményeivel, ideértve a Minecraft Java módosítási programjának kidolgozását és a teherautó -sofőrök számára nyújtott weboldalt, bemutattam a vezetést és az innovációt. A kiválóság iránti elkötelezettségem nyilvánvaló az a képességem, hogy korszerűsítsem a projektmenedzsmentet, megoldja a komplex problémákat, és kiváló minőségű megoldásokat biztosítson, amelyek javítják a felhasználói élményt és elősegítem a szervezeti sikert."
        },
        "professional_experience": {
            "title": "Szakmai tapasztalat",
            "entries": [
                {
                    "jobtitle": "Junior szoftvermérnök",
                    "where": "ORION180 Biztosítás",
                    "date": "2024 - Jelenleg"
                },
                {
                    "jobtitle": "Alapító és teljes verem szoftverfejlesztő",
                    "where": "Supremem",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Teljes verem szoftvermérnök",
                    "where": "Felgyorsítja a tanulást",
                    "date": "2023"
                },
                {
                    "jobtitle": "Vezető webfejlesztő (hallgatói program)",
                    "where": "Clemson University GDI program",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Íróasztal -felügyelő",
                    "where": "Clemson Egyetem",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Íróasztal -felügyelő",
                    "where": "Clemson Egyetem",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Műszaki készségek",
            "header1": "Programozási nyelvek",
            "header2": "Keretek és könyvtárak",
            "header3": "Eszközök és technológiák"
        },
        "services": {
            "title": "Szolgáltatásaim",
            "entries": [
                {
                    "title": "Teljes verem tervezés",
                    "text": "Átfogó megoldásokat kínálok mind a front-end, mind a back-end fejlesztés során, biztosítva a zökkenőmentes integrációt és a funkcionalitást az egész szoftvercsomagban."
                },
                {
                    "title": "Webfejlesztés",
                    "text": "A HTML, a CSS és a JavaScript keretekkel, például a React.js szakértelmével látványos és felhasználóbarát webhelyeket készítek, amelyek az ügyfelek sajátos igényeinek és preferenciáinak kielégítésére készültek."
                },
                {
                    "title": "Játékfejlesztés",
                    "text": "Az olyan nyelvek, mint a Java és a C ++ kiaknázása, a magával ragadó játékélmények megteremtésére szakosodtam, a koncepciótól és a tervezéstől a megvalósításig és az optimalizálásig, biztosítva a játékot és a zökkenőmentes teljesítményt."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfólió",
        "filter_by": "Szűrőportfólió:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca JSON",
                "text": "Egy Python projekt, amely ésszerűsíti a nyelvi fordításokat. Lehetővé teszi a webhelyem portfóliójának 70 nyelvre történő lefordítását, beleértve a spanyol, francia, kínai, arab és még sokan másokat. Ez a projekt egy többnyelvű weboldal -portfólió létrehozására szolgál, amely nagyon hasznos a szélesebb közönség eléréséhez. Ezzel a projekttel a világ több mint 99% -a folyékony nyelven tudja elolvasni a portfóliómat.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Csatlakoztassa a négyet",
                "text": "A Connect Four Game több mint 50 több mint 50 megvalósítású családja. Ez a projekt magában foglalja a több mint 30 különböző programozási nyelv megvalósítását, beleértve a Java, a C ++, a Python, a JavaScript és még sok más. Ezenkívül több mint 20 különböző keretet vagy más formátumot is tartalmaz, beleértve a React.js -t, a Ruby on Rails -t, az ASP.NET -et és még sok más.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "Élelmiszerbolt",
                "text": "Teljes teljes verem .NET 9 Blazor Server alkalmazás élelmiszerboltelemek kezelésére. Az alkalmazás követi a vezérlő/szolgáltatás/lerakat mintázatát az entitás keretrendszerével a kitartáshoz, és magában foglalja az átfogó tesztcsomagot.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Interop projekt",
                "text": "Egy olyan projekt, amely dokumentálja a különböző programozási nyelvek közötti interoperabilitást. Jelenleg 15 különféle programozási nyelvet és 18 végrehajtási mintát tartalmaz.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Leltárregiszter",
                "text": "A teljes halom demo értékesítési pont (POS) regiszter a 17+ és a Node.js. Ez az alkalmazás bemutatja a professzionális fokú POS rendszert a felhasználói hitelesítéssel, a szerep-alapú hozzáférés-vezérléssel, a készletkövetéssel és a fizetés feldolgozásával.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "JSON & YAML Auto Formatter",
                "text": "Linter & AutooMatter a JSON & YAML fájlokhoz. Ez a projekt a JSON & YAML fájlok formázására szolgál, ami nagyon hasznos a kód tiszta és szervezett tartásában. Go -val épített, összeállított WebAssembly -vel, és beágyazva a portfóliómba weboldal -projektként. Több formátum érkezik a jövőben.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON generátor",
                "text": "Könnyű JSON generátor, amelyet Python -ban építettek a Minecraft Resource & Data Packs -hez. Ezt a projektet JSON fájlok generálására használják a Minecraft modokhoz, beleértve az egyedi elemeket, blokkokat és entitásokat. Nagyon hasznos nemcsak az egyedi adatlapok létrehozásához, hanem a MOD -khoz is a MOD névváltó funkción keresztül.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Oktatási tapasztalataim",
                "text": "Személyes projektjeim mellett számos készséget is megszereztem az oktatási tapasztalatokból. Kattintson ide a LinkedIn profilom megtekintéséhez további információkért.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Szakmai tapasztalataim",
                "text": "Személyes projektjeim mellett számos készséget is megszereztem a szakmai tapasztalatokból. Kattintson ide a LinkedIn profilom megtekintéséhez további információkért.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Goodwin Portfolio weboldala",
                "text": "Ez a weboldal a személyes portfólió weboldalam, amelyet a React.js -vel készítettek. Ez a projekt arra szolgál, hogy bemutassa képességeimet és projektjeimet, valamint platformot biztosítson a potenciális munkáltatók számára, hogy kapcsolatba léphessenek velem. Ezt a projektet professzionális online jelenlét létrehozására használják.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patrick Lua Script Library",
                "text": "A Lua szkriptek hasznos könyvtára a későbbi referenciaként. Ezt a könyvtárat a LUA szkriptek feladatainak automatizálására használják, amelyek hasznosak lehetnek a teljesítmény-szükséges feladatokhoz, mivel a LUA általában gyorsabb szkriptnyelv, mint mind a Python, mind a Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrick Microsoft Excel Spreadsheet Scripts (VBA)",
                "text": "A VBA szkriptek hasznos könyvtára a Microsoft Excel számára. Ezt a könyvtárat az Excel táblázatokban a feladatok automatizálására használják.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Patrick Neovim konfigurációja",
                "text": "A személyes Neovim konfigurációm. Ez a projekt a Neovim konfigurálására szolgál, beleértve az egyedi kulcskulcsokat, témákat és beépülő modulokat. Ezt a projektet arra használják, hogy a Neovim felhasználóbarátabbá és hatékonyabbá tegye személyes használatomat.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patrick térképgenerátora",
                "text": "Az Egyesült Államok megyei és állami térképgenerátora, amelyet Pythonnal építettek a Geopandas és a Matplotlib könyvtárak felhasználásával. Ezt a projektet az Egyesült Államok térképeinek előállítására használják, beleértve a megyei és az állami térképeket. Ez a projekt egyéni térképek létrehozására szolgál az adatok megjelenítéséhez és elemzéséhez.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patrick's PowerShell Script Library",
                "text": "Hasznos PowerShell -szkriptek Hasznos könyvtára a jövőbeni referenciaként. Hasznos a $ profil szkript funkcióval, ez rendkívül hasznosnak tartom a Windows terminálból származó feladatok automatizálását, mivel én vagyok a Windows operációs rendszer gyakori felhasználója.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patrick's Ruby Script Library",
                "text": "Hasznos könyvtár a Ruby szkriptekről a későbbi referenciaként. Hasznos a jövőbeli Ruby on Rails fejlesztési koncepciókhoz.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF készségek készítője",
                "text": "Egy egyedi PDF -készítő, amelyet Pythonnal építettek a PDFKIT és a JINJA2 kiterjesztéseken keresztül, a HTML és a JSON formázása mellett. Ezt a projektet PDF fájlok előállítására használják a készségek és projektek listájából. Ez a projekt felhasználható egy egyedi PDF -önéletrajz létrehozására, amely nagyon hasznos a munkaköröknél.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandel titkosítási projekt",
                "text": "A Rijandel titkosítási algoritmus 10+ megvalósításának családja 128, 192 és 256 bit. Ezt a projektet a Rijandel titkosítási algoritmus bemutatására használják a különböző programozási nyelveken. Ez a projekt a Rijandel titkosítási algoritmus megvalósításának családjának létrehozására szolgál.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft mod",
                "text": "Egy Minecraft mod, amely egyedi eszközöket, páncélokat, mobokat, blokkokat, méreteket és még sok más funkciót ad hozzá a játékhoz. Java 8-17 verzióval építették a kiválasztott Minecraft verziókhoz 1,16 és 1.20 között.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tigrisprogramozási nyelv",
                "text": "Az egyéni programozási nyelv, amely mind a Go, mind a Rust beépített, a tolmács tervezésével és a teljesítményével kísérletezve. A Portfolio weboldalán, a Web Assembly használatával valósítva meg.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tigris hátsó gardéző profik weboldala",
                "text": "Egy olyan weboldal, amelyet 2024 -ben építettek a Tiger Tailgating Pros -hoz, egy farokkapocs -társasághoz, Clemson, SC. A react.js -vel építették.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing Machine projekt",
                "text": "A Turing Machine több mint 30 -as megvalósításának családja. A Turing teljességének bemutatására szolgál a különféle kutatási nyelvek számára, különösen a tigris programozási nyelv számára.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tigrisprogramozási nyelv"
    },
    "contact": {
        "title": "Vegye fel a kapcsolatot velem",
        "header": "Kapcsolattartási adatok",
        "email": "pattygsocials@gmail.com",
        "description": "Válaszolok az e -mail, a LinkedIn üzenetek és az Instagram üzenetek kérdéseire. Azt is vissza fogom hívni, ha a számomat önéletrajzon vagy más módon adják meg, bár inkább a telefonszámomat privátnak tartom."
    },
    "formatter": {
        "title": "JSON & YAML FORMATTER",
        "description": "A JSON & YAML Formatter egy olyan eszköz, amely lehetővé teszi a JSON és a YAML fájlok formázását. A GO és a WebAssembly segítségével épült, és úgy tervezték, hogy gyors és hatékony legyen. A formázót úgy tervezték, hogy könnyen használható legyen, egy egyszerű felületgel, amely lehetővé teszi a JSON vagy a YAML kód beillesztését, és egy gomb kattintással formázni.",
        "more_info1": "További információkért lásd a ReadMe -t a",
        "more_info2": "JSON/YAML FORMATTER ROAZTORY.",
        "format_as": "Formátum, mint:",
        "auto_detect": "Auto detektál",
        "format": "Formátum"
    },
    "cube_solver": {
        "title": "Rubix Cube -megoldó",
        "start": "Megold"
    },
    "tiger": {
        "title": "Tigrisnyelv",
        "description": "A tigrisprogramozási nyelv egy egyedi programozási nyelv, amely mind a Go, mind a Rust beépítésére épül, hogy kísérletezzen a tolmács tervezésével és a teljesítménygel. A Portfolio weboldalán, a Web Assembly használatával valósítva meg. A tigrisprogramozási nyelv egy egyedi programozási nyelv, amely mind a Go, mind a Rust beépítésére épül, hogy kísérletezzen a tolmács tervezésével és a teljesítménygel. A Portfolio weboldalán, a Web Assembly használatával valósítva meg.",
        "more_info1": "További információkért lásd a ReadMe -t a",
        "more_info2": "Tigrisprogramozási nyelv GitHub lerakat.",
        "select_engine": "Válassza ki a motort:",
        "tiger_code": "Tigriskód:",
        "run_tiger": "Tigrisfutás",
        "output": "Kimenet:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Teljes verem szoftvermérnök Közép -Floridában található"
    },
    "copy": {
        "text": "Másolat",
        "copied": "Másolt!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Kövess engem"
    },
    "logotext": "Patrick"
}