{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Rumah",
        "about": "Tentang saya",
        "portfolio": "Portofolio",
        "projects": "Proyek situs web",
        "tiger": "Bahasa harimau",
        "formatter": "Embara json & yaml",
        "cube_solver": "Pemecah Kubus Rubix",
        "contact": "Hubungi saya"
    },
    "home": {
        "title": "Rumah",
        "animated": {
            "first": "Insinyur Perangkat Lunak Tumpukan Penuh",
            "second": "Pengembang web",
            "third": "Pengembang game",
            "fourth": "Pembuat konten"
        },
        "footer": "Situs web sekarang diterjemahkan & tersedia dalam 100+ bahasa!",
        "descriptionA": "Insinyur perangkat lunak full-stack yang berpengalaman dengan pengembang web dengan sejarah proyek pengembangan yang berhasil memimpin, mulai dari menciptakan modifikasi Java untuk Minecraft hingga meningkatkan pengalaman pengguna dalam react.js dan menerapkan API istirahat yang aman, sementara secara konsisten menggunakan metodologi gesit dan kolaborasi tim yang efektif.",
        "descriptionB": "Selain itu, saya seorang pencipta konten geografi yang telah berhasil memanfaatkan algoritma dari berbagai platform media sosial, termasuk Instagram, YouTube, dan Tiktok, untuk mendapatkan basis pengikut yang terhormat dan menarik.",
        "portfolio_button": "Portofolio saya",
        "contact_button": "Hubungi saya",
        "about_button": "Tentang saya"
    },
    "about": {
        "title": "Tentang saya",
        "personal_summary": {
            "title": "Ringkasan Pribadi",
            "text": "Sebagai pengembang perangkat lunak tumpukan penuh yang berbasis di Orlando, FL, saya telah menunjukkan keahlian dalam berbagai teknologi, dari Java dan C ++ hingga React.js dan Node.js. Dengan rekam jejak proyek ujung tombak, termasuk pengembangan program modifikasi Java untuk Minecraft dan situs web yang bermanfaat untuk pengemudi truk, saya telah memamerkan kepemimpinan dan inovasi. Komitmen saya terhadap keunggulan terbukti dalam kemampuan saya untuk merampingkan manajemen proyek, menyelesaikan masalah yang kompleks, dan memberikan solusi berkualitas tinggi yang meningkatkan pengalaman pengguna dan mendorong keberhasilan organisasi."
        },
        "professional_experience": {
            "title": "Pengalaman profesional",
            "entries": [
                {
                    "jobtitle": "Junior Software Engineer",
                    "where": "Asuransi Orion180",
                    "date": "2024 - Hadir"
                },
                {
                    "jobtitle": "Pengembang Perangkat Lunak Pendiri & Tumpukan Penuh",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Insinyur Perangkat Lunak Tumpukan Penuh",
                    "where": "Mempercepat pembelajaran",
                    "date": "2023"
                },
                {
                    "jobtitle": "Pimpinan Web Developer (Program Mahasiswa)",
                    "where": "Program GDI Universitas Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Pengawas meja",
                    "where": "Universitas Clemson",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Keterampilan teknis",
            "header1": "Bahasa pemrograman",
            "header2": "Kerangka & Perpustakaan",
            "header3": "Alat & Teknologi"
        },
        "services": {
            "title": "Layanan saya",
            "entries": [
                {
                    "title": "Teknik Tumpukan Penuh",
                    "text": "Saya menawarkan solusi komprehensif di kedua pengembangan front-end dan back-end, memastikan integrasi dan fungsionalitas yang mulus di seluruh tumpukan perangkat lunak."
                },
                {
                    "title": "Pengembangan Web",
                    "text": "Dengan keahlian dalam kerangka kerja HTML, CSS, dan JavaScript seperti React.js, saya membuat situs web yang menarik secara visual dan ramah pengguna yang disesuaikan untuk memenuhi kebutuhan dan preferensi spesifik klien."
                },
                {
                    "title": "Pengembangan game",
                    "text": "Memanfaatkan bahasa seperti Java dan C ++, saya berspesialisasi dalam menciptakan pengalaman bermain game yang mendalam, dari konsep dan desain hingga implementasi dan optimasi, memastikan gameplay yang melibatkan dan kinerja yang lancar."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portofolio",
        "filter_by": "Portofolio Filter Oleh:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca Json",
                "text": "Proyek Python yang merampingkan terjemahan bahasa. Memungkinkan portofolio situs web saya diterjemahkan ke dalam 70+ bahasa, termasuk Spanyol, Prancis, Cina, Arab, dan banyak lainnya. Proyek ini digunakan untuk membuat portofolio situs web multibahasa, yang sangat berguna untuk menjangkau audiens yang lebih luas. Dengan proyek ini, lebih dari 99% dunia dapat membaca portofolio saya dalam bahasa yang lancar.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Hubungkan empat",
                "text": "Keluarga besar dari lebih dari 50+ implementasi game Connect Four. Proyek ini mencakup implementasi dalam lebih dari 30 bahasa pemrograman yang berbeda, termasuk Java, C ++, Python, JavaScript, dan banyak lagi. Selain itu, ini juga mencakup lebih dari 20+ kerangka kerja yang berbeda atau format lain, termasuk react.js, ruby ​​on rails, asp.net, dan banyak lagi.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Proyek interop",
                "text": "Sebuah proyek yang mendokumentasikan interoperabilitas antara berbagai bahasa pemrograman. Saat ini mencakup 15 bahasa pemrograman yang berbeda dan 18 pola eksekusi.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "Formatter otomatis JSON & YAML",
                "text": "Linter & Autoformatter untuk file JSON & YAML. Proyek ini digunakan untuk memformat file JSON & YAML, yang sangat berguna untuk menjaga kode tetap bersih dan terorganisir. Dibangun dengan Go, disusun dengan WebAssembly, dan tertanam dalam portofolio saya sebagai proyek situs web. Lebih banyak format yang akan datang di masa depan.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON Generator",
                "text": "Generator JSON ringan dibangun di Python untuk Paket Sumber Daya & Data Minecraft. Proyek ini digunakan untuk menghasilkan file JSON untuk mod Minecraft, termasuk item khusus, blok, dan entitas. Sangat berguna untuk tidak hanya membuat data kustom, tetapi juga untuk mod melalui fitur switching nama mod.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Pengalaman pendidikan saya",
                "text": "Bersamaan dengan proyek pribadi saya, saya juga telah memperoleh banyak keterampilan dari pengalaman pendidikan. Klik di sini untuk melihat profil LinkedIn saya untuk informasi lebih lanjut.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Pengalaman profesional saya",
                "text": "Bersamaan dengan proyek pribadi saya, saya juga telah memperoleh banyak keterampilan dari pengalaman profesional. Klik di sini untuk melihat profil LinkedIn saya untuk informasi lebih lanjut.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Situs portofolio Patrick Goodwin",
                "text": "Situs web ini adalah situs web portofolio pribadi saya, dibangun dengan react.js. Proyek ini digunakan untuk menunjukkan keterampilan dan proyek saya, serta untuk menyediakan platform bagi calon pemberi kerja untuk menghubungi saya. Proyek ini digunakan untuk membuat kehadiran online profesional.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Perpustakaan Script Lua Patrick",
                "text": "Perpustakaan yang berguna dari skrip LUA untuk referensi di masa mendatang. Perpustakaan ini digunakan untuk mengotomatiskan tugas-tugas dalam skrip LUA, yang dapat berguna untuk tugas yang membutuhkan kinerja, karena Lua biasanya merupakan bahasa skrip yang lebih cepat daripada Python dan Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrick's Microsoft Excel Spreadsheet Script (VBA)",
                "text": "Perpustakaan yang berguna dari skrip VBA untuk Microsoft Excel. Perpustakaan ini digunakan untuk mengotomatiskan tugas -tugas dalam spreadsheet Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Konfigurasi Neovim Patrick",
                "text": "Konfigurasi Neovim pribadi saya. Proyek ini digunakan untuk mengonfigurasi Neovim sesuai keinginan saya, termasuk binting, tema, dan plugin kustom. Proyek ini digunakan untuk membuat Neovim lebih ramah pengguna dan efisien untuk penggunaan pribadi saya.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Generator peta Patrick",
                "text": "Generator Peta Kabupaten & Negara Bagian Amerika Serikat, dibangun dengan Python menggunakan perpustakaan Geopandas dan Matplotlib. Proyek ini digunakan untuk menghasilkan peta Amerika Serikat, termasuk peta kabupaten dan negara bagian. Proyek ini digunakan untuk membuat peta khusus untuk visualisasi dan analisis data.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Perpustakaan Skrip PowerShell Patrick",
                "text": "Perpustakaan skrip PowerShell yang berguna untuk referensi di masa mendatang. Berguna dengan fitur Script $ Profile, saya menemukan ini sangat membantu untuk mengotomatiskan tugas -tugas dari terminal Windows, karena saya sering menjadi pengguna OS Windows.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Perpustakaan Skrip Ruby Patrick",
                "text": "Perpustakaan yang berguna dari skrip ruby ​​untuk referensi di masa mendatang. Berguna untuk konsep perkembangan Ruby on Rails di masa depan.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "Pembuat Keterampilan PDF",
                "text": "Pembuat PDF khusus yang dibangun dengan Python melalui ekstensi PDFKIT dan JINJA2, bersama dengan format HTML dan JSON. Proyek ini digunakan untuk menghasilkan file PDF dari daftar keterampilan dan proyek. Proyek ini dapat digunakan untuk membuat resume PDF khusus, yang sangat berguna untuk aplikasi pekerjaan.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Proyek Enkripsi Rijandel",
                "text": "Keluarga 10+ implementasi algoritma enkripsi Rijandel di 128, 192, dan 256 bit. Proyek ini digunakan untuk menunjukkan algoritma enkripsi Rijandel dalam bahasa pemrograman yang berbeda. Proyek ini digunakan untuk membuat keluarga implementasi algoritma enkripsi Rijandel.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod",
                "text": "Mod Minecraft yang menambahkan alat khusus, baju besi, gerombolan, blok, dimensi, dan banyak lagi fitur ke dalam game. Dibangun dengan versi Java 8-17 untuk versi Minecraft tertentu antara 1,16 dan 1,20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Bahasa pemrograman harimau",
                "text": "Bahasa pemrograman khusus yang dibangun di kedua go & rust untuk bereksperimen dengan desain dan kinerja interpreter. Diimplementasikan di situs web portofolio menggunakan perakitan web.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Situs Web Pros Taging Tiger",
                "text": "Situs web yang saya bangun pada tahun 2024 untuk Tiger Tailgating Pro, sebuah perusahaan tailgating di Clemson, SC. Dibangun dengan react.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing Machine Project",
                "text": "Keluarga lebih dari 30+ implementasi mesin Turing. Digunakan untuk menunjukkan kelengkapan Turing untuk berbagai bahasa pemrograman untuk penelitian, terutama untuk bahasa pemrograman Tiger.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Bahasa pemrograman harimau"
    },
    "contact": {
        "title": "Hubungi saya",
        "header": "Informasi kontak",
        "email": "pattygsocials@gmail.com",
        "description": "Saya menanggapi pertanyaan dari email, pesan LinkedIn, dan pesan Instagram. Saya juga akan menelepon kembali jika nomor saya disediakan melalui resume atau sebaliknya, meskipun saya lebih suka menjaga nomor telepon saya tetap pribadi."
    },
    "formatter": {
        "title": "Embara json & yaml",
        "description": "Formatter JSON & YAML adalah alat yang memungkinkan Anda untuk memformat file JSON dan YAML. Ini dibangun dengan Go dan WebAssembly, dan dirancang untuk menjadi cepat dan efisien. Formatter ini dirancang agar mudah digunakan, dengan antarmuka sederhana yang memungkinkan Anda untuk menempel dalam kode JSON atau YAML Anda dan memformatnya dengan mengklik tombol.",
        "more_info1": "Untuk informasi lebih lanjut, lihat readme di",
        "more_info2": "Repositori Formatter JSON/YAML.",
        "format_as": "Format sebagai:",
        "auto_detect": "Deteksi Otomatis",
        "format": "Format"
    },
    "cube_solver": {
        "title": "Pemecah Kubus Rubix",
        "solve": "Menyelesaikan"
    },
    "tiger": {
        "title": "Bahasa harimau",
        "description": "Bahasa pemrograman Tiger adalah bahasa pemrograman khusus yang dibangun di kedua go & rust untuk bereksperimen dengan desain dan kinerja interpreter. Diimplementasikan di situs web portofolio menggunakan perakitan web. Bahasa pemrograman Tiger adalah bahasa pemrograman khusus yang dibangun di kedua go & rust untuk bereksperimen dengan desain dan kinerja interpreter. Diimplementasikan di situs web portofolio menggunakan perakitan web.",
        "more_info1": "Untuk informasi lebih lanjut, lihat readme di",
        "more_info2": "Bahasa Pemrograman Harimau Repositori Gitub.",
        "select_engine": "Select Engine:",
        "tiger_code": "Kode Harimau:",
        "run_tiger": "Jalankan harimau",
        "output": "Keluaran:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Insinyur Perangkat Lunak Tumpukan Penuh Berbasis di Florida Tengah"
    },
    "copy": {
        "text": "Menyalin",
        "copied": "Disalin!"
    },
    "social_media": {
        "github": "GitHub",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Ikuti saya"
    },
    "logotext": "Patrick"
}