{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Beranda",
        "about": "Tentang Saya",
        "portfolio": "Portofolio",
        "tiger": "Bahasa Tiger",
        "contact": "Hubungi Saya"
    },
    "home": {
        "title": "Beranda",
        "animated": {
            "first": "Insinyur Perangkat Lunak Full Stack",
            "second": "Pengembang Web",
            "third": "Pengembang Game",
            "fourth": "Pembuat Konten"
        },
        "descriptionA": "Insinyur perangkat lunak full-stack dan pengembang web berpengalaman dengan rekam jejak dalam memimpin proyek pengembangan, mulai dari membuat modifikasi Java untuk Minecraft hingga meningkatkan pengalaman pengguna di React.js dan mengimplementasikan REST API yang aman, sambil secara konsisten menggunakan metodologi agile dan kolaborasi tim yang efektif.",
        "descriptionB": "Selain itu, saya adalah pembuat konten geografi yang telah berhasil memanfaatkan algoritma dari berbagai platform media sosial, termasuk Instagram, YouTube, dan TikTok, untuk mendapatkan basis pengikut yang terhormat dan menarik.",
        "portfolio_button": "Portofolio Saya",
        "contact_button": "Hubungi Saya",
        "about_button": "Tentang Saya"
    },
    "about": {
        "title": "Tentang Saya",
        "personal_summary": {
            "title": "Ringkasan Pribadi",
            "text": "Sebagai Pengembang Perangkat Lunak Full Stack berpengalaman yang berbasis di Orlando, FL, saya telah menunjukkan keahlian dalam berbagai teknologi, dari Java dan C++ hingga React.js dan Node.js. Dengan rekam jejak memimpin proyek, termasuk pengembangan program modifikasi Java untuk Minecraft dan situs web yang bermanfaat untuk sopir truk, saya telah menunjukkan kepemimpinan dan inovasi. Komitmen saya terhadap keunggulan terlihat dalam kemampuan saya menyederhanakan manajemen proyek, menyelesaikan masalah kompleks, dan memberikan solusi berkualitas tinggi yang meningkatkan pengalaman pengguna dan mendorong kesuksesan organisasi."
        },
        "professional_experience": {
            "title": "Pengalaman Profesional",
            "entries": [
                {
                    "jobtitle": "Junior Software Engineer",
                    "where": "Orion180 Insurance",
                    "date": "2024 - Sekarang"
                },
                {
                    "jobtitle": "Pendiri & Pengembang Perangkat Lunak Full Stack",
                    "where": "SupremeMC",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Insinyur Perangkat Lunak Full Stack",
                    "where": "Accelerate Learning",
                    "date": "2023"
                },
                {
                    "jobtitle": "Pengembang Web Utama (Program Mahasiswa)",
                    "where": "Program GDI Universitas Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Pengawas Meja",
                    "where": "Universitas Clemson",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Keahlian Teknis",
            "header1": "Bahasa Pemrograman",
            "header2": "Framework & Pustaka",
            "header3": "Alat & Teknologi"
        },
        "services": {
            "title": "Layanan Saya",
            "entries": [
                {
                    "title": "Rekayasa Full Stack",
                    "text": "Saya menawarkan solusi menyeluruh untuk pengembangan front-end dan back-end, memastikan integrasi yang mulus dan fungsi yang konsisten di seluruh tumpukan perangkat lunak."
                },
                {
                    "title": "Pengembangan Web",
                    "text": "Dengan keahlian dalam HTML, CSS, dan framework JavaScript seperti React.js, saya membuat situs web yang menarik secara visual dan ramah pengguna yang disesuaikan dengan kebutuhan dan preferensi spesifik klien."
                },
                {
                    "title": "Pengembangan Game",
                    "text": "Dengan menggunakan bahasa seperti Java dan C++, saya berspesialisasi dalam menciptakan pengalaman bermain game yang imersif, dari konsep dan desain hingga implementasi dan optimisasi, memastikan gameplay yang menarik dan kinerja yang mulus."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portofolio",
        "filter_by": "Saring Portofolio Berdasarkan:",
        "entries": {
            "connect_four": {
                "title": "Connect Four",
                "text": "Keluarga besar dengan lebih dari 50 implementasi permainan Connect Four. Proyek ini mencakup implementasi dalam lebih dari 30 bahasa pemrograman yang berbeda, termasuk Java, C++, Python, JavaScript, dan lainnya. Selain itu, juga mencakup lebih dari 20 framework atau format lain, termasuk React.js, Ruby on Rails, ASP.NET, dan lainnya.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Proyek Interop",
                "text": "Proyek yang mendokumentasikan interoperabilitas antar berbagai bahasa pemrograman. Saat ini mencakup 15 bahasa pemrograman dan 18 pola eksekusi.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "excel_scripts": {
                "title": "Skrip Microsoft Excel (VBA)",
                "text": "Pustaka skrip VBA yang berguna untuk Microsoft Excel. Pustaka ini digunakan untuk mengotomatisasi tugas dalam spreadsheet Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "minecraft_json_generator": {
                "title": "Generator JSON Minecraft",
                "text": "Generator JSON ringan yang dibuat dengan Python untuk resource pack & data pack Minecraft. Proyek ini digunakan untuk menghasilkan file JSON untuk mod Minecraft, termasuk item, blok, dan entitas kustom.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Pengalaman Pendidikan Saya",
                "text": "Selain proyek pribadi saya, saya juga memperoleh banyak keterampilan dari pengalaman pendidikan. Klik di sini untuk melihat profil LinkedIn saya untuk informasi lebih lanjut.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Pengalaman Profesional Saya",
                "text": "Selain proyek pribadi saya, saya juga memperoleh banyak keterampilan dari pengalaman profesional. Klik di sini untuk melihat profil LinkedIn saya untuk informasi lebih lanjut.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Situs Web Portofolio Patrick Goodwin",
                "text": "Situs ini adalah situs web portofolio pribadi saya, dibangun dengan React.js. Proyek ini digunakan untuk menampilkan keterampilan dan proyek saya, serta menyediakan platform bagi calon pemberi kerja untuk menghubungi saya.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Pustaka Skrip Lua Patrick",
                "text": "Pustaka skrip Lua yang berguna untuk referensi di masa depan. Digunakan untuk mengotomatisasi tugas-tugas yang memerlukan kinerja tinggi, karena Lua biasanya lebih cepat daripada Python dan Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "neovim_config": {
                "title": "Konfigurasi Neovim Patrick",
                "text": "Konfigurasi Neovim pribadi saya. Digunakan untuk menyesuaikan Neovim dengan preferensi saya, termasuk pintasan, tema, dan plugin.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Generator Peta Patrick",
                "text": "Generator peta negara bagian & kabupaten Amerika Serikat yang dibuat dengan Python menggunakan pustaka Geopandas dan Matplotlib.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Pustaka Skrip PowerShell Patrick",
                "text": "Pustaka skrip PowerShell yang berguna untuk referensi di masa depan. Sangat membantu untuk mengotomatisasi tugas dari terminal Windows.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Pustaka Skrip Ruby Patrick",
                "text": "Pustaka skrip Ruby yang berguna untuk referensi di masa depan. Berguna untuk pengembangan konsep Ruby on Rails.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "Pembuat PDF Keahlian",
                "text": "Pembuat PDF kustom dengan Python menggunakan ekstensi Pdfkit dan Jinja2, bersama HTML dan format JSON. Digunakan untuk membuat resume PDF kustom.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Proyek Enkripsi Rijandel",
                "text": "Keluarga dari lebih dari 10 implementasi algoritma enkripsi Rijandel dalam 128, 192, dan 256 bit dalam berbagai bahasa pemrograman.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Mod Minecraft SupremeMC",
                "text": "Mod Minecraft yang menambahkan alat, armor, makhluk, blok, dan dimensi kustom. Dibangun dengan Java versi 8–17 untuk Minecraft versi 1.16–1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Bahasa Pemrograman Tiger",
                "text": "Bahasa pemrograman kustom yang dibuat dengan Go & Rust untuk bereksperimen dengan desain interpreter dan kinerja.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Situs Web Tiger Tailgating Pros",
                "text": "Situs web yang saya bangun pada tahun 2024 untuk Tiger Tailgating Pros, sebuah perusahaan tailgating di Clemson, SC. Dibuat dengan React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Proyek Mesin Turing",
                "text": "Keluarga dari lebih dari 30 implementasi Mesin Turing. Digunakan untuk menunjukkan kelengkapan Turing dari berbagai bahasa pemrograman.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Bahasa Pemrograman Tiger"
    },
    "contact": {
        "title": "Hubungi Saya",
        "header": "Informasi Kontak",
        "email": "pattygsocials@gmail.com",
        "description": "Saya merespons pertanyaan melalui email, pesan LinkedIn, dan Instagram. Saya juga akan menelepon balik jika nomor saya tersedia melalui resume atau lainnya, meskipun saya lebih suka menjaga nomor saya tetap pribadi."
    },
    "tiger": {
        "title": "Bahasa Tiger",
        "description": "Bahasa Pemrograman Tiger adalah bahasa kustom yang dibuat dengan Go dan Rust untuk bereksperimen dengan desain dan kinerja interpreter. Diimplementasikan di situs portofolio menggunakan Web Assembly.",
        "more_info1": "Untuk informasi lebih lanjut, lihat README di ",
        "more_info2": "Repositori GitHub Bahasa Pemrograman Tiger.",
        "select_engine": "Pilih Mesin:",
        "tiger_code": "Kode Tiger:",
        "run_tiger": "Jalankan Tiger",
        "output": "Keluaran:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Insinyur Perangkat Lunak Full Stack berbasis di Florida Tengah"
    },
    "social_media": {
        "github": "GitHub",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "TikTok",
        "youtube": "YouTube",
        "text_strip": "Ikuti saya"
    },
    "logotext": "PATRICK"
}
