{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Heim",
        "about": "Um mig",
        "portfolio": "Eignasafn",
        "projects": "Vefsíðuverkefni",
        "tiger": "Tiger tungumál",
        "formatter": "JSON & YAML Formatter",
        "cube_solver": "Rubix Cube Solver",
        "contact": "Hafðu samband við mig"
    },
    "home": {
        "title": "Heim",
        "animated": {
            "first": "Full Stack hugbúnaðarverkfræðingur",
            "second": "Vefur verktaki",
            "third": "Leikjahönnuður",
            "fourth": "Efnishöfundur"
        },
        "footer": "Vefsíða er nú þýdd og áberandi á 100+ tungumálum!",
        "descriptionA": "Reyndur hugbúnaðarverkfræðingur og vefur verktaki með fullan stafli með sýnt sögu um að leiða þróunarverkefni með góðum árangri, allt frá því að búa til Java breytingar fyrir Minecraft til að auka notendaupplifun í React.js og innleiða öruggar API, en nota stöðugt lipur aðferðafræði og árangursríka liðssamstarf.",
        "descriptionB": "Að auki er ég landafræði efnishöfundur sem hefur notið reiknirit margra samfélagsmiðla, þar á meðal Instagram, YouTube og Tiktok, til að öðlast virðulegan og grípandi fylgjandi stöð.",
        "portfolio_button": "Eignasafnið mitt",
        "contact_button": "Hafðu samband við mig",
        "about_button": "Um mig"
    },
    "about": {
        "title": "Um mig",
        "personal_summary": {
            "title": "Persónuleg yfirlit",
            "text": "Sem reyndur fullur Stack hugbúnaðarframleiðandi með aðsetur í Orlando, FL, hef ég sýnt fram á sérfræðiþekkingu í ýmsum tækni, frá Java og C ++ til React.js og Node.js. Með afrekaskrá yfir spjótandi verkefni, þar á meðal þróun Java -breytingaáætlunar fyrir Minecraft og gefandi vefsíðu fyrir vörubílstjórar, hef ég sýnt forystu og nýsköpun. Skuldbinding mín til ágæti er áberandi í getu minni til að hagræða verkefnastjórnun, leysa flókin vandamál og skila hágæða lausnum sem auka notendaupplifun og knýja fram árangur í skipulagi."
        },
        "professional_experience": {
            "title": "Fagreynsla",
            "entries": [
                {
                    "jobtitle": "Junior hugbúnaðarverkfræðingur",
                    "where": "Orion180 tryggingar",
                    "date": "2024 - Til staðar"
                },
                {
                    "jobtitle": "Stofnandi og fullur Stack hugbúnaðarframleiðandi",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Full Stack hugbúnaðarverkfræðingur",
                    "where": "Flýta fyrir námi",
                    "date": "2023"
                },
                {
                    "jobtitle": "Lead Web Developer (nemendaprógramm)",
                    "where": "GDI -nám í Clemson háskólanum",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Umsjónarmaður skrifborðs",
                    "where": "Clemson háskólinn",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Tæknilega færni",
            "header1": "Forritunarmál",
            "header2": "Rammar og bókasöfn",
            "header3": "Verkfæri og tækni"
        },
        "services": {
            "title": "Þjónusta mín",
            "entries": [
                {
                    "title": "Full Stack Engineering",
                    "text": "Ég býð upp á alhliða lausnir bæði í framhlið og þróun í bakinu, sem tryggir óaðfinnanlega samþættingu og virkni í öllu hugbúnaðarstakkanum."
                },
                {
                    "title": "Vefþróun",
                    "text": "Með sérfræðiþekkingu í HTML, CSS og JavaScript ramma eins og React.js, fönd ég sjónrænt aðlaðandi og notendavænar vefsíður sem eru sniðnar til að mæta sérstökum þörfum og óskum viðskiptavina."
                },
                {
                    "title": "Leikjaþróun",
                    "text": "Með því að nýta tungumál eins og Java og C ++, þá sem ég sérhæfa mig í að skapa yfirgripsmikla leikupplifun, allt frá hugmynd og hönnun til framkvæmdar og hagræðingar, tryggja grípandi spilamennsku og sléttan árangur."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Eignasafn",
        "filter_by": "Síu eignasafn eftir:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca JSON",
                "text": "Python verkefni sem straumlínulagar þýðingar á tungumálum. Leyfir að vefsíðusafnið mitt sé þýtt á 70+ tungumál, þar á meðal spænsku, frönsku, kínversku, arabísku og mörgum öðrum. Þetta verkefni er notað til að búa til fjöltyngt vefsíðusafn, sem er mjög gagnlegt til að ná til breiðari markhóps. Með þessu verkefni geta yfir 99% heimsins lesið eignasafnið mitt á reiprennandi máli.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Tengdu fjóra",
                "text": "Gríðarleg fjölskylda yfir 50+ útfærslna í Connect Four leiknum. Þetta verkefni felur í sér útfærslur á yfir 30 mismunandi forritunarmálum, þar á meðal Java, C ++, Python, JavaScript og fleira. Að auki inniheldur það einnig yfir 20+ mismunandi ramma eða önnur snið, þar á meðal React.js, Ruby on Rails, ASP.NET og fleira.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Interop verkefni",
                "text": "Verkefni sem skjalar samvirkni milli mismunandi forritunarmálar. Sem stendur inniheldur 15 mismunandi forritunarmál og 18 framkvæmdarmynstur.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "JSON & YAML Auto Formatter",
                "text": "A Linter & AutoFormatter fyrir JSON & YAML skrár. Þetta verkefni er notað til að forsníða JSON & YAML skrár, sem er mjög gagnlegt til að halda kóða hreinum og skipulögðum. Byggt með Go, sett saman með Webassembly og felld inn í eignasafnið mitt sem vefsíðuverkefni. Fleiri snið til að koma í framtíðinni.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft Json rafall",
                "text": "Léttur JSON rafall innbyggður í Python fyrir Minecraft Resource & Data Packs. Þetta verkefni er notað til að búa til JSON skrár fyrir Minecraft Mods, þar á meðal sérsniðna hluti, blokkir og aðila. Mjög gagnlegt til að búa ekki aðeins til sérsniðna gagnapakka, heldur fyrir Mods líka í gegnum Mod Name Switching eiginleikann.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Menntunarreynsla mín",
                "text": "Samhliða persónulegum verkefnum mínum hef ég einnig öðlast fjölda færni af menntunarreynslu. Smelltu hér til að skoða LinkedIn prófílinn minn til að fá frekari upplýsingar.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Starfsreynsla mín",
                "text": "Samhliða persónulegum verkefnum mínum hef ég einnig öðlast fjölda færni af starfsreynslu. Smelltu hér til að skoða LinkedIn prófílinn minn til að fá frekari upplýsingar.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Goodwin eignasafn",
                "text": "Þessi vefsíða er vefsíða mín um persónulega eignasafn, smíðuð með React.js. Þetta verkefni er notað til að sýna færni mína og verkefni, svo og til að bjóða upp á vettvang fyrir mögulega vinnuveitendur til að hafa samband við mig. Þetta verkefni er notað til að skapa faglega viðveru á netinu.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Lua handritasafn Patrick",
                "text": "Gagnlegt bókasafn með Lua forskriftir til framtíðar tilvísunar. Þetta bókasafn er notað til að gera sjálfvirkan verkefni í Lua forskriftir, sem geta komið sér vel fyrir árangursþéttandi verkefni, þar sem Lua er venjulega hraðskreiðara en bæði Python og Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrick's Microsoft Excel töflureikni (VBA)",
                "text": "Gagnlegt bókasafn með VBA forskriftir fyrir Microsoft Excel. Þetta bókasafn er notað til að gera sjálfvirkan verkefni í Excel töflureiknum.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Neovim config Patrick",
                "text": "Persónulegar neovim stillingar mínar. Þetta verkefni er notað til að stilla Neovim að mínum mönnum, þar á meðal sérsniðnum lyklakippum, þemum og viðbætum. Þetta verkefni er notað til að gera Neovim notendavænni og skilvirkari til einkanota.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patrick's Map Generator",
                "text": "A United States County & State Map rafall, smíðaður með Python með Geopandas og Matplotlib bókasöfnum. Þetta verkefni er notað til að búa til kort af Bandaríkjunum, þar á meðal sýslu- og ríkiskortum. Þetta verkefni er notað til að búa til sérsniðin kort fyrir sjón og greiningu gagna.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "PowerShell handritasafn Patrick",
                "text": "Gagnlegt bókasafn PowerShell forskriftir til framtíðar tilvísunar. Gagnlegt með $ prófíl handritsaðgerðinni finnst mér þetta gríðarlega gagnlegt til að gera sjálfvirkan verkefni frá Windows flugstöðinni, þar sem ég er tíður notandi Windows OS.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Ruby handritsbókasafn Patrick",
                "text": "Gagnlegt bókasafn með Ruby forskriftir til framtíðar tilvísunar. Gagnlegt fyrir framtíðar Ruby on Rails þróunarhugtök.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF færni Builder",
                "text": "Sérsniðinn PDF byggingaraðili smíðaður með Python í gegnum PDFKIT og Jinja2 viðbætur, ásamt HTML og JSON sniði. Þetta verkefni er notað til að búa til PDF skrár úr lista yfir færni og verkefni. Hægt er að nota þetta verkefni til að búa til sérsniðna PDF ferilskrá, sem er mjög gagnlegt fyrir atvinnuforrit.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandel dulkóðunarverkefni",
                "text": "Fjölskylda 10+ útfærslna á Rijandel dulkóðunaralgrími árið 128, 192 og 256 bita. Þetta verkefni er notað til að sýna fram á Rijandel dulkóðunaralgrími á mismunandi forritunarmálum. Þetta verkefni er notað til að búa til fjölskyldu útfærslna af Rijandel dulkóðunaralgrími.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod",
                "text": "Minecraft mod sem bætir sérsniðnum verkfærum, herklæðum, múgum, blokkum, víddum og mörgum fleiri aðgerðum við leikinn. Byggt með Java útgáfum 8-17 fyrir valnar Minecraft útgáfur á milli 1,16 og 1,20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tiger forritunarmál",
                "text": "Sérsniðið forritunarmál innbyggt bæði Go & ryð til að gera tilraunir með túlkunarhönnun og afköst. Framkvæmd á vefsíðu eignasafnsins með vefsamsetningu.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger Tailgating Pros vefsíða",
                "text": "Vefsíða sem ég smíðaði árið 2024 fyrir Tiger Tailgating Pros, Tailgating Company í Clemson, SC. Byggt með React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing Machine Project",
                "text": "Fjölskylda yfir 30+ útfærslna í Turing vélinni. Notað til að sýna fram á turing heilleika fyrir mismunandi forritunarmál til rannsókna, sérstaklega fyrir Tiger forritunarmálið.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tiger forritunarmál"
    },
    "contact": {
        "title": "Hafðu samband við mig",
        "header": "Hafðu samband",
        "email": "pattygsocials@gmail.com",
        "description": "Ég svara fyrirspurnum frá tölvupósti, LinkedIn skilaboðum og Instagram skilaboðum. Ég mun líka hringja til baka ef númerið mitt er veitt með ferilskrá eða á annan hátt, þó að ég vilji halda símanúmerinu mínu einkaaðila."
    },
    "formatter": {
        "title": "JSON & YAML Formatter",
        "description": "JSON & YAML Formatter er tæki sem gerir þér kleift að forsníða JSON og YAML skrár. Það er smíðað með Go og Webassembly og það er hannað til að vera hratt og skilvirkt. Formatter er hannað til að vera auðvelt í notkun, með einföldu viðmóti sem gerir þér kleift að líma í JSON eða YAML kóðann þinn og forsníða það með því að smella á hnappinn.",
        "more_info1": "Nánari upplýsingar er að finna í ReadMe í",
        "more_info2": "JSON/YAML Formatter geymsla.",
        "format_as": "Snið sem:",
        "auto_detect": "Sjálfvirkar greiningar",
        "format": "Format"
    },
    "cube_solver": {
        "title": "Rubix Cube Solver",
        "solve": "Leysa"
    },
    "tiger": {
        "title": "Tiger tungumál",
        "description": "Tiger forritunarmálið er sérsniðið forritunarmál sem er smíðað bæði í Go & Rust til að gera tilraunir með túlkunarhönnun og afköst. Framkvæmd á vefsíðu eignasafnsins með vefsamsetningu. Tiger forritunarmálið er sérsniðið forritunarmál sem er smíðað bæði í Go & Rust til að gera tilraunir með túlkunarhönnun og afköst. Framkvæmd á vefsíðu eignasafnsins með vefsamsetningu.",
        "more_info1": "Nánari upplýsingar er að finna í ReadMe í",
        "more_info2": "Tiger forritunarmál Github geymsla.",
        "select_engine": "Veldu vél:",
        "tiger_code": "Tiger kóða:",
        "run_tiger": "Hlaupa tígrisdýr",
        "output": "Framleiðsla:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Full Stack hugbúnaðarverkfræðingur með aðsetur í Mið -Flórída"
    },
    "copy": {
        "text": "Afritaðu",
        "copied": "Afritað!"
    },
    "social_media": {
        "github": "GitHub",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Fylgdu mér"
    },
    "logotext": "Patrick"
}