{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Casa",
        "about": "Su di me",
        "portfolio": "Portfolio",
        "projects": "Progetti di siti Web",
        "tiger": "Lingua tigre",
        "formatter": "Formatter JSON e YAML",
        "contact": "Contattami"
    },
    "home": {
        "title": "Casa",
        "animated": {
            "first": "Ingegnere del software completo",
            "second": "Sviluppatore web",
            "third": "Sviluppatore di giochi",
            "fourth": "Creatore di contenuti"
        },
        "descriptionA": "L'ingegnere del software e lo sviluppatore Web esperto con una storia dimostrata di progetti di sviluppo con successo, dalla creazione di modifiche Java per Minecraft al miglioramento dell'esperienza dell'utente nelle react.js e all'implementazione di API REST sicure, impiegando costantemente metodologie agili e una collaborazione efficace del team.",
        "descriptionB": "Inoltre, sono un creatore di contenuti di geografia che ha sfruttato con successo gli algoritmi di più piattaforme di social media, tra cui Instagram, YouTube e Tiktok, per ottenere una base di follower rispettabile e coinvolgente.",
        "portfolio_button": "Il mio portafoglio",
        "contact_button": "Contattami",
        "about_button": "Su di me"
    },
    "about": {
        "title": "Su di me",
        "personal_summary": {
            "title": "Riepilogo personale",
            "text": "Come sviluppatore di software con esperto full stack con sede a Orlando, FL, ho dimostrato competenze in varie tecnologie, da Java e C ++ a React.js e Node.js. Con una track record di progetti di guida, incluso lo sviluppo di un programma di modifica Java per Minecraft e un sito Web gratificante per i camionisti, ho mostrato leadership e innovazione. Il mio impegno per l'eccellenza è evidente nella mia capacità di semplificare la gestione dei progetti, risolvere problemi complessi e fornire soluzioni di alta qualità che migliorano l'esperienza dell'utente e guidano il successo organizzativo."
        },
        "professional_experience": {
            "title": "Esperienza professionale",
            "entries": [
                {
                    "jobtitle": "Ingegnere software junior",
                    "where": "Assicurazione Orion180",
                    "date": "2024 - Presente"
                },
                {
                    "jobtitle": "Fondatore e sviluppatore di software Full Stack",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Ingegnere del software completo",
                    "where": "Accelerare l'apprendimento",
                    "date": "2023"
                },
                {
                    "jobtitle": "Lead Web Developer (programma per studenti)",
                    "where": "Programma GDI della Clemson University",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Supervisore della scrivania",
                    "where": "Clemson University",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Competenze tecniche",
            "header1": "Linguaggi di programmazione",
            "header2": "Framework e biblioteche",
            "header3": "Strumenti e tecnologie"
        },
        "services": {
            "title": "I miei servizi",
            "entries": [
                {
                    "title": "Ingegneria dello stack completo",
                    "text": "Offro soluzioni complete attraverso lo sviluppo di front-end e back-end, garantendo l'integrazione e la funzionalità senza soluzione di continuità durante l'intero stack del software."
                },
                {
                    "title": "Sviluppo web",
                    "text": "Con competenze in framework HTML, CSS e JavaScript come React.js, realizzo siti Web visivamente accattivanti e facili da soddisfare per soddisfare le esigenze e le preferenze specifiche dei clienti."
                },
                {
                    "title": "Sviluppo del gioco",
                    "text": "Sfruttando linguaggi come Java e C ++, mi sono specializzato nella creazione di esperienze di gioco immersive, dal concetto e nel design all'implementazione e all'ottimizzazione, garantendo il gameplay coinvolgente e le prestazioni fluide."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfolio",
        "filter_by": "Portfolio Filtro di:",
        "entries": {
            "biblioteca": {
                "title": "BIBBITECA JSON",
                "text": "Un progetto Python che semplifica le traduzioni linguistiche. Consente al portafoglio del mio sito Web di essere tradotto in oltre 70 lingue, tra cui spagnolo, francese, cinese, arabo e molti altri. Questo progetto viene utilizzato per creare un portafoglio di siti Web multilingue, che è molto utile per raggiungere un pubblico più ampio. Con questo progetto, oltre il 99% del mondo può leggere il mio portafoglio in un linguaggio fluente.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Collega quattro",
                "text": "Famiglia massiccia di oltre 50 attuali implementazioni del gioco Connect Four. Questo progetto include implementazioni in oltre 30 diversi linguaggi di programmazione, tra cui Java, C ++, Python, JavaScript e altro ancora. Inoltre, include anche oltre 20+ framework diversi o altri formati, tra cui React.js, Ruby on Rails, ASP.NET e altro ancora.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Progetto ad intervento",
                "text": "Un progetto che documenta l'interoperabilità tra diversi linguaggi di programmazione. Attualmente include 15 diversi linguaggi di programmazione e 18 modelli di esecuzione.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "Formatter auto e yaml auto",
                "text": "A Linter & Autoformatter per i file JSON e YAML. Questo progetto viene utilizzato per formattare i file JSON e YAML, che è molto utile per mantenere il codice pulito e organizzato. Costruito con GO, compilato con WebAssembly e incorporato nel mio portafoglio come progetto di siti Web. Altri formati in futuro.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Generatore JSON Minecraft",
                "text": "Generatore JSON leggero incorporato in Python per Minecraft Resource & Data Packs. Questo progetto viene utilizzato per generare file JSON per le mod Minecraft, inclusi articoli personalizzati, blocchi ed entità. Molto utile non solo per la creazione di datapack personalizzati, ma anche per le mod tramite la funzione di commutazione del nome mod.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "La mia esperienza educativa",
                "text": "Oltre ai miei progetti personali, ho anche acquisito numerose competenze per esperienza educativa. Fai clic qui per visualizzare il mio profilo LinkedIn per ulteriori informazioni.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "La mia esperienza professionale",
                "text": "Oltre ai miei progetti personali, ho anche acquisito numerose competenze per esperienza professionale. Fai clic qui per visualizzare il mio profilo LinkedIn per ulteriori informazioni.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Sito Web di Patrick Goodwin Portfolio",
                "text": "Questo sito Web è il mio sito Web di portafoglio personale, creato con react.js. Questo progetto viene utilizzato per mostrare le mie capacità e progetti, nonché per fornire una piattaforma per i potenziali datori di lavoro per contattarmi. Questo progetto viene utilizzato per creare una presenza online professionale.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Biblioteca di script Lua di Patrick",
                "text": "Un'utile biblioteca di script Lua per riferimento futuro. Questa biblioteca viene utilizzata per automatizzare le attività negli script Lua, che possono tornare utili per compiti per le prestazioni, poiché Lua è di solito un linguaggio di scripting più veloce rispetto a Python e Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Script di fogli di calcolo di Patrick's Microsoft Excel (VBA)",
                "text": "Un'utile libreria di script VBA per Microsoft Excel. Questa libreria viene utilizzata per automatizzare le attività nei fogli di calcolo Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "La configurazione Neovim di Patrick",
                "text": "La mia configurazione neovim personale. Questo progetto viene utilizzato per configurare Neovim a mio piacimento, inclusi keybindings, temi e plug -in personalizzati. Questo progetto viene utilizzato per rendere Neovim più facile da usare ed efficiente per il mio uso personale.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Generatore di mappe di Patrick",
                "text": "Un generatore di mappe della contea e dello stato degli Stati Uniti, costruito con Python utilizzando le librerie Geopanda e Matplotlib. Questo progetto viene utilizzato per generare mappe degli Stati Uniti, comprese le mappe della contea e dello stato. Questo progetto viene utilizzato per creare mappe personalizzate per la visualizzazione e l'analisi dei dati.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Biblioteca di script PowerShell di Patrick",
                "text": "Un'utile biblioteca di script di PowerShell per riferimento futuro. Utile con la funzione di script $ profilo, trovo questo immensamente utile per automatizzare le attività dal terminale di Windows, poiché sono un utente frequente del sistema operativo Windows.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Biblioteca di script di Patrick di Patrick",
                "text": "Un'utile libreria di script di Ruby per riferimento futuro. Utile per futuri concetti di sviluppo di Ruby on Rails.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF Skills Builder",
                "text": "Un costruttore PDF personalizzato costruito con Python tramite le estensioni PDFKit e Jinja2, insieme a HTML e JSON Formattazione. Questo progetto viene utilizzato per generare file PDF da un elenco di competenze e progetti. Questo progetto può essere utilizzato per creare un curriculum PDF personalizzato, che è molto utile per le applicazioni di lavoro.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Progetto di crittografia di Rijandel",
                "text": "Una famiglia di oltre 10 implementazioni dell'algoritmo di crittografia di Rijandel nel 128, 192 e 256 bit. Questo progetto viene utilizzato per dimostrare l'algoritmo di crittografia di Rijandel in diversi linguaggi di programmazione. Questo progetto viene utilizzato per creare una famiglia di implementazioni dell'algoritmo di crittografia di Rijandel.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "SUPREMEMC Minecraft Mod",
                "text": "Una mod Minecraft che aggiunge strumenti, armature, mob, blocchi, dimensioni e molte altre funzionalità personalizzate. Costruito con versioni Java 8-17 per versioni di Minecraft selezionate tra 1,16 e 1,20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Linguaggio di programmazione tigre",
                "text": "Lingua di programmazione personalizzata integrata sia Go e Rust per sperimentare la progettazione e le prestazioni dell'interprete. Implementato sul sito Web del portafoglio utilizzando l'assemblaggio Web.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Sito Web di Tiger Tailgating Pro",
                "text": "Un sito Web che ho costruito nel 2024 per Tiger Tailgating Pro, una società di tailgating a Clemson, SC. Costruito con react.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Progetto macchina Turing",
                "text": "Famiglia di oltre 30 implementazioni della macchina Turing. Utilizzato per dimostrare la completezza per diversi linguaggi di programmazione per la ricerca, in particolare per il linguaggio di programmazione Tiger.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Linguaggio di programmazione tigre"
    },
    "contact": {
        "title": "Contattami",
        "header": "Informazioni sui contatti",
        "email": "pattygsocials@gmail.com",
        "description": "Rispondo alle richieste di e -mail, messaggi LinkedIn e messaggi Instagram. Richiamo anche se il mio numero viene fornito tramite curriculum o altro, anche se preferisco mantenere il mio numero di telefono privato."
    },
    "formatter": {
        "title": "Formatter JSON e YAML",
        "description": "Il formatter JSON & YAML è uno strumento che consente di formattare i file JSON e YAML. È costruito con Go e Webassembly ed è progettato per essere rapido ed efficiente. Il formatter è progettato per essere facile da usare, con una semplice interfaccia che ti consente di incollare nel codice JSON o YAML e formattalo con il clic di un pulsante.",
        "more_info1": "Per ulteriori informazioni, consultare il readme in",
        "more_info2": "Repository di formatter JSON/YAML.",
        "format_as": "Formato come:",
        "auto_detect": "Rilevamento automatico",
        "format": "Formato"
    },
    "tiger": {
        "title": "Lingua tigre",
        "description": "Il linguaggio di programmazione Tiger è un linguaggio di programmazione personalizzato integrato sia Go e Rust per sperimentare la progettazione e le prestazioni dell'interprete. Implementato sul sito Web del portafoglio utilizzando l'assemblaggio Web. Il linguaggio di programmazione Tiger è un linguaggio di programmazione personalizzato integrato sia Go e Rust per sperimentare la progettazione e le prestazioni dell'interprete. Implementato sul sito Web del portafoglio utilizzando l'assemblaggio Web.",
        "more_info1": "Per ulteriori informazioni, consultare il readme in",
        "more_info2": "Tiger Programming Language Github Repository.",
        "select_engine": "Seleziona motore:",
        "tiger_code": "Codice tigre:",
        "run_tiger": "Esegui la tigre",
        "output": "Produzione:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Ingegnere di software Full Stack con sede nella Florida centrale"
    },
    "copy": {
        "text": "Copia",
        "copied": "Copiato!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Seguimi"
    },
    "logotext": "Patrick"
}