{
    "name": "პატრიკ გუდვინი",
    "menu": {
        "home": "სახლი",
        "about": "ჩემს შესახებ",
        "portfolio": "პორტფოლიო",
        "projects": "ვებსაიტის პროექტები",
        "tiger": "ვეფხვის ენა",
        "formatter": "JSON & YAML FORMETER",
        "contact": "დამიკავშირდით"
    },
    "home": {
        "title": "სახლი",
        "animated": {
            "first": "სრული დასტის პროგრამული ინჟინერი",
            "second": "ვებ დეველოპერი",
            "third": "თამაშის დეველოპერი",
            "fourth": "შინაარსის შემქმნელი"
        },
        "descriptionA": "გამოცდილი სრულფასოვანი პროგრამული უზრუნველყოფის ინჟინერი და ვებ დეველოპერი წარმატებით წამყვანი განვითარების პროექტების დემონსტრირებული ისტორიით, Minecraft– ისთვის Java– ს მოდიფიკაციების შექმნამდე, React.js– ში მომხმარებლის გამოცდილების გასაუმჯობესებლად და უსაფრთხო REST API– ების განხორციელებაში, ამასთან, თანმიმდევრულად იყენებენ Agile მეთოდოლოგიებსა და გუნდური თანამშრომლობის ეფექტურობას.",
        "descriptionB": "გარდა ამისა, მე ვარ გეოგრაფიის შინაარსის შემქმნელი, რომელმაც წარმატებით გამოიყენა მრავალი სოციალური მედიის პლატფორმების ალგორითმები, მათ შორის Instagram, YouTube და Tiktok, რათა მიიღოთ საპატივცემულო და მიმზიდველი მიმდევარი ბაზა.",
        "portfolio_button": "ჩემი პორტფოლიო",
        "contact_button": "დამიკავშირდით",
        "about_button": "ჩემს შესახებ"
    },
    "about": {
        "title": "ჩემს შესახებ",
        "personal_summary": {
            "title": "პირადი რეზიუმე",
            "text": "როგორც გამოცდილი სრული დასტის პროგრამული უზრუნველყოფის შემქმნელი, რომელიც დაფუძნებულია ორლანდოში, FL- ში, მე ვაჩვენე ექსპერტიზა სხვადასხვა ტექნოლოგიებში, Java- სა და C ++ - დან React.js და Node.js. Spearheading პროექტების ჩანაწერით, მათ შორის Minecraft- ისთვის Java მოდიფიკაციის პროგრამის შემუშავება და სატვირთო მანქანების მძღოლებისთვის დამაჯილდოებელი ვებსაიტები, მე ვაჩვენე ლიდერობა და ინოვაცია. ჩემი ვალდებულება სრულყოფილებას აშკარაა პროექტის მენეჯმენტის გამარტივებაში, რთული პრობლემების გადაჭრისა და მაღალი ხარისხის გადაწყვეტილებების მიწოდებაში, რაც აძლიერებს მომხმარებლის გამოცდილებას და ხელს უწყობს ორგანიზაციულ წარმატებას."
        },
        "professional_experience": {
            "title": "პროფესიული გამოცდილება",
            "entries": [
                {
                    "jobtitle": "უმცროსი პროგრამული ინჟინერი",
                    "where": "Orion180 დაზღვევა",
                    "date": "2024 - დღემდე"
                },
                {
                    "jobtitle": "დამფუძნებელი და სრული დასტის პროგრამული უზრუნველყოფის შემქმნელი",
                    "where": "უზენაესი",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "სრული დასტის პროგრამული ინჟინერი",
                    "where": "დააჩქარეთ სწავლა",
                    "date": "2023"
                },
                {
                    "jobtitle": "წამყვანი ვებ დეველოპერი (სტუდენტური პროგრამა)",
                    "where": "Clemson University GDI პროგრამა",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "მაგიდის ზედამხედველი",
                    "where": "Clemson University",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "ტექნიკური უნარები",
            "header1": "პროგრამირების ენები",
            "header2": "ჩარჩოები და ბიბლიოთეკები",
            "header3": "ინსტრუმენტები და ტექნოლოგიები"
        },
        "services": {
            "title": "ჩემი მომსახურება",
            "entries": [
                {
                    "title": "სრული დასტის ინჟინერია",
                    "text": "მე გთავაზობთ ყოვლისმომცველ გადაწყვეტილებებს როგორც წინა, ისე უკანა მხარეს განვითარების პროცესში, რაც უზრუნველყოფს უწყვეტი ინტეგრაციას და ფუნქციონირებას მთელი პროგრამული უზრუნველყოფის დასტის დროს."
                },
                {
                    "title": "ვებ განვითარება",
                    "text": "HTML, CSS და JavaScript- ის ჩარჩოებში, როგორიცაა React.js, ექსპერტიზით, მე ვიზუალურად მიმზიდველ და მოსახერხებელ ვებსაიტებს ვატარებ, რომლებიც მორგებულია კლიენტების სპეციფიკური საჭიროებებისა და პრეფერენციების დასაკმაყოფილებლად."
                },
                {
                    "title": "თამაშის განვითარება",
                    "text": "ისეთი ენების, როგორიცაა Java და C ++, მე სპეციალიზირებულნი არიან იმერული თამაშების გამოცდილების შესაქმნელად, კონცეფციიდან და დიზაინიდან განხორციელებამდე და ოპტიმიზაციამდე, რაც უზრუნველყოფს თამაშს და გლუვ შესრულებას."
                }
            ]
        }
    },
    "portfolio": {
        "title": "პორტფოლიო",
        "filter_by": "ფილტრის პორტფოლიო:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca JSON",
                "text": "პითონის პროექტი, რომელიც ახდენს ენის თარგმნებს. საშუალებას გაძლევთ ჩემი ვებსაიტის პორტფოლიო ითარგმნოს 70+ ენაზე, მათ შორის ესპანური, ფრანგული, ჩინური, არაბული და მრავალი სხვა. ეს პროექტი გამოიყენება მრავალენოვანი ვებსაიტის პორტფელის შესაქმნელად, რაც ძალიან სასარგებლოა ფართო აუდიტორიის მისაღწევად. ამ პროექტით, მსოფლიოს 99% -ზე მეტს შეუძლია წაიკითხოს ჩემი პორტფოლიო თავისუფლად ენაზე.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "დაუკავშირდით ოთხს",
                "text": "Connect Four თამაშის 50+ დანერგვის მასიური ოჯახი. ეს პროექტი მოიცავს 30 -ზე მეტ სხვადასხვა პროგრამირების ენას, მათ შორის Java, C ++, Python, JavaScript და სხვა. გარდა ამისა, იგი ასევე მოიცავს 20+ სხვადასხვა ჩარჩოებს ან სხვა ფორმატებს, მათ შორის React.js, Ruby on Rails, ASP.NET და სხვა.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "ინტეროპ პროექტი",
                "text": "პროექტი, რომელიც ასახავს ურთიერთთანამშრომლობას სხვადასხვა პროგრამირების ენებს შორის. ამჟამად მოიცავს 15 სხვადასხვა პროგრამირების ენას და 18 შესრულების ნიმუშს.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "JSON & YAML AUTO FORMATTER",
                "text": "Linter & Autoformatter JSON & YAML ფაილებისთვის. ეს პროექტი გამოიყენება JSON & YAML ფაილების დასადგენად, რაც ძალიან სასარგებლოა კოდის სუფთა და ორგანიზებისთვის. აშენებულია Go- ით, შედგენილია ვებგვერდის საშუალებით და ჩართულია ჩემს პორტფოლიოში, როგორც ვებსაიტის პროექტი. მომავალში მეტი ფორმატები.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON გენერატორი",
                "text": "მსუბუქი წონის JSON გენერატორი, რომელიც აშენდა პითონში Minecraft რესურსისა და მონაცემთა პაკეტებისთვის. ეს პროექტი გამოიყენება JSON ფაილების შესაქმნელად Minecraft Mods– ისთვის, მათ შორის საბაჟო საგნები, ბლოკები და პირები. ძალიან სასარგებლოა არა მხოლოდ საბაჟო მონაცემთა ბაზის შექმნისთვის, არამედ მოდებისთვის, ასევე Mod სახელის შეცვლის ფუნქციის საშუალებით.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "ჩემი საგანმანათლებლო გამოცდილება",
                "text": "ჩემს პირად პროექტებთან ერთად, მე ასევე შევიძინე უამრავი ცოდნა საგანმანათლებლო გამოცდილებისგან. დააჭირეთ აქ, რომ ნახოთ ჩემი LinkedIn პროფილი დამატებითი ინფორმაციისთვის.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "ჩემი პროფესიული გამოცდილება",
                "text": "ჩემს პირად პროექტებთან ერთად, მე ასევე შევიძინე უამრავი ცოდნა პროფესიული გამოცდილებისგან. დააჭირეთ აქ, რომ ნახოთ ჩემი LinkedIn პროფილი დამატებითი ინფორმაციისთვის.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "პატრიკ გუდვინის პორტფელის ვებსაიტი",
                "text": "ეს ვებ - გვერდია ჩემი პირადი პორტფელის ვებსაიტზე, რომელიც აშენებულია React.js– ით. ეს პროექტი გამოიყენება ჩემი უნარებისა და პროექტების საჩვენებლად, ასევე იმისთვის, რომ პოტენციურ დამსაქმებლებს დაუკავშირდნენ პოტენციურ დამსაქმებლებს. ეს პროექტი გამოიყენება პროფესიონალური ონლაინ ყოფნის შესაქმნელად.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "პატრიკის ლუას სკრიპტის ბიბლიოთეკა",
                "text": "ლუას სკრიპტების სასარგებლო ბიბლიოთეკა მომავალი მითითებისთვის. ეს ბიბლიოთეკა გამოიყენება ლუას სკრიპტებში ამოცანების ავტომატიზაციისთვის, რომლებიც შეიძლება მოსახერხებელი იყოს შესრულების საჭირო დავალებებისთვის, რადგან ლუა, როგორც წესი, უფრო სწრაფი სკრიპტირების ენაა, ვიდრე პითონი და რუბი.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "პატრიკის Microsoft Excel ცხრილების სკრიპტები (VBA)",
                "text": "VBA სკრიპტების სასარგებლო ბიბლიოთეკა Microsoft Excel- ისთვის. ეს ბიბლიოთეკა გამოიყენება Excel ცხრილების დავალებების ავტომატიზაციისთვის.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "პატრიკის ნეოვიმის კონფიგურაცია",
                "text": "ჩემი პირადი Neovim კონფიგურაცია. ეს პროექტი გამოიყენება Neovim- ის კონფიგურაციისთვის, ჩემი სურვილისამებრ, მათ შორის საბაჟო კლავიშების, თემების და დანამატების ჩათვლით. ეს პროექტი გამოიყენება იმისთვის, რომ Neovim უფრო მოსახერხებელი და ეფექტური გახდეს ჩემი პირადი სარგებლობისთვის.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "პატრიკის რუქის გენერატორი",
                "text": "შეერთებული შტატების ქვეყნის და სახელმწიფო რუქის გენერატორი, რომელიც აშენებულია პითონით, გეოპანდისა და მატპლოტლიბის ბიბლიოთეკების გამოყენებით. ეს პროექტი გამოიყენება შეერთებული შტატების რუქების შესაქმნელად, მათ შორის ქვეყნის და სახელმწიფო რუქების ჩათვლით. ეს პროექტი გამოიყენება მონაცემთა ვიზუალიზაციისა და ანალიზისთვის საბაჟო რუქების შესაქმნელად.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "პატრიკის PowerShell სკრიპტის ბიბლიოთეკა",
                "text": "PowerShell სკრიპტების სასარგებლო ბიბლიოთეკა მომავალი მითითებისთვის. სასარგებლოა $ პროფილის სკრიპტის მახასიათებლით, ეს ძალიან სასარგებლოა Windows ტერმინალიდან ამოცანების ავტომატიზაციისთვის, რადგან მე ვარ Windows OS- ის ხშირი მომხმარებელი.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "პატრიკის რუბის სკრიპტის ბიბლიოთეკა",
                "text": "Ruby სკრიპტების სასარგებლო ბიბლიოთეკა მომავალი მითითებისთვის. სასარგებლოა მომავალი რუბრიკისთვის რელსების განვითარების კონცეფციებზე.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF უნარების მშენებელი",
                "text": "PDF- ის შემქმნელი, რომელიც აშენდა Python– ით PDFKIT და Jinja2 გაფართოების საშუალებით, HTML და JSON ფორმატით. ეს პროექტი გამოიყენება PDF ფაილების შესაქმნელად უნარებისა და პროექტების სიიდან. ეს პროექტი შეიძლება გამოყენებულ იქნას პერსონალური PDF რეზიუმის შესაქმნელად, რაც ძალიან სასარგებლოა სამუშაო პროგრამებისთვის.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandel დაშიფვრის პროექტი",
                "text": "Rijandel- ის დაშიფვრის ალგორითმის 10+ განხორციელების ოჯახი 128, 192 და 256 ბიტი. ეს პროექტი გამოიყენება რიჯანდელის დაშიფვრის ალგორითმის დემონსტრირებისთვის სხვადასხვა პროგრამირების ენაზე. ეს პროექტი გამოიყენება რიჯანდელის დაშიფვრის ალგორითმის განხორციელების ოჯახის შესაქმნელად.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Superemc minecraft mod",
                "text": "Minecraft Mod, რომელიც დაამატებს საბაჟო ხელსაწყოებს, ჯავშანს, მობილურს, ბლოკებს, ზომებს და თამაშს კიდევ ბევრ მახასიათებელს. აშენებულია Java ვერსიებით 8-17, აირჩიეთ Minecraft ვერსიები 1.16 და 1.20 შორის.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "ვეფხვის პროგრამირების ენა",
                "text": "საბაჟო პროგრამირების ენა, რომელიც აშენდა როგორც Go & Rust- ში, ექსპერიმენტებს თარჯიმნის დიზაინსა და შესრულებაზე. განხორციელებულია პორტფელის ვებსაიტზე ვებ - ასამბლეის გამოყენებით.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "ვეფხვის კადრების პროფესიონალი ვებსაიტი",
                "text": "ვებსაიტი, რომელიც მე 2024 წელს ავაშენე Tiger Tailgating Pros– ისთვის, Clemson, Sc. აშენებულია React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing Machine Project",
                "text": "ტურინგის აპარატის 30+ დანერგვის ოჯახი. გამოიყენება ტურინგის სისრულის დემონსტრირებისთვის სხვადასხვა პროგრამირების ენებისთვის კვლევისთვის, განსაკუთრებით ვეფხვის პროგრამირების ენისთვის.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "ვეფხვის პროგრამირების ენა"
    },
    "contact": {
        "title": "დამიკავშირდით",
        "header": "საკონტაქტო ინფორმაცია",
        "email": "pattygsocials@gmail.com",
        "description": "მე ვპასუხობ ელ.ფოსტით, LinkedIn შეტყობინებებისა და Instagram- ის შეტყობინებების გამოძიებებზე. მე ასევე დავურეკავ, თუ ჩემი ნომერი გათვალისწინებულია რეზიუმეს საშუალებით ან სხვაგვარად, თუმცა მირჩევნია ჩემი ტელეფონის ნომერი პირადი შევინარჩუნო."
    },
    "formatter": {
        "title": "JSON & YAML FORMETER",
        "description": "JSON & YAML FORMATTER არის ინსტრუმენტი, რომელიც საშუალებას გაძლევთ ფორმატირება JSON და YAML ფაილები. იგი აშენებულია Go და WebAssembly- ით და ის შექმნილია სწრაფი და ეფექტური. Formatter შექმნილია მარტივი გამოსაყენებლად, მარტივი ინტერფეისით, რომელიც საშუალებას გაძლევთ ჩასვათ თქვენი JSON ან YAML კოდი და შექმნათ იგი ღილაკის დაჭერით.",
        "more_info1": "დამატებითი ინფორმაციისთვის იხილეთ README",
        "more_info2": "JSON/YAML ფორმატის საცავი.",
        "format_as": "ფორმატი როგორც:",
        "auto_detect": "ავტო გამოვლენა",
        "format": "ფორმატი"
    },
    "tiger": {
        "title": "ვეფხვის ენა",
        "description": "ვეფხვის პროგრამირების ენა არის პროგრამირების ჩვეულებრივი პროგრამირების ენა, რომელიც აშენებულია როგორც Go & Rust- ში, რომ ექსპერიმენტი ჩაატაროს თარჯიმნის დიზაინსა და შესრულებაზე. განხორციელებულია პორტფელის ვებსაიტზე ვებ - ასამბლეის გამოყენებით. ვეფხვის პროგრამირების ენა არის პროგრამირების ჩვეულებრივი პროგრამირების ენა, რომელიც აშენებულია როგორც Go & Rust- ში, რომ ექსპერიმენტი ჩაატაროს თარჯიმნის დიზაინსა და შესრულებაზე. განხორციელებულია პორტფელის ვებსაიტზე ვებ - ასამბლეის გამოყენებით.",
        "more_info1": "დამატებითი ინფორმაციისთვის იხილეთ README",
        "more_info2": "ვეფხვის პროგრამირების ენა github საცავი.",
        "select_engine": "აირჩიეთ ძრავა:",
        "tiger_code": "ვეფხვის კოდი:",
        "run_tiger": "ვეფხვის გაშვება",
        "output": "გამომავალი:"
    },
    "tab": {
        "title": "პატრიკ გუდვინი",
        "description": "სრული დასტის პროგრამული ინჟინერი, რომელიც დაფუძნებულია ცენტრალურ ფლორიდაში"
    },
    "copy": {
        "text": "ასლი",
        "copied": "გადაწერა!"
    },
    "social_media": {
        "github": "გითუბ",
        "instagram": "ინსტაგრამი",
        "linkedin": "LinkedIn",
        "tiktok": "ტიკტოკი",
        "youtube": "YouTube",
        "text_strip": "გამომყევი"
    },
    "logotext": "პატრიკი"
}