{
    "name": "Патрик Гудвин",
    "menu": {
        "home": "Үй",
        "about": "Мен туралы",
        "portfolio": "Портфолио",
        "projects": "Веб-сайт жобалары",
        "tiger": "Жолбарыс тілі",
        "portfolio_translator": "Портфолио аудармашы",
        "formatter": "JSON & Yaml форматтаушы",
        "cube_solver": "Rubix Cube Solver",
        "contact": "Маған хабарласыңыз"
    },
    "home": {
        "title": "Үй",
        "animated": {
            "first": "Толық стек бағдарламалық жасақтама инженері",
            "second": "Веб-әзірлеуші",
            "third": "Ойын жасаушы",
            "fourth": "Мазмұн жасаушы"
        },
        "footer": "Қазір веб-сайт 100+ тілінде аударылған және қол жетімді!",
        "descriptionA": "Толық жинақталған бағдарламалық жасақтама инженері және веб-әзірлеушісі, Deacher.js.js және қауіпсіз демалыс API-де пайдаланушылық тәжірибені жақсарту үшін Java модификациясын жасаудан тәжірибелі бағдарламалық жасақтама инженері және веб-әзірлеуші ​​бар.",
        "descriptionB": "Сонымен қатар, мен бірнеше әлеуметтік медиа платформалардың алгоритмдерін, соның ішінде инстаграмның, YouTube және Tiktok алгоритмдерін, оның ішінде құрметті және тартымды ізбасарлардың негізін табыстаған географиялық мазмұнды жасаушымын.",
        "portfolio_button": "Менің портфолио",
        "contact_button": "Маған хабарласыңыз",
        "about_button": "Мен туралы"
    },
    "about": {
        "title": "Мен туралы",
        "personal_summary": {
            "title": "Жеке қорытынды",
            "text": "Тәжірибелі толық стек бағдарламалық жасақтамасын жасаушы ретінде Orlando, FL негізіндегі бағдарламалық жасақтама жасаушы ретінде мен java және c ++ әр түрлі технологиялар бойынша сараптаманы actine.js және node.js-ке көрсеттім. Найзадинг жобаларының рекордтық жазбаларымен, соның ішінде Minecraft үшін Java модификациялау бағдарламасын әзірлеу және жүк көлігі жүргізушілеріне арналған марапаттау веб-сайты, мен көшбасшылық пен инновацияны көрсетті. Менің шеберлікке деген адалдығым - жобаларды басқаруды, күрделі мәселелерді шешуге, күрделі мәселелерді шешуге және пайдаланушылық тәжірибені арттыратын және ұйымдастырушылық жетістікке жету қабілетімде айқын көрінеді."
        },
        "professional_experience": {
            "title": "Кәсіби тәжірибе",
            "entries": [
                {
                    "jobtitle": "Кіші бағдарламалық жасақтама инженері",
                    "where": "Orion180 сақтандыру",
                    "date": "2024 - қазіргі уақытқа дейін"
                },
                {
                    "jobtitle": "Құрылтайшы және толық стек бағдарламалық жасақтамасын жасаушы",
                    "where": "Супремеди",
                    "date": "2020 - 2024 жж"
                },
                {
                    "jobtitle": "Толық стек бағдарламалық жасақтама инженері",
                    "where": "Оқуды жеделдету",
                    "date": "2023"
                },
                {
                    "jobtitle": "Қорғасын веб-әзірлеушісі (студенттік бағдарлама)",
                    "where": "Clemson University GDI бағдарламасы",
                    "date": "2021 - 2022 жж"
                },
                {
                    "jobtitle": "Үстел жетекшісі",
                    "where": "Клемсон университеті",
                    "date": "2021 - 2022 жж"
                },
                {
                    "jobtitle": "Үстел жетекшісі",
                    "where": "Клемсон университеті",
                    "date": "2021 - 2022 жж"
                }
            ]
        },
        "technical_skills": {
            "title": "Техникалық дағдылар",
            "header1": "Бағдарламалау тілдері",
            "header2": "Кітапхана және кітапханалар",
            "header3": "Құралдар мен технологиялар"
        },
        "services": {
            "title": "Менің қызметтерім",
            "entries": [
                {
                    "title": "Толық стекпен инженерия",
                    "text": "Мен алдыңғы қатарлы және кері шешімдерді, барлық бағдарламалық жасақтама жинағының бүкіл деңгейінде біркелкі интеграция және функционалдылықты қамтамасыз етемін."
                },
                {
                    "title": "Веб-даму",
                    "text": "HTML, CSS, CSS және JavaScript шеңберіндегі сараптамамен READE.js сияқты, мен клиенттердің қажеттіліктері мен қалауымен танысамын."
                },
                {
                    "title": "Ойынның дамуы",
                    "text": "Java және C ++ сияқты тілдерді пайдалану, мен тәжірибелік және дизайнды іске асыру және оңтайландыру, ойын-сауық және үздіксіз жұмыс істеуді қамтамасыз ету үшін мамандандырамын."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Портфолио",
        "filter_by": "Сүзгі портфолиосы:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca json",
                "text": "Тілдік аудармаларды ағартатын Python жобасы. Менің веб-сайтым портфеліне испан, француз, қытай, қытай, араб және басқалармен бірге 70+ тілге аударылады. Бұл жоба көптілді веб-сайт портфолиосын жасау үшін қолданылады, бұл кең аудиторияға жету үшін өте пайдалы. Осы жобамен әлемнің 99% -дан астамы менің портфелімді еркін тілде оқи алады.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Төрт қосыңыз",
                "text": "50-ден астам жаппай отбасы Connect төрт ойынын жүзеге асырады. Бұл жобаға 30-дан астам түрлі бағдарламалау тілдерінде, соның ішінде Java, C ++, Python, JavaScript және басқалар кіреді. Бұған қоса, оған 20-дан астам түрлі шеңберлер немесе басқа форматтар, соның ішінде ReADE.js, Ruby рельстер, ASP.NET және басқалары кіреді.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "Азық-түлік қолданбасы",
                "text": "Толық стек .net .NET 9 Азық-түлік тауарларын басқаруға арналған блокалық сервер. Прикладная бағдарлама тұрақтылық үшін, тұрақты тестілік люкс-люкске арналған құрылымдық негіздермен контроллер / қызмет / репозиторий үлгісіне сәйкес келеді.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Interop жобасы",
                "text": "Әр түрлі бағдарламалау тілдері арасындағы өзара әрекеттесуді қажет ететін жоба. Қазіргі уақытта 15 түрлі бағдарламалау және 18 орындау үлгілері кіреді.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Түгендеу тізілімі",
                "text": "Толық стек демо-сату пункті (POS) борыштық 17+ және NODE.js. Бұл қосымша пайдаланушының аутентификациясы, рөлге қол жеткізуді басқару, түгендеуді бақылау және мазақ етуді өңдеумен кәсіби деңгейдегі POS жүйесін көрсетеді.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "JSON & Yaml Auto Fratefuter",
                "text": "СИНАРЛЫҚ және JSON және YAML файлдары үшін суреттер және автоформатор. Бұл жоба JSON & Yaml файлдарын пішімдеу үшін қолданылады, бұл кодты сақтау үшін өте пайдалы және ұйымдастырылған. Веб-сайтпен бірге жасалған және менің портфолио құрамына кірген кезде салынған. Болашақта көбірек форматтар.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON генераторы",
                "text": "Жеңіл JSON генераторы Python-да Minecraft Ресурс және деректер пакеттері үшін салынған. Бұл жоба Minecraft Mods, соның ішінде жеке заттар, блоктар және субъектілер үшін JSON файлдарын жасау үшін қолданылады. Тек өзгермелі деректер қораптарын ғана емес, MODS атауын ауыстыру мүмкіндігі үшін де пайдалы.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Менің білім беру тәжірибем",
                "text": "Жеке жобаларыммен қатар, мен де білім беру тәжірибесінен көптеген дағдыларды игердім. Қосымша ақпарат алу үшін LinkedIn профилін көру үшін мына жерді басыңыз.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Менің кәсіби тәжірибем",
                "text": "Жеке жобаларымның қатарында мен кәсіби тәжірибелерден көптеген дағдылар алдым. Қосымша ақпарат алу үшін LinkedIn профилін көру үшін мына жерді басыңыз.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Патрик Гудвин портфолиосының веб-сайты",
                "text": "Бұл веб-сайт - бұл менің жеке портфолио веб-сайтым, eart.js салынған. Бұл жоба менің дағдыларым мен жобаларымды көрсету, сонымен қатар әлеуетті жұмыс берушілер үшін маған хабарласуға арналған. Бұл жоба кәсіби онлайн қатысу үшін қолданылады.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Патриктің Луа сценарий кітапханасы",
                "text": "Болашаққа сілтеме жасау үшін LUA сценарийлерінің пайдалы кітапханасы. Бұл кітапхана Lua сценарийлеріндегі тапсырмаларды автоматтандыру үшін қолданылады, олар жұмысты-мұқтаж тапсырмалар үшін ыңғайлы болуы мүмкін, өйткені Луа әдетте Питон мен Рубинге қарағанда тез сценарий тілін білдіреді.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Патриктің Microsoft Excel электрондық кесте сценарийлері (VBA)",
                "text": "Microsoft Excel үшін VBA сценарийлерінің пайдалы кітапханасы. Бұл кітапхана Excel кестесіндегі тапсырмаларды автоматтандыру үшін қолданылады.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Патриктің Неовим конфигурациясы",
                "text": "Менің жеке Neovim конфигурациясы. Бұл жоба Neovim-ді өзіме ұнату үшін, соның ішінде жеке пернелер, тақырыптар және плагиндермен теңшеу үшін қолданылады. Бұл жоба Neovim-ді жеке пайдалануға ыңғайлы және тиімді ету үшін қолданылады.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Патриктің картасы генераторы",
                "text": "Python компаниясымен және Matplotlib кітапханаларын пайдаланып, Python-мен салынған Америка Құрама Штаттары мен Мемлекеттік карта генераторы. Бұл жоба Америка Құрама Штаттарының, соның ішінде округ және мемлекеттік карталардың карталарын құру үшін қолданылады. Бұл жоба деректерді визуализациялау және талдау үшін жеке карталар жасау үшін қолданылады.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Патриктің PowerShell сценарий кітапханасы",
                "text": "Болашаққа сілтеме үшін PowerShell сценарийлерінің пайдалы кітапханасы. Профильдің сценарийі мүмкіндігімен пайдалы, мен Windows терминалынан тапсырмаларды автоматтандыру үшін, өйткені мен Windows ОЖ-нің жиі қолданушысы болып табыламын.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Патриктің Руби сценарий кітапханасы",
                "text": "Болашаққа сілтеме жасау үшін Руби сценарийлерінің пайдалы кітапханасы. Теміржол өнімдерін дамыту тұжырымдамаларындағы болашақ рубин үшін пайдалы.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF дағдыларын құрушы",
                "text": "HTML және JSON пішімінен тұратын PDFKIT және Jinja2 кеңейтімдері арқылы PDF құрастырушы PDF құрастырушы. Бұл жоба дағдылар мен жобалар тізімінен PDF файлдарын құру үшін қолданылады. Бұл жобаны жеке PDF түйіндемесін жасау үшін пайдалануға болады, бұл жұмыс бағдарламаларына өте пайдалы.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Ридэндельді шифрлау жобасы",
                "text": "Уриджэндель шифрлау алгоритмі 128, 192 және 256 битіндегі 10+ жүзеге асыратын отбасы. Бұл жоба әр түрлі бағдарламалау тілдеріндегі rijandel шифрлау алгоритмін көрсету үшін қолданылады. Бұл жоба Риандель шифрлау алгоритмін жүзеге асырудың отбасымен жасалады.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprimcemc Minecraft Mod",
                "text": "Minecraft Mod, ол жеке құралдарды, қару-жарақтарды, топтарды, блоктарды, блоктарды, өлшемдерді және ойынға көптеген мүмкіндіктерді қосады. 1,16 және 1.20 аралығындағы Minecraft нұсқаларын таңдау үшін Java нұсқаларымен салынған 8-17.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Жолбарысты бағдарламалау тілі",
                "text": "Программалау тілі Сонымен қатар, екі га & тотында салынған, аудармашының дизайны мен өнімділігімен тәжірибе жасау. Веб-жиналысты қолдана отырып, портфолио веб-сайтында жүзеге асырылады.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger Sailgate Prose веб-сайты",
                "text": "Мен 2024 жылы Clemson, Clemson, SC Clemson-дағы жолбарыстық еркіндікке арналған веб-сайт. Eart.js салынған.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Тюринг машинасының жобасы",
                "text": "Тюринг машинасының 30-дан астам отбасы. Зерттеулерге арналған әртүрлі бағдарламалау тілдеріне арналған, әсіресе жолбарыстың бағдарламалау тілі үшін техниканы көрсету үшін қолданылады.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Жолбарысты бағдарламалау тілі"
    },
    "contact": {
        "title": "Маған хабарласыңыз",
        "header": "Байланыс ақпараты",
        "email": "pattygsocials@gmail.com",
        "description": "Мен электрондық пошталардан, LinkedIn хабарламаларынан және Инстаграмдағы хабарламалардан жауап беремін. Егер менің нөмірім түйіндеме немесе басқаша қамтамасыз етілсе, мен қайта қоңырау шаламын, бірақ мен телефон нөмірімді жеке ұстағым келеді."
    },
    "formatter": {
        "title": "JSON & Yaml форматтаушы",
        "description": "JSON & Yaml пішімдеушісі JSON және Yaml файлдарын пішімдеуге мүмкіндік беретін құрал. Ол бар және веб-орналастырумен салынған және ол тез және тиімді болуға арналған. Пішімдеуші қарапайым интерфейсімен JSON немесе Yaml кодын қоюға мүмкіндік беретін қарапайым интерфейспен қолдануға арналған және оны батырманы басу арқылы пішімдеуге мүмкіндік береді.",
        "more_info1": "Қосымша ақпарат алу үшін Readme-дан қараңыз",
        "more_info2": "JSON / Yaml Printer Repository.",
        "format_as": "Форматы:",
        "auto_detect": "Auto Detect",
        "format": "Формат"
    },
    "cube_solver": {
        "title": "Rubix Cube Solver",
        "start": "Шешу"
    },
    "tiger": {
        "title": "Жолбарыс тілі",
        "description": "Жолбарыс бағдарламалау тілі - бұл бағдарлама мен датқа салынған арнайы бағдарламалау тілі - бұл аудармашы және өнімділікпен тәжірибе жасау. Веб-жиналысты қолдана отырып, портфолио веб-сайтында жүзеге асырылады. Жолбарыс бағдарламалау тілі - бұл бағдарлама мен датқа салынған арнайы бағдарламалау тілі - бұл аудармашы және өнімділікпен тәжірибе жасау. Веб-жиналысты қолдана отырып, портфолио веб-сайтында жүзеге асырылады.",
        "more_info1": "Қосымша ақпарат алу үшін Readme-дан қараңыз",
        "more_info2": "Tiger бағдарламалау тілі Github Repository.",
        "select_engine": "Қозғалтқышты таңдаңыз:",
        "tiger_code": "Жолбарыс коды:",
        "run_tiger": "Жолбарысты іске қосыңыз",
        "output": "Шығу:"
    },
    "tab": {
        "title": "Патрик Гудвин",
        "description": "Орталық флоридада орналасқан толық стек бағдарламалық жасақтама инженері"
    },
    "copy": {
        "text": "Еліктеу",
        "copied": "Көшірілді!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Инстаграм",
        "linkedin": "Linkedin",
        "tiktok": "Тикток",
        "youtube": "YouTube",
        "text_strip": "Маған жазыл"
    },
    "languages": {
        "title": "Портфолио аудармашы",
        "description": "Менің портфолиосын әлемнің келушілеріне 100-ден астам тілді қолдаумен қалай қол жетімді етіп табыңыз.",
        "global_accessibility": {
            "title": "Жаһандық қол жетімділік",
            "description": "Менің портфолиоым бүкіл әлемнен келушілерге қол жетімді ететін {Санау} тілдерінде қол жетімді. Бұл көптілді тәсіл менің инклюзивті және жаһандық бағдарламалық жасақтаманы дамытуға деген адалдығын көрсетеді.",
            "stats": {
                "languages_supported": "Тілдер қолдау көрсетіледі",
                "countries_represented": "Елдер ұсынды",
                "continents_covered": "Құрлылар жабылған"
            }
        },
        "features": {
            "title": "Ерекше өзгешеліктері",
            "items": [
                {
                    "title": "Нақты уақыттағы аударма:",
                    "description": "Тілдерді тіл таңдауышымен лезде ауыстырыңыз"
                },
                {
                    "title": "URL негізіндегі тіл:",
                    "description": "Тіл қалауы URL мекенжайында сақталады"
                },
                {
                    "title": "Жергілікті сценарийді қолдау:",
                    "description": "Араб, қытай, хинди және одан да көп сценарийлерді дұрыс көрсету"
                },
                {
                    "title": "Мәдени сезімталдық:",
                    "description": "Аудармалар мәдени контекстке ғана емес, тура мағынаны ғана ескереді"
                },
                {
                    "title": "SEO оңтайландырылды:",
                    "description": "Әр тілдік нұсқа іздеу жүйелері үшін оңтайландырылған"
                }
            ]
        },
        "world_map": {
            "title": "Интерактивті әлем картасы",
            "description": "Картадағы елдерге олардың қолдау көрсетілетін тілдерін көру үшін апарыңыз:",
            "languages_label": "Тілдер",
            "legend": {
                "supported": "Тілдер қолдау көрсетіледі",
                "not_supported": "Тілге қолдау жоқ"
            },
            "zoom_controls": {
                "zoom_in": "Масштабтау",
                "zoom_out": "Кішірейту",
                "reset": "Көріністі қалпына келтіру"
            }
        },
        "supported_languages": {
            "title": "Қолдау көрсетілетін тілдер"
        },
        "interactive_country_map": {
            "title": "Интерактивті ел картасы",
            "description": "Төмендегі елдерге олардың қолдау көрсетілетін тілдерін көру үшін жүгіреді:",
            "language_count": {
                "single": "тіл",
                "multiple": "тілдер"
            }
        },
        "tooltips": {
            "no_language_support": "Тілге қолдау жоқ"
        }
    },
    "logotext": "Патрик"
}