{
    "name": "Gatrick Goodwin",
    "menu": {
        "home": "ផ្ទហ",
        "about": "អំពីខ្ញុំ",
        "portfolio": "ផលប័ត្រ",
        "projects": "គម្រោងគេហទំព័រ",
        "tiger": "ភាសាខ្លា",
        "portfolio_translator": "អ្នកបកប្រែផលប័ត្រ",
        "formatter": "ទុីនិងយ៉ាំម",
        "cube_solver": "Rubix Cube Solver",
        "contact": "ទាក់ទងមកខ្ញុំ"
    },
    "home": {
        "title": "ផ្ទហ",
        "animated": {
            "first": "វិស្វករផ្នែកទន់ពេញ",
            "second": "អ្នកអភិវឌ្ឍន៍គេហទំព័រ",
            "third": "អ្នកអភិវឌ្ឍន៍ហ្គេម",
            "fourth": "អ្នកបង្កើតមាតិកា"
        },
        "footer": "គេហទំព័រដែលបានបកប្រែនិងអាចទទួលបាននិងអាចទទួលយកបានក្នុង 100+ ភាសា 100+!",
        "descriptionA": "វិស្វករផ្នែកទន់កម្មវិធីនិងអ្នកអភិវឌ្ឍន៍អ៊ីនធឺណេតដែលបានបង្ហាញដោយជោគជ័យពីការបង្កើតការកែប្រែចាវ៉ាសម្រាប់ Minecraft ដើម្បីបង្កើនបទពិសោធន៍របស់អ្នកប្រើប្រាស់។",
        "descriptionB": "លើសពីនេះទៀតខ្ញុំជាអ្នកបង្កើតមាតិកាភូមិសាស្ត្រដែលបានប្រើក្បួនដោះស្រាយដោយជោគជ័យនៃប្រព័ន្ធផ្សព្វផ្សាយសង្គមជាច្រើនរួមមាន Instagram, YouTube និង Tiktok ដើម្បីទទួលបានមូលដ្ឋានតាមដានគួរឱ្យគោរពនិងចូលរួម។",
        "portfolio_button": "ផលប័ត្ររបស់ខ្ញុំ",
        "contact_button": "ទាក់ទងមកខ្ញុំ",
        "about_button": "អំពីខ្ញុំ"
    },
    "about": {
        "title": "អំពីខ្ញុំ",
        "personal_summary": {
            "title": "សង្ខេបផ្ទាល់ខ្លួន",
            "text": "ក្នុងនាមជាអ្នកអភិវឌ្ឍន៍កម្មវិធីផ្នែកទន់ជង់ពេញដែលមានបទពិសោធន៍ដែលមានមូលដ្ឋាននៅ Orlando, ខ្ញុំបានបង្ហាញជំនាញក្នុងបច្ចេកវិទ្យាផ្សេងៗពីចាវ៉ានិង C ++ ដើម្បីប្រតិកម្ម .js និង node.js និង node.js និង node.js ។ ជាមួយនឹងកំណត់ត្រាបទនៃគម្រោងលង្ហិនរួមមានការអភិវឌ្ឍកម្មវិធីកែប្រែចាវ៉ាសម្រាប់ Minecraft និងគេហទំព័រដែលផ្តល់រង្វាន់សម្រាប់អ្នកបើកបររថយន្តដឹកទំនិញខ្ញុំបានបង្ហាញភាពជាអ្នកដឹកនាំនិងការច្នៃប្រឌិតថ្មី។ ការប្តេជ្ញាចិត្តរបស់ខ្ញុំចំពោះឧត្តមភាពគឺបង្ហាញឱ្យឃើញច្បាស់ក្នុងសមត្ថភាពក្នុងការបង្កើតការគ្រប់គ្រងគម្រោងដោះស្រាយបញ្ហាស្មុគស្មាញនិងផ្តល់នូវដំណោះស្រាយដែលមានគុណភាពខ្ពស់ដែលជួយបង្កើនបទពិសោធន៍អ្នកប្រើប្រាស់និងជោគជ័យក្នុងការបើកបរ។"
        },
        "professional_experience": {
            "title": "បទពិសោធន៍វិជ្ជាជីវៈ",
            "entries": [
                {
                    "jobtitle": "វិស្វករកម្មវិធីកុំព្យូទ័រ",
                    "where": "ធានារ៉ាប់រង Orion180",
                    "date": "2024 - បច្ចុប្បន្នបច្ចុប្បន្ន"
                },
                {
                    "jobtitle": "ស្ថាបនិកនិងអ្នកអភិវឌ្ឍន៍កម្មវិធីទន់ជង់ពេញ",
                    "where": "Supemc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "វិស្វករផ្នែកទន់ពេញ",
                    "where": "បង្កើនល្បឿនសិក្សា",
                    "date": "2023"
                },
                {
                    "jobtitle": "អ្នកអភិវឌ្ឍន៍គេហទំព័រនាំមុខ (កម្មវិធីនិស្សិត)",
                    "where": "កម្មវិធី GDI GDI របស់សាកលវិទ្យាល័យ Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "អ្នកត្រួតពិនិត្យតុ",
                    "where": "សាកលវិទ្យាល័យ Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "អ្នកត្រួតពិនិត្យតុ",
                    "where": "សាកលវិទ្យាល័យ Clemson",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "ជំនាញបច្ចេកទេស",
            "header1": "ភាសាសរសេរកម្មវិធី",
            "header2": "ក្របខ័ណ្ឌនិងបណ្ណាល័យ",
            "header3": "ឧបករណ៍និងបច្ចេកវិទ្យា"
        },
        "services": {
            "title": "សេវាកម្មរបស់ខ្ញុំ",
            "entries": [
                {
                    "title": "វិស្វកម្មជង់ពេញ",
                    "text": "ខ្ញុំសូមផ្តល់ជូននូវដំណោះស្រាយទូលំទូលាយនៅទូទាំងការអភិវឌ្ឍផ្នែកខាងមុខនិងខាងក្រោយធានានូវការធ្វើសមាហរណកម្មនិងមុខងារដែលគ្មានថ្នេរនៅទូទាំងជង់កម្មវិធីទាំងមូល។"
                },
                {
                    "title": "ការអភិវឌ្ឍគេហទំព័រ",
                    "text": "ដោយមានជំនាញក្នុង HTML, CSS, CSS, និង Javascripts ដូចជា Gavascripts, ខ្ញុំបានធ្វើឱ្យមានការអំពាវនាវរកមើលនិងគេហទំព័រដែលងាយស្រួលប្រើសម្រាប់តម្រូវការនិងចំណូលចិត្តជាក់លាក់របស់អតិថិជន។"
                },
                {
                    "title": "ការអភិវឌ្ឍហ្គេម",
                    "text": "ឡុងភាសាដូចជាចាវ៉ានិង C ++ ខ្ញុំមានជំនាញក្នុងការបង្កើតបទពិសោធន៍លេងល្បែងដែលមានប្រសិទ្ធិភាពពីគំនិតនិងការរចនារហូតដល់ការអនុវត្តនិងបង្កើនប្រសិទ្ធិភាព។"
                }
            ]
        }
    },
    "portfolio": {
        "title": "ផលប័ត្រ",
        "filter_by": "តម្រងផលប័ត្រដោយ:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca Json",
                "text": "គម្រោង Python ដែលធ្វើឱ្យការបកប្រែភាសា។ អនុញ្ញាតឱ្យបានបកប្រែពីផលប័ត្រគេហទំព័ររបស់ខ្ញុំទៅជាភាសា 70+ រួមទាំងភាសាអេស្ប៉ាញបារាំងចិនអារ៉ាប់និងមនុស្សជាច្រើនទៀត។ គម្រោងនេះត្រូវបានប្រើដើម្បីបង្កើតផលប័ត្រគេហទំព័រពហុភាសាដែលមានប្រយោជន៍ខ្លាំងណាស់សម្រាប់ការឈានដល់ទស្សនិកជនកាន់តែទូលំទូលាយ។ ជាមួយនឹងគម្រោងនេះជាង 99% នៃពិភពលោកអាចអានផលប័ត្ររបស់ខ្ញុំក្នុងភាសាស្ទាត់ជំនាញ។",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "ភ្ជាប់បួន",
                "text": "គ្រួសារដ៏ធំនៃការអនុវត្តជាង 50+ នៃហ្គេមតភ្ជាប់បួន។ គម្រោងនេះរួមបញ្ចូលទាំងការអនុវត្តភាសាកម្មវិធីជាង 30 ផ្សេងគ្នារួមមានចាវ៉ា, ស៊ី ++, Python, JavaScript, និងជាច្រើនទៀត។ លើសពីនេះទៀតវារួមបញ្ចូលទាំងក្របខ័ណ្ឌផ្សេងៗទៀតឬទ្រង់ទ្រាយផ្សេងទៀតរួមទាំងប្រតិកម្មផងដែរ .JS, Ruby នៅលើផ្លូវដែក, Asp.net និងច្រើនទៀត។",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "កម្មវិធីគ្រឿងទេស",
                "text": "កម្មវិធីម៉ាស៊ីនបម្រើពេញអេក្រង់ពេញលេញ 9 សម្រាប់ការគ្រប់គ្រងទំនិញគ្រឿងទេស។ ពាក្យសុំធ្វើតាមលំនាំឧបករណ៍បញ្ជា / សេវាកម្ម / លំនាំឃ្លាំងដែលមានស្នូលក្របខ័ណ្ឌអង្គភាពសម្រាប់ការតស៊ូនិងរួមបញ្ចូលទាំងឈុតតេស្តទូលំទូលាយ។",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "គម្រោងអន្តរ",
                "text": "គម្រោងដែលធ្វើឱ្យឯកសារអន្តរប្រតិបត្តិការរវាងភាសាសរសេរកម្មវិធីផ្សេងៗគ្នា។ បច្ចុប្បន្ននេះរួមមានភាសាសរសេរកម្មវិធីចំនួន 15 ផ្សេងៗគ្នានិងគំរូនៃការប្រតិបត្តិ 18 ។",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "ការចុះឈ្មោះសារពើភ័ណ្ឌ",
                "text": "ការចុះបញ្ជីនៃការធ្វើពិព័រណ៍នៃការលក់របស់ជ័រពេញលេញ (POS) ដែលមានប្រព័ន្ធគ្រប់គ្រងសារពើភ័ណ្ឌដែលបានសាងសង់ឡើងដោយមានរាងជាមុំ 17+ និង node.js. កម្មវិធីនេះបង្ហាញពីប្រព័ន្ធឆូតកាតថ្នាក់ជំនាញជាមួយនឹងការផ្ទៀងផ្ទាត់របស់អ្នកប្រើប្រាស់ការគ្រប់គ្រងការចូលប្រើតាមតួនាទីការតាមដានសារពើភ័ណ្ឌនិងដំណើរការទូទាត់ការសើចចំអក។",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "ជូសុន & យ៉ាំលីអូស្វ័យប្រវត្តិ",
                "text": "ម៉ាស៊ីនបោះពុម្ព & ForoFormatter សម្រាប់ឯកសារ JSON & YAML ។ គម្រោងនេះត្រូវបានប្រើដើម្បីធ្វើទ្រង់ទ្រាយឯកសារ JSON & YAML ដែលមានប្រយោជន៍ខ្លាំងណាស់សម្រាប់ការរក្សាលេខកូដស្អាតនិងរៀបចំ។ បានសាងសង់ដោយប្រើទៅចងក្រងជាមួយ webassembly ហើយបានបញ្ចូលទៅក្នុងផលប័ត្ររបស់ខ្ញុំជាគម្រោងគេហទំព័រ។ មានទ្រង់ទ្រាយបន្ថែមទៀតដើម្បីមកនាពេលអនាគត។",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "ម៉ាស៊ីនភ្លើង Minecraft Json",
                "text": "ម៉ាស៊ីនភ្លើង Glash ទម្ងន់ស្រាលបានបង្កើតឡើងនៅក្នុង Python សម្រាប់ធនធានធនធាន Minecraft ធនធាននិងកញ្ចប់ទិន្នន័យ។ គម្រោងនេះត្រូវបានប្រើដើម្បីបង្កើតឯកសារ JSON សម្រាប់ Minecraft Mod Mods រួមទាំងធាតុផ្ទាល់ខ្លួនប្លុកនិងអង្គភាព។ មានប្រយោជន៍ខ្លាំងណាស់សម្រាប់មិនត្រឹមតែការបង្កើតអ្នកតាក់ស៊ីផ្ទាល់ខ្លួនប៉ុណ្ណោះទេប៉ុន្តែសម្រាប់ MODS ផងដែរតាមរយៈមុខងារប្តូរឈ្មោះ Mod ។",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "បទពិសោធន៍អប់រំរបស់ខ្ញុំ",
                "text": "ទន្ទឹមនឹងគម្រោងផ្ទាល់ខ្លួនរបស់ខ្ញុំខ្ញុំក៏បានទទួលបានជំនាញជាច្រើនពីបទពិសោធន៍នៃការអប់រំផងដែរ។ ចុចត្រង់នេះដើម្បីមើលទម្រង់ LinkedIn របស់ខ្ញុំសម្រាប់ព័ត៌មានបន្ថែម។",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "បទពិសោធន៍វិជ្ជាជីវៈរបស់ខ្ញុំ",
                "text": "ទន្ទឹមនឹងគម្រោងផ្ទាល់ខ្លួនរបស់ខ្ញុំខ្ញុំក៏បានទទួលបានជំនាញជាច្រើនពីបទពិសោធន៍វិជ្ជាជីវៈផងដែរ។ ចុចត្រង់នេះដើម្បីមើលទម្រង់ LinkedIn របស់ខ្ញុំសម្រាប់ព័ត៌មានបន្ថែម។",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "គេហទំព័រផលប័ត្រ Patrick Goodwin",
                "text": "គេហទំព័រនេះគឺជាគេហទំព័ររបស់ផលប័ត្រផ្ទាល់ខ្លួនរបស់ខ្ញុំដែលបានបង្កើតឡើងដោយមានប្រតិកម្ម .js ។ គម្រោងនេះត្រូវបានប្រើដើម្បីបង្ហាញជំនាញនិងគម្រោងរបស់ខ្ញុំក៏ដូចជាផ្តល់នូវវេទិកាសម្រាប់និយោជកសក្តានុពលទាក់ទងខ្ញុំផងដែរ។ គម្រោងនេះត្រូវបានប្រើដើម្បីបង្កើតវត្តមានរបស់វិជ្ជាជីវៈតាមអ៊ិនធរណេត។",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "បណ្ណាល័យស្គ្រីបរបស់ Patrick របស់ Patrick",
                "text": "បណ្ណាល័យមានប្រយោជន៍នៃស្គ្រីប Lua សម្រាប់ជាឯកសារយោងនាពេលអនាគត។ បណ្ណាល័យនេះត្រូវបានប្រើដើម្បីធ្វើឱ្យភារកិច្ចស្វ័យប្រវត្តិកម្មក្នុងស្គ្រីប LUA ដែលអាចមកងាយស្រួលសម្រាប់ភារកិច្ចដែលត្រូវការការសម្តែងព្រោះថា Lua ជាភាសាស្គ្រីបដែលលឿនជាង Python និង Ruby ។",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "សៀវភៅបញ្ជីសៀវភៅបញ្ជីសៀវភៅបញ្ជីរបស់លោក Patrick របស់ Patrick (VBA)",
                "text": "បណ្ណាល័យដែលមានប្រយោជន៍នៃស្គ្រីប VBA សម្រាប់ក្រុមហ៊ុន Microsoft Excel ។ បណ្ណាល័យនេះត្រូវបានប្រើដើម្បីស្វ័យប្រវត្តិកម្មភារកិច្ចក្នុងសៀវភៅបញ្ជី Excel ។",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "កំណត់រចនាសម្ព័ន្ធ Neovim របស់ Patrick",
                "text": "ការកំណត់រចនាសម្ព័ន្ធផ្ទាល់ខ្លួនរបស់ខ្ញុំ Neovim ។ គម្រោងនេះត្រូវបានប្រើដើម្បីកំណត់រចនាសម្ព័ន្ធ NeoviM តាមការចូលចិត្តរបស់ខ្ញុំរួមទាំងការចងខ្សែគ្រាប់ចុចស្បែកនិងកម្មវិធីជំនួយ។ គម្រោងនេះត្រូវបានប្រើដើម្បីធ្វើឱ្យ Neovim កាន់តែងាយស្រួលប្រើនិងមានប្រសិទ្ធភាពសម្រាប់ការប្រើប្រាស់ផ្ទាល់ខ្លួនរបស់ខ្ញុំ។",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "ម៉ាស៊ីនភ្លើងផែនទីរបស់លោក Patrick",
                "text": "ម៉ាស៊ីនភ្លើងខោនធីនិងរដ្ឋសហរដ្ឋអាមេរិកដែលបង្កើតឡើងដោយប្រើពស់ថ្លាន់ដោយប្រើបណ្ណាល័យ Geopandas និង MatPlotlib ។ គម្រោងនេះត្រូវបានប្រើដើម្បីបង្កើតផែនទីសហរដ្ឋអាមេរិករួមទាំងផែនទីស្រុកនិងរដ្ឋផង។ គម្រោងនេះត្រូវបានប្រើដើម្បីបង្កើតផែនទីផ្ទាល់ខ្លួនសម្រាប់ការមើលឃើញនិងការវិភាគទិន្នន័យ។",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "បណ្ណាល័យស្គ្រីប PowerShell របស់ Pultickel",
                "text": "បណ្ណាល័យដែលមានប្រយោជន៍នៃស្គ្រីប PowerShell សម្រាប់ជាឯកសារយោងនាពេលអនាគត។ មានប្រយោជន៍ជាមួយនឹងលក្ខណៈពិសេសស្គ្រីប Profulfory ខ្ញុំឃើញថានេះមានប្រយោជន៍យ៉ាងខ្លាំងសម្រាប់ការងារស្វ័យប្រវត្តិកម្មពីស្ថានីយវីនដូនៅពេលដែលខ្ញុំជាអ្នកប្រើប្រាស់ប្រព័ន្ធប្រតិបត្តិការ Windows ប្រព័ន្ធប្រតិបត្តិការញឹកញាប់។",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "បណ្ណាល័យស្គ្រីប Ruby របស់ Patrick",
                "text": "បណ្ណាល័យដែលមានប្រយោជន៍នៃស្គ្រីប Ruby សម្រាប់ជាឯកសារយោងនាពេលអនាគត។ មានប្រយោជន៍សម្រាប់ត្បូងមរកតនាពេលអនាគតលើគំនិតនៃការអភិវឌ្ឍផ្លូវដែក។",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "អ្នកសាងសង់ជំនាញ PDF",
                "text": "អ្នកសាងសង់ PDF ផ្ទាល់ខ្លួនដែលបានបង្កើតឡើងដោយ Python តាមរយៈផ្នែកបន្ថែម PDFKIT និង Jinja2 រួមជាមួយការធ្វើទ្រង់ទ្រាយ HTML និង JSON ។ គម្រោងនេះត្រូវបានប្រើដើម្បីបង្កើតឯកសារ PDF ពីបញ្ជីនៃជំនាញនិងគម្រោង។ គម្រោងនេះអាចត្រូវបានប្រើដើម្បីបង្កើតប្រវត្តិរូប PDF ផ្ទាល់ខ្លួនដែលមានប្រយោជន៍ខ្លាំងណាស់សម្រាប់កម្មវិធីការងារ។",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "គម្រោងអ៊ិនគ្រីប Rijandel",
                "text": "គ្រួសារដែលមានបទពិសោធន៍ 10+ នៃក្បួនដោះស្រាយអ៊ិនគ្រីប Rijandel ក្នុងឆ្នាំ 128 ឆ្នាំ 192 និង 256 ប៊ីត។ គម្រោងនេះត្រូវបានប្រើដើម្បីបង្ហាញក្បួនដោះស្រាយអ៊ិនគ្រីប Rijandel ក្នុងភាសាសរសេរកម្មវិធីផ្សេងៗគ្នា។ គម្រោងនេះត្រូវបានប្រើដើម្បីបង្កើតក្រុមគ្រួសារនៃការអនុវត្តន៍ក្បួនដោះស្រាយអ៊ិនគ្រីប Rijandel ។",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Minecraft Minecraft Minecraft",
                "text": "Minecraft Mod ដែលបន្ថែមឧបករណ៍ផ្ទាល់ខ្លួនគ្រឿងសឹកហ្វូងរថយន្តប្លុកវិមាត្រនិងលក្ខណៈពិសេសជាច្រើនទៀតសម្រាប់ហ្គេម។ បានបង្កើតឡើងជាមួយនឹងកំណែចាវ៉ា 8-17 សម្រាប់ជ្រើសរើសយកកំណែ Minecraft ចន្លោះពី 1,16 និង 1.20 ។",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "ភាសាកម្មវិធីខ្លា",
                "text": "ភាសាសរសេរកម្មវិធីផ្ទាល់ខ្លួនដែលបានកសាងឡើងទាំង GO និងច្រែះដើម្បីពិសោធន៍តាមការរចនាម៉ូដនិងអ្នកបកប្រែផ្ទាល់មាត់។ បានអនុវត្តនៅលើគេហទំព័រផលប័ត្រដោយប្រើការជួបប្រជុំគ្នានៅលើគេហទំព័រ។",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "គេហទំព័រកាត់ដេរកាត់ដេរឧបករណ៍កាត់ដេរ",
                "text": "គេហទំព័រមួយដែលខ្ញុំបានសាងសង់នៅឆ្នាំ 2024 សម្រាប់ខ្លា Tigigating Pross ដែលជាក្រុមហ៊ុនកាត់ដេរនៅ Clemson SC SC ។ បានបង្កើតឡើងដោយមានប្រតិកម្ម .js ។",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "គម្រោងម៉ាស៊ីន Turing",
                "text": "ការអនុវត្តន៍គ្រួសារដែលមានជាង 30+ នៃម៉ាស៊ីន Turing ។ ធ្លាប់បង្ហាញពីភាពពេញលេញនៃការធ្វើឱ្យមានភាពពេញលេញសម្រាប់ភាសាសរសេរកម្មវិធីផ្សេងៗគ្នាសម្រាប់ការស្រាវជ្រាវជាពិសេសសម្រាប់ភាសាកម្មវិធីខ្លា។",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "ភាសាកម្មវិធីខ្លា"
    },
    "contact": {
        "title": "ទាក់ទងមកខ្ញុំ",
        "header": "ព័ត៌មានទំនាក់ទំនង",
        "email": "pattygsocials@gmail.com",
        "description": "ខ្ញុំឆ្លើយតបនឹងការសាកសួរពីអ៊ីម៉ែល, LinkedIn, សារនិងសារ Instagram ។ ខ្ញុំក៏នឹងហៅមកវិញប្រសិនបើលេខរបស់ខ្ញុំត្រូវបានផ្តល់តាមរយៈប្រវត្តិរូបសង្ខេបឬបើមិនដូច្នេះទេទោះបីខ្ញុំចង់រក្សាលេខទូរស័ព្ទរបស់ខ្ញុំជាឯកជនក៏ដោយ។"
    },
    "formatter": {
        "title": "ទុីនិងយ៉ាំម",
        "description": "ទំរង់ JSON និង YAML គឺជាឧបករណ៍មួយដែលអនុញ្ញាតឱ្យអ្នកធ្វើទ្រង់ទ្រាយឯកសារ JSON និង YAML ។ វាត្រូវបានសាងសង់ឡើងដោយប្រើហើយ webassembly ហើយវាត្រូវបានរចនាឡើងឱ្យលឿននិងមានប្រសិទ្ធភាព។ សំណុំបែបបទនេះត្រូវបានរចនាឡើងដើម្បីងាយស្រួលប្រើ, ជាមួយនឹងចំណុចប្រទាក់សាមញ្ញដែលអនុញ្ញាតឱ្យអ្នកបិទភ្ជាប់នៅក្នុងកូដ Json ឬ Yaml របស់អ្នកហើយធ្វើទ្រង់ទ្រាយវាដោយចុចប៊ូតុង។",
        "more_info1": "សម្រាប់ព័ត៌មានបន្ថែមសូមមើលការអានកម្មវិធីអាន",
        "more_info2": "ឃ្លាំងទម្រង់ JSON / YAML ។",
        "format_as": "ទ្រង់ទ្រាយជា:",
        "auto_detect": "រកឃើញដោយស្វ័យប្រវត្តិ",
        "format": "រតង់រតាយ"
    },
    "cube_solver": {
        "title": "Rubix Cube Solver",
        "start": "ដោហរសាយ"
    },
    "tiger": {
        "title": "ភាសាខ្លា",
        "description": "ភាសាកម្មវិធីខ្លាគឺជាភាសាសរសេរកម្មវិធីផ្ទាល់ខ្លួនដែលត្រូវបានសាងសង់ឡើងទាំង GO និងច្រែះដើម្បីពិសោធន៍តាមការរចនាម៉ូដអ្នកបកប្រែនិងដំណើរការ។ បានអនុវត្តនៅលើគេហទំព័រផលប័ត្រដោយប្រើការជួបប្រជុំគ្នានៅលើគេហទំព័រ។ ភាសាកម្មវិធីខ្លាគឺជាភាសាសរសេរកម្មវិធីផ្ទាល់ខ្លួនដែលត្រូវបានសាងសង់ឡើងទាំង GO និងច្រែះដើម្បីពិសោធន៍តាមការរចនាម៉ូដអ្នកបកប្រែនិងដំណើរការ។ បានអនុវត្តនៅលើគេហទំព័រផលប័ត្រដោយប្រើការជួបប្រជុំគ្នានៅលើគេហទំព័រ។",
        "more_info1": "សម្រាប់ព័ត៌មានបន្ថែមសូមមើលការអានកម្មវិធីអាន",
        "more_info2": "ភាសា Tiger Proview ឃ្លាំង Githb ភាសា។",
        "select_engine": "ជ្រើសរើសម៉ាស៊ីន:",
        "tiger_code": "លេខកូដ Tiger:",
        "run_tiger": "រត់ខ្លា",
        "output": "លទ្ធផល:"
    },
    "tab": {
        "title": "Gatrick Goodwin",
        "description": "វិស្វករផ្នែកទន់ពេញដែលមានមូលដ្ឋាននៅខេត្តផ្លរីដាកណ្តាល"
    },
    "copy": {
        "text": "ការចម្លង",
        "copied": "បានថតចម្លង!"
    },
    "social_media": {
        "github": "github",
        "instagram": "បន្ដោហ្វបេម",
        "linkedin": "LinkedIn",
        "tiktok": "តាកាខេ",
        "youtube": "youtube",
        "text_strip": "តាមខ្ញុំ"
    },
    "languages": {
        "title": "អ្នកបកប្រែផលប័ត្រ",
        "description": "ស្វែងយល់ពីរបៀបដែលផលប័ត្ររបស់ខ្ញុំអាចចូលទៅកាន់អ្នកទេសចរពីជុំវិញពិភពលោកដោយមានការគាំទ្រជាង 100 ភាសា។",
        "global_accessibility": {
            "title": "ភាពងាយស្រួលសម្រាប់សកល",
            "description": "ផលប័ត្ររបស់ខ្ញុំមាននៅលើ {រាប់} ភាសាធ្វើឱ្យអ្នកចូលមើលអ្នកទេសចរមកពីជុំវិញពិភពលោក។ វិធីសាស្រ្តពហុភាសានេះបង្ហាញពីការប្តេជ្ញាចិត្តរបស់ខ្ញុំចំពោះការរួមបញ្ចូលនិងសកលក្នុងការអភិវឌ្ឍន៍កម្មវិធី។",
            "stats": {
                "languages_supported": "គាំទ្រភាសា",
                "countries_represented": "ប្រទេសតំណាង",
                "continents_covered": "ទ្វីបដែលបានគ្របដណ្តប់"
            }
        },
        "features": {
            "title": "លក្ខណៈពិសេស",
            "items": [
                {
                    "title": "ការបកប្រែពិត:",
                    "description": "ប្តូរភាសាភ្លាមៗជាមួយកម្មវិធីជ្រើសរើសភាសា"
                },
                {
                    "title": "ភាសាផ្អែកលើ URL:",
                    "description": "ចំណូលចិត្តភាសាត្រូវបានរក្សាទុកនៅក្នុង URL"
                },
                {
                    "title": "ការគាំទ្រស្គ្រីបដើមកំណើត:",
                    "description": "ការបង្ហាញស្គ្រីបឱ្យបានត្រឹមត្រូវដូចជាអារ៉ាប់ចិនហិណ្ឌូនិងច្រើនទៀត"
                },
                {
                    "title": "ភាពប្រែប្រួលវប្បធម៌:",
                    "description": "ការបកប្រែពិចារណាលើបរិបទវប្បធម៌មិនមែនគ្រាន់តែមានន័យប្រហាក់ប្រហែលទេ"
                },
                {
                    "title": "SEO ប្រសើរឡើង:",
                    "description": "វ៉ារ្យ៉ង់ភាសានីមួយៗត្រូវបានធ្វើឱ្យប្រសើរសម្រាប់ម៉ាស៊ីនស្វែងរក"
                }
            ]
        },
        "world_map": {
            "title": "ផែនទីពិភពលោកអ៊ីនធ័រណេត",
            "description": "សំកាំងលើបណ្តាប្រទេសនៅលើផែនទីដើម្បីមើលភាសាដែលគាំទ្ររបស់ពួកគេ:",
            "languages_label": "បដា",
            "legend": {
                "supported": "គាំទ្រភាសា",
                "not_supported": "គ្មានការគាំទ្រភាសា"
            },
            "zoom_controls": {
                "zoom_in": "ពង្រីកក្នុង",
                "zoom_out": "Zoom ចេញ",
                "reset": "កំណត់ទិដ្ឋភាពឡើងវិញ"
            }
        },
        "supported_languages": {
            "title": "ភាសាដែលគាំទ្រ"
        },
        "interactive_country_map": {
            "title": "ផែនទីប្រទេសអន្តរកម្ម",
            "description": "ដាក់នៅលើបណ្តាប្រទេសខាងក្រោមដើម្បីមើលភាសាដែលគាំទ្ររបស់ពួកគេ:",
            "language_count": {
                "single": "ផាសា",
                "multiple": "បដា"
            }
        },
        "tooltips": {
            "no_language_support": "គ្មានការគាំទ្រភាសា"
        }
    },
    "logotext": "តតនាក"
}