{
    "name": "Патрик Гудвин",
    "menu": {
        "home": "Негизги бет",
        "about": "Мен жөнүндө",
        "portfolio": "Портфолио",
        "projects": "Вебсайттын долбоорлору",
        "tiger": "Жолборс тили",
        "portfolio_translator": "Portfolio Котормочу",
        "formatter": "JSON & YAML Форматтоо",
        "cube_solver": "Rubix Cube Solver",
        "contact": "Мага байланыш"
    },
    "home": {
        "title": "Негизги бет",
        "animated": {
            "first": "Толук Stack Программасынын инженери",
            "second": "Веб иштеп чыгуучу",
            "third": "Оюн иштеп чыгуучу",
            "fourth": "Мазмун жаратуучу"
        },
        "footer": "Вебсайт азыр 100+ тилде которулган жана кошумча!",
        "descriptionA": "Иштеп жаткан өнүгүү долбоорунун натыйжалуу долбоорун баштан кечирген толук долбоорлор жана веб-иштеп чыгуучу",
        "descriptionB": "Мындан тышкары, мен географияны, бир нече социалдык медиа платформаларынын алгоритмдерин, анын ичинде инстаграммды, YouTube жана Tiktok компаниясын ийгиликтүү пайдаланган, анын ичинде инстаграмманын, YouTube жана Tiktok компаниясын ийгиликтүү жүргүзүп, алгашым.",
        "portfolio_button": "Менин портфолио",
        "contact_button": "Мага байланыш",
        "about_button": "Мен жөнүндө"
    },
    "about": {
        "title": "Мен жөнүндө",
        "personal_summary": {
            "title": "Жеке кыскача",
            "text": "Орландо шаарында жайгашкан Тажрыйбалуу стек программасынын негизинде, мен ар кандай технологиялар боюнча тажрыйбаны, Java жана C ++ менен тажрыйба менен тааныштырдым, Racest.js жана node.js. Найбалчанчылардын рекорлуктары, анын ичинде JAVACATIALE программасын иштеп чыгуу жана жүк ташуучу унаа айдоочулар үчүн Java Modification программасынын өнүгүшү менен, мен лидерликти жана инновацияны көрсөттүмүн. Долбоорду башкаруу, комплекстүү көйгөйлөрдү чечип, колдонуучулардын тажрыйбасын өркүндөтүү жана уюштуруучулук ийгиликке жетишкендигин өркүндөтүү мүмкүнчүлүгүмдө, мен комплекстүү көйгөйлөрдү чечип, жогорку сапаттагы чечимдерди аткарып, жогорку сапаттагы чечимдерди талап кылат."
        },
        "professional_experience": {
            "title": "Кесиптик тажрыйба",
            "entries": [
                {
                    "jobtitle": "Junial программалык камсыздоо",
                    "where": "Orion180 камсыздандыруу",
                    "date": "2024 - белек"
                },
                {
                    "jobtitle": "Уюштуруучу жана толук стек программалык камсыздоочу",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Толук Stack Программасынын инженери",
                    "where": "Үйрөнүүнү тездетүү",
                    "date": "2023"
                },
                {
                    "jobtitle": "Коргошундун веб-иштеп чыгуучусу (Студенттик программа)",
                    "where": "Клемсон университетинин GDI программасы",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Деңиз жетекчиси",
                    "where": "Клемсон Университети",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Деңиз жетекчиси",
                    "where": "Клемсон Университети",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Техникалык көндүмдөр",
            "header1": "Программалоо тилдери",
            "header2": "FALSWORKS & Китепканалар",
            "header3": "Куралдар жана технологиялар"
        },
        "services": {
            "title": "Менин кызматтарым",
            "entries": [
                {
                    "title": "Толук стик инженерия",
                    "text": "Мен бардык программалык стектин ичиндеги интеграциялоонун жана функционалдык стектин ичиндеги интеграциядан жана функционалдуулукту камсыз кылуу боюнча мен ар тараптуу өнүгүү жана функцияларды камсыз кылуу үчүн комплекстүү чечимдерди сунуштайм."
                },
                {
                    "title": "Веб өнүгүү",
                    "text": "HTML, CSS, CSS жана JavaScript алкактары менен, мен кардарлардын өзгөчөлүктөрүнө жана артыкчылыктары менен таанышуу үчүн ылайыкташтырылган визуалдык жагымдуу жана колдонуучуга ыңгайлуу веб-сайттарды көрүүгө болот."
                },
                {
                    "title": "Оюнду иштеп чыгуу",
                    "text": "JAVA жана C ++ сыяктуу левингдерди иликтөө, мен чөлгө айланган оюндарды, концепциядан жана дизайндан, концепциядан жана дизайндан жана ойнотууну жана жылмакай иш-аракетти камсыздоого адистешкен адистештирилген адистешкен."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Портфолио",
        "filter_by": "Filter Portfolio by:",
        "entries": {
            "biblioteca": {
                "title": "BIBLIOTECA JSON",
                "text": "Тил котормолорду үзүп турган Python долбоору. Менин веб-сайттын портфелимди, анын ичинде испан, француз, кытай, араб тилдерине которула турууга мүмкүндүк берет. Бул долбоор көп тилдүү веб-сайттын портфелин түзүү үчүн колдонулат, бул кенен аудиторияга жетүү үчүн абдан пайдалуу. Бул долбоор менен дүйнөнүн 99% дан ашыгы менин портфелимди эркин сүйлөй алат.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Төрт туташыңыз",
                "text": "Төрт оюндун 50дөн ашык+ иш-чарасынын 50дөн ашуун иштери боюнча чоң үй-бүлө. Бул долбоорго 30дан ашуун программалоо тилдеринде, анын ичинде Java, C ++, Python, JavaScript жана андан жогору. Мындан тышкары, ал ошондой эле 20дан ашык+ ар кандай алкактарды же башка форматтарды, анын ичинде RACECT.JS, Ruby, Ruby, ASP.NET жана андан жогору.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "Азык-түлүк колдонмосу",
                "text": "Толук толук стек .НЕНТИ 9 Blazor Server Server тиркемеси азык-түлүк товарларын башкаруу. Өтүнмө контроллер / кызмат / репозиторий үлгүдөгү субъективдүүлүк үчүн өздүк деңгээлдеги өзөктүк өзөктүк менен, ар тараптуу сыноо топтомун камтыйт.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Interop долбоору",
                "text": "Ар кандай программалоо тилдеринин ортосунда өз ара аракеттенүүнү документтер. Учурда 15 ар кандай программалоо тили жана 18 аткаруу үлгүлөрү камтылган.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Инвентардык реестр",
                "text": "Толук-Stack Demo Pechint (POS) Ийгиликсиз 17+ жана Node.JS менен курулган инвентаризацияны башкаруу тутуму менен катталуу. Бул колдонмо профессионалдык-баа-диастрандыкты тастыктоо, ролго негизделген мүмкүнчүлүктүн көзөмөлү, инвентардык көзөмөлдөө жана шылдыңдоо чараларын иштеп чыгуу.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "JSON & YAML авто форматтоочу",
                "text": "JSON & YAML файлдарына байланыштуу шилтемелер жана сайттык. Бул долбоор JSON & YAML файлдарын форматтоо үчүн колдонулат, бул кодду таза жана уюшкандыкта жүргүзүү үчүн абдан пайдалуу. Вебазсем менен түзүлүп, барган менен курулган жана менин портфелимди веб-сайт Долбоору катары киргизди. Келечекте көбүрөөк форматтар бар.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft Joson Generator",
                "text": "Жеңил Json Gener Minecraft Resurce & Data Packs үчүн курулган Бул долбоор JSON файлдарын, анын ичинде бажы буюмдары, блоктор жана субъекттер үчүн JSON файлдарын түзүү үчүн колдонулат. Өзгөчөлөштүрүлгөн берилиштерлерди түзүүнү гана эмес, модалар үчүн Mods үчүн, Mod Name которуштуруу өзгөчөлүгү аркылуу.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Менин билим берүү тажрыйбам",
                "text": "Менин жеке долбоорлорум менен бирге билим берүү тажрыйбасынан көптөгөн көндүмдөрдү алдык. Көбүрөөк маалымат алуу үчүн менин LinkedIn профилимди көрүү үчүн бул жерди бас.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Менин кесиптик тажрыйбам",
                "text": "Менин жеке долбоорлорум менен бирге, мен дагы кесиптик тажрыйбанын көптөгөн көндүмдөрүн алдык. Көбүрөөк маалымат алуу үчүн менин LinkedIn профилимди көрүү үчүн бул жерди бас.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Патрик Гудвиндин портфолиосу",
                "text": "Бул веб-сайт - бул менин жеке портфелима веб-сайты, REACTH.S. Бул долбоор менин жөндөмүмө жана долбоорлорумду көрсөтүүгө, ошондой эле мүмкүн болуучу иш берүүчүлөр үчүн мен менен байланышуу үчүн аянтчаны көрсөтүү үчүн колдонулат. Бул долбоор профессионалдык онлайн катышуусун түзүү үчүн колдонулат.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Патриктин Луа скринин китепканасы",
                "text": "Келечектеги шилтеме үчүн Луа скриптинин пайдалуу китепканасы. Бул китепкана луа муктаждыктарына ыңгайлуу тапшырмаларды аткарууга мүмкүнчүлүк берүү үчүн колдонулат, анткени Луа, адатта, питон менен Рубиге караганда тезирээк сценарийлүү тилде болот.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Патриктин Microsoft Excel электрондук жадыбал (VBA)",
                "text": "Microsoft Excel үчүн VBA сценарийлеринин пайдалуу китепканасы. Бул китепкана Excel электрондук жадыбалындагы тапшырмаларды автоматташтыруу үчүн колдонулат.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Патриктин Неовим Конфигурациясы",
                "text": "Менин жеке Неовим конфигурациям. Бул долбоор Небимди жактырыш үчүн, анын ичинде бажы баскычтары, темалар жана плагиндерди жактырыш үчүн колдонулат. Бул долбоор NEOVIM көбүрөөк колдонуучуга ыңгайлуу жана жеке колдонуу үчүн натыйжалуу жасоо үчүн колдонулат.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Патриктин карта генератору",
                "text": "Геопандаларды жана Матплотлиб китепканаларын колдонуп, Python менен курулган АКШ округу жана штатынын County & Мамлекеттик карта генератору. Бул долбоор АКШнын карталарын, анын ичинде округдун жана мамлекеттик карталарды түзүүдө колдонулат. Бул долбоор маалыматтарды визуалдаштыруу жана талдоо үчүн атайын карталарды түзүү үчүн колдонулат.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Патриктин Пауершелл скрипталдык китепканасы",
                "text": "Келечектеги шилтеме үчүн PowerShell сценарийлеринин пайдалуу китепканасы. $ Profile Script өзгөчөлүгү менен пайдалуу, мен Windows OS тез-тез колдонуучуга бат-баттан турган тапшырмаларды автоматташтыруучу тапшырмаларды автоматташтырууга жардам берем.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Патриктин Руби скрипкасы",
                "text": "Келечектеги шилтеме үчүн Ruby Scripts пайдалуу китепканасы. Рельстердин келечектеги Ruby үчүн пайдалуу, өнүгүү түшүнүктөрү.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF көндүмдөрүн куруучу",
                "text": "PDFKIT жана JINJA2 аркылуу, HTML жана JSON форматтоосу аркылуу PDFKIT жана JINJA2 аркылуу курулган салт боюнча PDF куруучусу. Бул долбоор PDF файлдарын көндүмдөрдүн тизмесинен жана долбоорлордун тизмесинен алуу үчүн колдонулат. Бул долбоорго жумушчу тиркемелер үчүн абдан пайдалуу, бул долбоорду PDF резюмесин түзүү үчүн колдонсо болот.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandel Шифрлөө долбоору",
                "text": "Риандел шифрлөө алгоритминин 10 жаштагы үй-бүлөсү 128, 192 жана 256 бит. Бул долбоор Рижандел шифрлөөнүн алгоритмин ар кандай программалоо тилдеринде көрсөтүү үчүн колдонулат. Бул долбоор Rijandel шифрлөө алгоритминин ишке ашырылган үй-бүлөсүн түзүү үчүн колдонулат.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod",
                "text": "Максаттуу куралдарды, курал-жарак, моб, блокторду, блокторду, бир өлчөмдү жана көптөгөн мүмкүнчүлүктөрдү кошкон minecraft minecraft. Java версиялары менен курулган 8-17 нускалар 116 жана 1.20 ортосундагы Minect версиялары үчүн курулган.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tiger программалоо тили",
                "text": "Бажы программалоо тили, бейпилдикте жана датда курулган Веб-монтаж менен портфолиодогу веб-сайтта ишке ашырылды.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger Tailgating Inspet веб-сайты",
                "text": "2024-жылы мен 2024-жылы, жолборс талдоо үчүн, Клемсон шаарындагы тигүүчү компания, мен курган. REAST.JS менен курулган.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Тургун машина долбоору",
                "text": "Туринг машинанын 30дан ашык+ иш-чарасынын үй-бүлөсү. Изилдөө үчүн ар кандай программалоо тилдерине, айрыкча жолборстун программалоо тили үчүн толуктоону көрсөтүү үчүн колдонулат.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tiger программалоо тили"
    },
    "contact": {
        "title": "Мага байланыш",
        "header": "Байланыш маалыматы",
        "email": "pattygsocials@gmail.com",
        "description": "Электрондук почта, LinkedIn кабарларын жана инстаграм кабарларын суроого жооп берем. Эгерде менин номерим резюме аркылуу берилсе же башка жол менен берилсе, мен дагы чалып, мен телефон номеримди сактоону жактырам."
    },
    "formatter": {
        "title": "JSON & YAML Форматтоо",
        "description": "JSON & YAML FORGTER - бул сизге JSON жана YAML файлдарын форматтоого мүмкүнчүлүк берген курал. Ал барып, вебазсизм менен курулган жана ал тез жана натыйжалуу болууга ылайыкталган. Форматтоочу жоссон же ямл кодуңузда пастасын чаптаңыз жана баскычты чыкылдатып, баскычты чыкылдатуу менен колдонууга мүмкүндүк берүүчү интерфейс колдонууга мүмкүндүк берет.",
        "more_info1": "Көбүрөөк маалымат алуу үчүн, Rainme'ди караңыз",
        "more_info2": "JSON / YAML форматтоочулардын репозиториясы.",
        "format_as": "Форматы:",
        "auto_detect": "Авто аныктоо",
        "format": "Формат"
    },
    "cube_solver": {
        "title": "Rubix Cube Solver",
        "start": "Чечүү"
    },
    "tiger": {
        "title": "Жолборс тили",
        "description": "Жолборс программалоо тили - бул бажы программалоо тили - Бузулган программалоо тили, котормочу дизайнын жана аткаруу менен экспериментке эксперимент жүргүзүү үчүн эки жолу басылган программалоо тили. Веб-монтаж менен портфолиодогу веб-сайтта ишке ашырылды. Жолборс программалоо тили - бул бажы программалоо тили - Бузулган программалоо тили, котормочу дизайнын жана аткаруу менен экспериментке эксперимент жүргүзүү үчүн эки жолу басылган программалоо тили. Веб-монтаж менен портфолиодогу веб-сайтта ишке ашырылды.",
        "more_info1": "Көбүрөөк маалымат алуу үчүн, Rainme'ди караңыз",
        "more_info2": "Tiger программалоо тили Гитуб репозиторийи.",
        "select_engine": "Моторду тандаңыз:",
        "tiger_code": "Tiger Code:",
        "run_tiger": "Жолборс",
        "output": "Чыгуу:"
    },
    "tab": {
        "title": "Патрик Гудвин",
        "description": "Флорида борбордук флоридада жайгашкан толук стек программалык инженери"
    },
    "copy": {
        "text": "Көчүрүү",
        "copied": "Көчүрүлгөн!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Тикток",
        "youtube": "YouTube",
        "text_strip": "Мени ээрчи"
    },
    "languages": {
        "title": "Portfolio Котормочу",
        "description": "Менин портфелимдин 100дөн ашык тилди колдоо менен, менин портфолио кандайча жеткиликтүүлүгүнө жете алат.",
        "global_accessibility": {
            "title": "Дүйнөлүк жеткиликтүүлүк",
            "description": "Менин портфолио {санынын} тилдеринде жеткиликтүү, бул дүйнө жүзүндөгү конокторго кире алат. Бул көп тилдүү ыкма программалык камсыздоону иштеп чыгууда инклюзивдүүлүккө жана дүйнөлүк мүмкүн болгон милдеттенемин көрсөтөт.",
            "stats": {
                "languages_supported": "Тилдер колдоого алынган",
                "countries_represented": "Көрсөтүлгөн өлкөлөр",
                "continents_covered": "Континенттер капталган"
            }
        },
        "features": {
            "title": "Өзгөчөлүктөр",
            "items": [
                {
                    "title": "Чыныгы убакыт котормосу:",
                    "description": "Тилди тилди селектор менен тез-тез заматта жөнөтүңүз"
                },
                {
                    "title": "URL негизделген тил:",
                    "description": "Тил каалоолору URLде сакталат"
                },
                {
                    "title": "Жергиликтүү сценарийди колдоо:",
                    "description": "Араб, кытай, хинди жана башкалар сыяктуу сценарийлерди туура берүү"
                },
                {
                    "title": "Маданий сезгичтик:",
                    "description": "Котормолор кадимки маанилерди эмес, маданий контекст деп эсептешет"
                },
                {
                    "title": "SEO Optimized:",
                    "description": "Ар бир тил варианты издөө системалары үчүн оптималдаштырылган"
                }
            ]
        },
        "world_map": {
            "title": "Interactive World Map",
            "description": "Картадагы өлкөлөрдүн эсебинен аларды колдоо үчүн өздөрүнүн тилдерин көрүү үчүн:",
            "languages_label": "Тилдер",
            "legend": {
                "supported": "Тилдер колдоого алынган",
                "not_supported": "Тилдин колдоосу жок"
            },
            "zoom_controls": {
                "zoom_in": "Кичирейтүү",
                "zoom_out": "Кичирейтүү",
                "reset": "Баштапкы абалга келтирүү"
            }
        },
        "supported_languages": {
            "title": "Колдоого алынган тилдер"
        },
        "interactive_country_map": {
            "title": "Интерактивдүү Өлкө картасы",
            "description": "Алардын колдоого алынган тилдерин көрүү үчүн төмөндөгү өлкөлөрдүн курамына түшүңүз:",
            "language_count": {
                "single": "тил",
                "multiple": "Тилдер"
            }
        },
        "tooltips": {
            "no_language_support": "Тилдин колдоосу жок"
        }
    },
    "logotext": "Патрик"
}