{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "In domo",
        "about": "Circa me",
        "portfolio": "Portfolio",
        "projects": "Website Projects",
        "tiger": "Linguam tigris",
        "formatter": "Json & Yaml Formatter",
        "contact": "Contact mihi"
    },
    "home": {
        "title": "In domo",
        "animated": {
            "first": "Full Stack Software ipsum",
            "second": "Web elit",
            "third": "Ludum Developer",
            "fourth": "Creator"
        },
        "footer": "Website autem translata & Avaliable in 100 Linguae!",
        "descriptionA": "Peritus plena-Stack Software ipsum & Web Developer cum demonstratum history of prospere ducens progressionem projects, a partum Java modifications ad Minecraft et exsequendam confectam user usus in reactly et exsequendam agilitatem methodologies et efficax dolor.",
        "descriptionB": "Praeterea, ego sum a Geography content Creator qui habet feliciter leverithms de multiple socialis media tabulatis adlevatae, inter instagram, YouTube, et Tiktok, ut lucrari et congressum sectem.",
        "portfolio_button": "Mihi portfolio",
        "contact_button": "Contact mihi",
        "about_button": "Circa me"
    },
    "about": {
        "title": "Circa me",
        "personal_summary": {
            "title": "Personalis Summary",
            "text": "Ut peritus plena Stack Software Developer secundum Orlandus, FL, Ego demonstrandum peritia in variis technologiae, a Java et C ++ ad react.js et node.js Cum autem semita recordum spearheunding projects, comprehendo in progressionem a Java modificatio progressio ad Minecraft et retribuendo website pro salsissimus vir vivens, Ego showcased ducibus et innovation. Mihi commitment ad excellentiam constare potest in facultatem ad streamline Project Management, solve complex problems et eripere summus qualitas solutions quod augendae user experientia et coegi norma res."
        },
        "professional_experience": {
            "title": "Professional experientia",
            "entries": [
                {
                    "jobtitle": "Junior Software ipsum",
                    "where": "Orion180 Insurance",
                    "date": "MMXXIV - praesens"
                },
                {
                    "jobtitle": "Founder & plena Stack Software Developer",
                    "where": "Supemc",
                    "date": "MMXX - MMXXIV"
                },
                {
                    "jobtitle": "Full Stack Software ipsum",
                    "where": "Accelerate doctrina",
                    "date": "MMXXIII"
                },
                {
                    "jobtitle": "Duc Web Developer (Discipulus Program)",
                    "where": "Clemson University GDI Program",
                    "date": "MMXXI - MMXXII"
                },
                {
                    "jobtitle": "Desk Supervisor",
                    "where": "Clemson University",
                    "date": "MMXXI - MMXXII"
                }
            ]
        },
        "technical_skills": {
            "title": "Technical artes",
            "header1": "Programming Linguae",
            "header2": "& Frameworks libraries",
            "header3": "Tools & Technologies"
        },
        "services": {
            "title": "Mea Services",
            "entries": [
                {
                    "title": "Full Stack Engineering",
                    "text": "Offero comprehensive solutiones trans fronte finem et retro finem progressionem, cursus seamless integrationem et functionality per totum software ACERVUS."
                },
                {
                    "title": "Web Development",
                    "text": "Cum peritiam in HTML, css, et JavaScript frameworks sicut react.js, ego Craft uisum blanda et user-amica websites tailored in occursum clients 'specifica et preferences."
                },
                {
                    "title": "Development",
                    "text": "Leveraging linguae ut Java et C ++, ego specialize in creando immersive ludum experientias, ex conceptu et consilio ad exsequendam et ipsum, ensuring commoratur ludo et lenis perficientur."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfolio",
        "filter_by": "Filter Portfolio By:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca JSON",
                "text": "A Python Project quod REIPLINES Lingua Translations. Permittit enim meum Website Portfolio ut translati in 70+ Linguae, inter Hispanica, Gallica, Chinese, Arabica et multis aliis. Hoc project adhibetur creare multilingual Website Portfolio, quod est valde utilis ad extendens latius auditorium. Cum hoc project, super XCIX% mundi potest legere meum portfolio in fluens lingua.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Coniungere quatuor",
                "text": "Massive Genus de 50 Exemplum ex Iungo quattuor ludum. Hoc project includit implementations in super XXX diversis programming linguis, inter Java, C ++, Python, JavaScript, et magis. Praeterea, etiam includit super 20+ alia frameworks vel formats, comprehendo react.js, Ruby in cancellos, asp.net et magis.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Interop Project",
                "text": "A project ut documenta interopability inter diversis programming linguis. Currently includit XV diversis programming linguis et XVIII supplicium exemplaria.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "Json & Yaml Auto Formatter",
                "text": "A Linter & autoformatter for JSON & YAML files. Hoc project adhibetur ad Format JSON & YAML files, quod est valde utilis ad observatio codice mundum et organized. Built ire, cum webassembly composuit, et embedded in portfolio sicut a website project. Magis formats ut in futurum.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft Json generans",
                "text": "Lightweight JSon generans aedificavit in Python ad Minecraft Resource & data sarcinas. Hoc project adhibetur ad generare Json files enim Minecraft mods, inter mos items, caudices et entia. Valde utile non solum creando mos Datapacks, sed mods ut bene per mod nomen switching pluma.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Mea educational experientia",
                "text": "Latere mei personalis projects, ego quoque have acquiritur numerosis artes ex educational experientia. Click here to view mea LinkedIn Profile pro magis notitia.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Mihi professional experientia",
                "text": "Latere meo personalis projects, ego quoque have acquiritur numerosis artes ex professional experientia. Click here to view mea LinkedIn Profile pro magis notitia.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Goodwin Portfolio Website",
                "text": "Hoc website est personalis Portfolio website, aedificavit cum react.js. Hoc project adhibetur ad showcase mea artes et projects, tum providere a suggestu ad potentiale laboris locatores ut contact me. Hoc project adhibetur creare professional online praesentia.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patrick Lua scriptor Library Lua",
                "text": "A utile Library de Luam Scriptor pro futuro reference. Hoc bibliotheca adhibetur ad Automate tasks in Luam Scriptor, quod potest venire in manus in perficientur-eget eget, ut Luale est plerumque a citius scripting verbis quam utroque Pythone et Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrick Microsoft Excel Spreadsheet Script (VBA)",
                "text": "A utile Library of VBA scripta ad Microsoft Excel. Hoc bibliotheca adhibetur ad Automate tasks in Excel Spreadsheets.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Patrick scriptor Neovim aboutconfig",
                "text": "Mihi personalis neovim configuratione. Hoc project adhibetur ad configurare neovim ad mea sententia, inter mos keybindings, themata, et plugins. Hoc project adhibetur ut neovim magis user-amica et efficient pro personalis usum.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patrick scriptor tabula generantis",
                "text": "A Civitatibus Foederatis Americae Comitatus & rei publicae Map Generator, aedificavit Python per Geopandas et matplotlib libraries. Hoc project adhibetur ad generate maps de Civitatibus Foederatis Americae, comprehendo comitatu et statu maps. Hoc project adhibetur creare mos maps pro notitia visualization et analysis.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patrick scriptor PowerShell scriptor Library",
                "text": "A utile Library of PowerShell scriptor for futurum reference. Utile cum $ Profile Feature, ut inveniam hanc immensum utile pro automating tasks ex Fenestra Terminatio, sicut ego sum crebris user de Fenestra OS.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patrick scriptor Ruby scriptor Library",
                "text": "A utile Library de Ruby scriptor futurum reference. Utile pro futuro Ruby in Rails Developmental conceptus.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF artes aedificator",
                "text": "A consuetudo PDF conditor aedificavit Python per PDFKIT et Jinja2 extensiones, latere HTML et JSON Formatting. Hoc project est ad generate PDF files a album ex artes et projects. Hoc project potest esse creare consuetudo PDF resumere, quod est valde utilis ad officium applications.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandel encryption Project",
                "text": "A familia 10+ implementations de Rijandel encryption algorithm in CXXVIII, CXCII et CCLVI bits. Hoc project adhibetur ad demonstrabo Rijandel encryption algorithm in diversis programming linguis. Hoc project adhibetur ad partum a familia implementations de Rijandel encryption algorithm.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc minecraft mod",
                "text": "Minecraft Mod quod adiungit consuetudinem instrumenta, armis, mobs, cuneos, dimensiones, et plura features ad ludum. Esset Java versions 8-17 Select Minecraft versions inter 1.16 et 1,20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tigris programming language",
                "text": "Custom Programming Lingua Built in utroque ire & rubigo ad experimentum cum interpres consilio et perficientur. Implemented in portfolio Web Web Conventus.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tigris Tailgating Pros W",
                "text": "A website et aedificavi in ​​MMXXIV enim Tigris Tailgating pros, A Tailgating Company in Clemson, SC. Aedificavit cum react.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing Machina Project",
                "text": "Familia de super 30+ implementations Turing apparatus. Ad demonstrabo Turing complessencity pro diversis programming linguis ad investigationem, praesertim ad Tigris programming language.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tigris programming language"
    },
    "contact": {
        "title": "Contact mihi",
        "header": "Contactus notitia",
        "email": "pattygsocials@gmail.com",
        "description": "Respondeo inquirit ab inscriptio, LinkedIn Messages et Instagram dispenses. Ego quoque et vocant retro, si mihi numerum provisum per aliquam vel aliter, quamquam Malo ut meum phone numerus privatis."
    },
    "formatter": {
        "title": "Json & Yaml Formatter",
        "description": "Et Json & Yaml Formatter est instrumentum quod concedit vobis in forma JSON et YAML files. Est aedificatum ire et Webassembly et quod disposito esse ieiunium et efficient. Formatter quod disposuerat ut facile ad usum, cum simplex interface quod concedit ut crustulum in Json aut Yaml Code et format illud cum click a button.",
        "more_info1": "Nam magis notitia, ad readme in",
        "more_info2": "JSON / YAML Formatter Repository.",
        "format_as": "Format ut:",
        "auto_detect": "Auto deprehendere",
        "format": "Format"
    },
    "tiger": {
        "title": "Linguam tigris",
        "description": "Et Tigris programming lingua est consuetudo programming language in utroque ire & rubigo ad experimentum cum interpres consilio et perficientur. Implemented in portfolio Web Web Conventus. Et Tigris programming lingua est consuetudo programming language in utroque ire & rubigo ad experimentum cum interpres consilio et perficientur. Implemented in portfolio Web Web Conventus.",
        "more_info1": "Nam magis notitia, ad readme in",
        "more_info2": "Tigris programming language GitHub repositum.",
        "select_engine": "Select Engine:",
        "tiger_code": "Tigris Code:",
        "run_tiger": "Run tigris",
        "output": "Output:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Software Full Software fundatur in Central Florida"
    },
    "copy": {
        "text": "Effingo",
        "copied": "Copied!"
    },
    "social_media": {
        "github": "Gitub",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Sequere me"
    },
    "logotext": "Patricius"
}