{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Doheem",
        "about": "Iwwer mech",
        "portfolio": "Portfolio",
        "tiger": "Tiger Sprooch",
        "contact": "Verkaf mech"
    },
    "home": {
        "title": "Doheem",
        "animated": {
            "first": "Voll Stack Software Ingenieur",
            "second": "Web Entwéckler",
            "third": "Spillentwéckler",
            "fourth": "Inhalt Creator"
        },
        "descriptionA": "Huet vollstänneg Teams-Software a effektiv Teamkompetenze mat Erfolleg vun der erfollegräich Konventiounsprojuatiounen ze maachen.",
        "descriptionB": "Zousätzlech, ech sinn e Geographie Inhalt Creator deen den Algorithmen vu méi soziale Media Plattformen erfollegräich verstoppt huet, inklusiv Instagram, YouTube, fir en respektabelen ze kréien.",
        "portfolio_button": "Mäi Portfolio",
        "contact_button": "Verkaf mech",
        "about_button": "Iwwer mech"
    },
    "about": {
        "title": "Iwwer mech",
        "personal_summary": {
            "title": "Perseinerhandwäit",
            "text": "Als erlieft vollstruck Software Entwéckler baséiert am Orlando, fl, ech hunn Expertise a verschiddene Technologien, aus Java an C +Js.js.js.js.js. Mat engem Streck Rekord vun der Spuerprojeten, dorënner d'Entwécklung vun der Entwécklung vun engem Java Modifikatiounsprogramm fir Minecraft an eng belount Websäit fir Camion Chauffeuren an Innovatioun an Innovatioun. Meng engagement fir exzellente ze schécken ass evident a mengem Funktionnell Prozis-Prozes (niddergänglech Probleemer, déi héichwäerteg Léisungen net verbesseren a Organisatioun eng Noriicht ze liwweren."
        },
        "professional_experience": {
            "title": "Beruffserfahrung",
            "entries": [
                {
                    "jobtitle": "Junior Software Ingenieur",
                    "where": "Orion180 Versécherung",
                    "date": "2024 - präsent"
                },
                {
                    "jobtitle": "Grënner & voll Stack Software Entwéckler",
                    "where": "Ieweschte Wand",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Voll Stack Software Ingenieur",
                    "where": "Beschleunegen Léieren",
                    "date": "2023"
                },
                {
                    "jobtitle": "Lead Web Entwéckler (Student Programm)",
                    "where": "Clemson University GDI Programm",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Desk Supervisor",
                    "where": "Clemson Universitéit",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Technem Fäegkeeten",
            "header1": "Programméieren",
            "header2": "Framewierker & Bibliothéiken",
            "header3": "Tools & Technologien"
        },
        "services": {
            "title": "Meng Servicer",
            "entries": [
                {
                    "title": "Voll Stack Engagement",
                    "text": "Ech bidden ëmfaassend Léisungen uewe béide Fridden an der lénker Entwécklung, garantéiert semmlos Integratioun a Funktionalitéit am ganzen Software Stack."
                },
                {
                    "title": "WebTaf vun der Websäit",
                    "text": "Mat Expertise am Expilise an CTLL, CS an Javascript Fraktrode wéi Reages, ech hefft visuell a Verëffentlechung vis-à-vis vun de Clienten."
                },
                {
                    "title": "Spilldatement",
                    "text": "Krichter a Sproochen wéi Java a C ++, ech spezialiséiert am Beispill Immererveryer ze kreéieren an d'Ëmsetzung an Shopberatung, déi spacings a Soumissioun entwéckelt huet."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfolio",
        "filter_by": "Filter Portfolio vum:",
        "entries": {
            "connect_four": {
                "title": "Connect véier",
                "text": "Massiv Famill vun iwwer 50+ Impenementer vun der Connect Véier Spill. This project includes implementations in over 30 different programming languages, including Java, C++, Python, JavaScript, and more. Zousätzlech enthält et och iwwer 20+ verschidde Fraasies oder aner Formater, inklusiv Reaktiv, Rubnen, Rëndfleësch, APNO fir ze reiwen, a méi.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Interop Projet",
                "text": "E Projet deen d'Dokumenteraktivitéite tëscht verschiddene Programméierungsproochen tëscht verschiddene Propressiounen. Aktuell enthält 15 verschidde Programméierungssproochen an 18 Ausféierungsmutsch.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "excel_scripts": {
                "title": "Microsoft Excel Spreadsheet Scripte (VBA)",
                "text": "Eng nëtzlech Bibliothéik vu VBA Scripten fir Microsoft Excel. Dës Bibliothéik gëtt benotzt fir Aufgaben an Excel Spreadsheeten ze automatiséieren.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "minecraft_json_generator": {
                "title": "MINECRAFT JSON Generator",
                "text": "Liichtgewiicht Jon Generator huet am Python fir Minecraft Ressource & Datenpäck gebaut. Dëse Projet gëtt benotzt fir d'JSLSE Dateien fir Minecraft Mods ze generéieren, dorënner Benotzerdefinéiert, Späicher, an Entitéiten. Neier Nëtzlech fir net nëmmen eenzel Sënn kreéiere kann awer fir Modbis och iwwer den Modnumm agespaart.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Meng pädagogesch Erfahrung",
                "text": "Niewent meng perséinlech Projete hunn ech och vill Fäegkeeten aus edukativ Erfahrung ze kréien. Klickt hei fir mäi LinkedIn Profil fir méi Informatioun ze gesinn.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Meng professionell Erfahrung",
                "text": "Zwee Deeg fannt och vill Projeten, wou ech och Ghess keng Fäegkeeten iwwerhale hunn. Klickt hei fir mäi LinkedIn Profil fir méi Informatioun ze gesinn.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Goodwin Portfolio Websäit",
                "text": "Dës Websäit ass meng perséinlech Portfolio Websäit, gebaut mat Reakt. Dëse Projet gëtt benotzt fir meng Fäegkeeten a Projeten ze weisen, souwéi eng Plattform fir potenziell Patronen ze liwweren fir mech ze kontaktéieren. Dëse Projet gëtt benotzt fir eng professionell Online Präsenz ze kreéieren.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Dem Patrick seng Lua Skript Bibliothéik",
                "text": "Eng nëtzlech Bibliothéik vun der Lua Scripten fir zukünfteg Referenz. An dëser Bibliothéik gëtt benotzt fir Aufgaben ze automatiséieren, déi profitéieren, déi profesch maache kënnen, aus Leeschtung, wéi LHA ass normalerweis eng méi séier e méi séier Python an",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "neovim_config": {
                "title": "Dem Patrick säin Neovim Configur",
                "text": "Meng perséinlech Neovim Konfiguratioun. Dëse Projet gëtt benotzt fir Neovim op meng Léifsten ze konfiguréieren, inklusive Keybindungen, Themen, a Plugins. Dëse Projet gëtt benotzt fir nevim méi benotzerfrëndlech an effizient fir meng perséinlech Benotzung ze maachen.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Dem Patrick säi Kaart Generator",
                "text": "Eng US County & Staat Kaarten, generativ, gebaut mat Python mat der Geython mat der Gopoven- a Matplondibibaribliibien. Dëse Projet gëtt benotzt fir Kaarten vun den USA ze generéieren, abegraff Grofschaft a Staatskaarten. Dëse Projet gëtt fir personaliséiert Kaarten fir Daten Visualiséierung an Analyse ze kreéieren.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Dem Patrick seng Powershell Skript Bibliothéik",
                "text": "Eng nëtzlech Bibliothéik vun der Powerhell Scripte fir zukünfteg Referenz. Natierlech mat der $ Profilfunkt Fece Feature fannt ech dës impertë mirwierklech fir Excecen vum Windows umellen ze.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Dem Patrick seng Rubin Skript Bibliothéik",
                "text": "Eng nëtzlech Bibliothéik vu Rubin Scripte fir zukünfteg Referenz. Nëtzlech fir zukünfteg Rubin iwwer Rüstteuropäesch Konzepter.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF Fäegkeeten Builder",
                "text": "E personaliséierte PDF Builder gebaut mat Python iwwer de PDFKIT an Jinja2 Extensiounen, laanscht HTML an JSON Formatéierung. Dëse Projet gëtt benotzt fir PDF Dateien aus enger Lëscht vu Fäegkeeten a Projeten ze generéieren. Dëse Projet ka benotzt gi fir e personaliséierten PDF Resumé ze kreéieren, wat ganz nëtzlech ass fir d'Applikatioun Uwendungen.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rjandel Verschlësselungsprojet",
                "text": "Eng Famill vun 10+ Impenementer vum Rijande Verschlësselung Algorithmus an 128, a 25,7 Stéck. Dëse Projet gëtt benotzt fir d'Rijande Verrotung Algorithmus a verschiddene Programméierungssprooch ze demonstréieren. Dëse Projet gëtt benotzt fir eng Famill vun der Ëmsetzung vum Rjandel-Verschlësselung Algorithmus ze kreéieren.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Ieweschtemmc Minecraft Mod",
                "text": "En Minecragwraze Mod deen néideg Tools, Borschen, DOBS, Bärderen, d'Dollensiounen, a wéi vill verschidde verschidde Funktiounen zum Spill. Gebaut mat Java Versiounen 8-17 fir Wielt Minecraft Versiounen tëscht 1,16 an 1,20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tiger Programméierungsprogramm",
                "text": "Benotzerdefinéiert Programming Sprooch gebaut a béid Go & Rust fir ze experimentéieren mat der Interprister Design a Leeschtung. Ëmgesat op der Portfolio Websäit mat Webversammlung.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger tailgating Pro Websäit",
                "text": "Eng Websäit déi ech an 2024 hunn fir Tiger tailgatative Virdeeler, eng tailgating Firma zu Clemson, sc. Gebaut mat Reaktioun.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing Maschinnprojet",
                "text": "Famill vun iwwer 30+ Implementatiounen vun der Turing Maschinn. Benotzt fir dem Antwort Teedung fir verschidde Sprooche Sprooch fir d'Fuerschung, besonnesch fir déi Tigelle Programméierung.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tiger Programméierungsprogramm"
    },
    "contact": {
        "title": "Verkaf mech",
        "header": "Kontakt-Informatioun",
        "email": "Pattygsoscials@gmail.com",
        "description": "Ech äntweren op Ufro vun E-Mail, Linkedin Messagen, an Instagram Messagen. Ech ruffen och zréck wann meng Nummer iwwer Resumé oder soss gëtt, obwuel ech léiwer meng Telefonsnummer privat halen."
    },
    "tiger": {
        "title": "Tiger Sprooch",
        "description": "Déi tiger Programmentprooch ass eng personaliséiert Programmingsprooch déi a béide Go & Rust mat interpretent Design an der Leeschtung eropgeet. Ëmgesat op der Portfolio Websäit mat Webversammlung. Déi tiger Programmentprooch ass eng personaliséiert Programmingsprooch déi a béide Go & Rust mat interpretent Design an der Leeschtung eropgeet. Ëmgesat op der Portfolio Websäit mat Webversammlung.",
        "more_info1": "Fir méi Informatioun, bezitt sech op de LadMme an der",
        "more_info2": "Tiger Programméierungsprogramm Gith Repository.",
        "select_engine": "Wielt Motor:",
        "tiger_code": "Tiger Code:",
        "run_tiger": "Run Tiger",
        "output": "Ausgang:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Voll Stack Software Ingenieur baséiert an der Zentralflorida"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Komm mir no"
    },
    "logotext": "Patrick"
}