{
    "name": "Patrick Goodwin .",
    "menu": {
        "home": "Ndako",
        "about": "Na ntina na ngai .",
        "portfolio": "Portefeuille .",
        "projects": "Ba projets ya site internet .",
        "tiger": "Lingala ya Tigre .",
        "formatter": "Mobongisi ya JSON & YAML .",
        "cube_solver": "Solveur ya cube ya Rubix .",
        "contact": "Contactez moi ."
    },
    "home": {
        "title": "Ndako",
        "animated": {
            "first": "Ingénieur logiciel ya stack mobimba .",
            "second": "Mobongisi ya web .",
            "third": "Mobongisi ya masano .",
            "fourth": "Mokeli ya makambo oyo ezali na kati ."
        },
        "footer": "Site internet sikoyo ebongolami & ekoki ko avalibler na 100+ minoko!",
        "descriptionA": "Expérimenté Full-Stack Software Engineer & Web Developer na histoire oyo elakisami ya ko diriger ba projets ya développement na succès, kobanda na kosala ba modifications ya Java mpo na Minecraft tii na ko améliorer expérience ya usager na React.js mpe ko mettre en œuvre ba APIs ya REST ya sécurité, tout en employant constamment ba méthodologies agile mpe collaboration efficace ya équipe.",
        "descriptionB": "En plus, nazali mokeli ya contenus ya géographie oyo alongi ko leverager ba algorithmes ya ba plateformes ya ba médias sociaux ebele, na kati na yango Instagram, YouTube, na Tiktok, mpo na kozua base ya balandi ya respectable mpe engageant.",
        "portfolio_button": "Portefeuille na ngai .",
        "contact_button": "Contactez moi .",
        "about_button": "Na ntina na ngai ."
    },
    "about": {
        "title": "Na ntina na ngai .",
        "personal_summary": {
            "title": "Bokuse ya moto ye moko .",
            "text": "Lokola développeur ya logiciel ya stack complet expérimenté basé na Orlando, FL, na lakisi expertise na ba technologies ndenge na ndenge, kobanda na Java na C++ tii na React.js na node.js. Na track record ya ba projets ya dirigeant, na kati na yango développement ya programme ya modification ya Java mpo na Minecraft mpe site internet ya rewarding mpo na ba chauffeurs ya ba camions, na lakisaki leadership mpe innovation. Komipesa na ngai na excellence ezali komonana na makoki na ngai ya ko simplifier gestion ya projet, ko résoudre ba problèmes complexes, mpe ko livrer ba solutions ya qualité ya likolo oyo ematisaka expérience ya usager mpe ezo diriger succès ya organisation."
        },
        "professional_experience": {
            "title": "Expérience professionnelle .",
            "entries": [
                {
                    "jobtitle": "Ingénieur logiciel ya ba jeunes .",
                    "where": "Orion180 Assurance .",
                    "date": "2024 - ya lelo ."
                },
                {
                    "jobtitle": "Mobandisi & Mobongisi ya logiciel ya stack mobimba .",
                    "where": "Suprememc .",
                    "date": "2020 - 2024 ."
                },
                {
                    "jobtitle": "Ingénieur logiciel ya stack mobimba .",
                    "where": "Kokita na yango nokinoki .",
                    "date": "2023 ."
                },
                {
                    "jobtitle": "Lead Web Developer (Programme ya ba étudiants) .",
                    "where": "Programme ya GDI ya Université ya Clemson .",
                    "date": "2021 - 2022 ."
                },
                {
                    "jobtitle": "Mokambi ya mesa .",
                    "where": "Iniversite ya Clemson .",
                    "date": "2021 - 2022 ."
                },
                {
                    "jobtitle": "Mokambi ya mesa .",
                    "where": "Iniversite ya Clemson .",
                    "date": "2021 - 2022 ."
                }
            ]
        },
        "technical_skills": {
            "title": "Makoki ya tekiniki .",
            "header1": "Minɔkɔ ya programɛ .",
            "header2": "Ba cadres & ba bibliothèques .",
            "header3": "Bisaleli mpe mayele ya sika ."
        },
        "services": {
            "title": "Misala na ngai .",
            "entries": [
                {
                    "title": "Ingénierie ya Stack mobimba .",
                    "text": "Nazali kopesa ba solutions complètes na kati ya développement ya front-end mpe ya back-end, ko assurer intégration sans soudure mpe fonctionnalité na kati ya stack ya logiciel mobimba."
                },
                {
                    "title": "Développement ya web .",
                    "text": "Na mayele na HTML, CSS, mpe JavaScript cadres lokola react.js, nasala na maboko ba site internet oyo ezali kobenda likebi mpe oyo ezali malamu mpo na kosalela oyo ebongisami mpo na kokokisa bamposa mpe bolingi ya sikisiki ya ba clients."
                },
                {
                    "title": "Bokoli ya masano .",
                    "text": "Kosalela minoko lokola Java mpe C++, nazali kosala mingi na kokela ba expériences ya jeux immersives, kobanda na concept mpe design kino na mise en œuvre mpe optimisation, ko assurer engagement ya jeu mpe performance ya malamu."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portefeuille .",
        "filter_by": "Filtre Portefeuille na:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca JSON .",
                "text": "Projet ya Python oyo ebongisi mabongoli ya nkota. Epesi nzela na portefeuille ya site internet na ngai ebongolama na minoko 70+, kati na yango Espagnol, Français, Chinois, Arabe, mpe mingi mosusu. Projet oyo esalelamaka pona kosala portefeuille ya site internet ebele, oyo ezali na tina mingi pona ko rejoindre audience ya monene. Na projet oyo, plus de 99% ya mokili ekoki kotanga portefeuille na ngai na langue fluide.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Bokanga minei .",
                "text": "Libota ya massive ya plus de 50+ implémentations ya Connect Four Game. Projet oyo ezali na ba mises en œuvre na ba langues ya programmation koleka 30, na kati na yango Java, C++, Python, JavaScript, mpe mingi mosusu. En plus, ezali pe na ba cadres koleka 20+ différents to ba formats misusu, y compris React.js, Ruby on Rails, ASP.NET, pe ebele.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "Application ya biloko ya kolia .",
                "text": "Application ya .NET 9 Blazor Server ya mobimba mpo na kotambwisa biloko ya kolia. Application elandi modèle ya contrôleur/service/repository na entite Framework Core pona persistance pe esangisi suite ya test ya mobimba.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Projet ya interop .",
                "text": "Projet oyo ekomaka interopérabilité entre ba langues de programmation différentes. Sikoyo ezali na ba langues de programmation 15 différentes na ba modèles ya exécution 18.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Registre ya inventaire .",
                "text": "Point de vente ya démonstration ya stack mobimba (POS) registre na système ya gestion ya inventaire oyo etongami na Angular 17+ na Node.js. Application oyo ezali kolakisa système POS ya qualité professionnelle na authentification ya usager, contrôle ya accès basé na rôle, suivi ya stock, na traitement ya payement ya mock.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "JSON & YAML AUTO formateur .",
                "text": "A linter & Autoformatter mpo na ba fichiers JSON & YAML. Projet oyo esalelamaka pona ko formater ba fichiers JSON & YAML, oyo ezali très utile pona ko garder code propre pe organisé. Etongamaki na Go, esangisi na webassembly, mpe ekotisami na portefeuille na ngai lokola projet ya site internet. Ba formats mingi oyo ekoya na mikolo ekoya.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON Générateur .",
                "text": "Générateur ya JSON ya poids léger oyo etongami na Python mpo na ba packs ya ressource & ya ba données ya Minecraft. Projet oyo esalelamaka pona kobimisa ba fichiers JSON pona ba mods ya Minecraft, na kati na yango biloko ya kosala, ba blocs, pe ba entités. Très utile pona ko créer kaka ba packs ya ba données personnalisées te, mais pona ba mods lokola via fonctionnalité ya commutation ya kombo ya mod.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Expérience na ngai ya éducation .",
                "text": "Pembeni ya misala na ngai moko, nazwi mpe ebele ya makoki uta na mayele ya mateya. Bo finga awa pona komona profil na ngai ya LinkedIn pona ba informations ebele.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Expérience professionnelle na ngai .",
                "text": "Na ngambo ya ba projets na ngai personnels, nazui pe ba compétences ebele na expérience professionnelle. Bo finga awa pona komona profil na ngai ya LinkedIn pona ba informations ebele.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Site ya portefeuille ya Patrick Goodwin .",
                "text": "Site oyo ezali site na ngai ya portefeuille personnel, oyo etongami na react.js. Projet oyo esalelamaka pona kolakisa mayele pe ba projets na ngai, pe lisusu pona kopesa plateforme na ba potentiels ba patrons pona ko contacter ngai. Projet oyo esalelamaka pona kosala présence professionnelle en ligne.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Bibliothèque ya script ya Lua ya Patrick .",
                "text": "Bibliothèque ya malamu ya ba scripts ya LUA mpo na référence na mikolo ekoya. Bibliothèque oyo esalelamaka pona ko automatiser ba tâches na ba scripts ya LUA, oyo ekoki kozala na tina pona ba tâches ya performance-dedesse, lokola Lua ezalaka mingi mingi langue ya scripting ya mbangu koleka Python na Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Ba scripts ya feuille de calcul ya Microsoft Excel ya Patrick (VBA)",
                "text": "Bibliothèque ya malamu ya ba scripts ya VBA mpo na Microsoft Excel. Bibliothèque oyo esalemaka pona ko automatiser ba tâches na ba feuilles de calcul Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Config ya Neovim ya Patrick .",
                "text": "Configuration na ngai ya Neovim personnel. Projet oyo esalemaka pona ko configurer Neovim na goût na ngai, y compris ba keybindings personnalisés, ba thèmes, na ba plugins. Projet oyo esalemaka pona kosala que Neovim ezala plus confortable et efficace pona usage personnel na ngai.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Générateur ya carte ya Patrick .",
                "text": "Générateur ya carte ya etuka ya Etats-Unis & ya l’Etat, etongami na Python na kosalelaka ba bibliothèques ya Geopandas mpe Matplotlib. Projet oyo esalelamaka pona kobimisa ba cartes ya Etats-Unis, na kati na yango ba cartes ya etuka pe ya l’Etat. Projet oyo esalelamaka pona kosala ba cartes personnalisées pona visualisation ya ba données pe analyse.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patrick's Powershell Script Bibliothèque .",
                "text": "Bibliothèque ya malamu ya ba scripts ya PowerShell mpo na référence na mikolo ekoya. Utile na fonctionnalité ya script ya $profile, namoni oyo esalisaka mingi pona ba misala ya automatiser na terminal ya Windows, lokola nazali usager fréquent ya Windows OS.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Bibliothèque ya script ya Ruby ya Patrick .",
                "text": "Bibliothèque ya malamu ya ba scripts ya Ruby mpo na référence na mikolo ekoya. Utile pona futur Ruby na ba concepts ya développement ya Rails.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF Makoki Motongi .",
                "text": "Motongi ya PDF oyo esalemi na kolanda bamposa ya bato oyo etongami na Python na nzela ya ba extensions PDFKIT mpe Jinja2, pembeni ya formatage HTML mpe JSON. Projet oyo esalelamaka pona kobimisa ba fichiers PDF na liste ya ba compétences pe ba projets. Projet oyo ekoki kosalelama pona kosala CV PDF personnalisé, oyo ezali na tina mingi pona ba applications ya misala.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Projet ya chiffrement ya Rijandel .",
                "text": "Libota ya 10+ implémentations ya algorithme ya chiffrement ya Rijandel na 128, 192, na 256 bits. Projet oyo esalelamaka pona kolakisa algorithme ya chiffrement ya Rijandel na ba langues ya programmation différentes. Projet oyo esalemi pona kosala famille ya ba mises en œuvre ya algorithme ya chiffrement ya Rijandel.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod .",
                "text": "Mod moko ya Minecraft oyo ebakisi bisaleli oyo esalemi na kolanda bamposa ya bato, bibundeli, bituluku ya bato, ba blocs, ba dimensions, mpe makambo mosusu mingi na lisano. Etongami na ba versions ya Java 8-17 mpo na ba versions ya Minecraft oyo eponami kati na 1.16 mpe 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Langue de programmation de tigre .",
                "text": "Langage de programmation personnalisé construit dans les deux Go & Rust mpo na ko expérimenter conception ya interprète mpe performance. Esalemi na site internet ya portefeuille na kosalelaka Assemblée Web.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger tailgating pros site internet .",
                "text": "Site internet moko natongaki na 2024 mpo na Tiger Tailgating Pros, société ya tailgating na Clemson, SC. Etongami na React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Projet ya machine ya Turing .",
                "text": "Libota ya koleka 30+ ba mises en œuvre ya machine ya Turing. Esalemi mpo na kolakisa turing completeness mpo na minoko ndenge na ndenge ya programmation mpo na bolukiluki, mingimingi mpo na langage ya programmation ya tigre.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Langue de programmation de tigre ."
    },
    "contact": {
        "title": "Contactez moi .",
        "header": "Ba informations ya contact .",
        "email": "pattygsocials@gmail.com",
        "description": "Nayanolaka na mituna uta na email, ba messages ya LinkedIn, mpe ba messages ya Instagram. Nakobenga mpe lisusu soki nimero na ngai epesami na nzela ya CV to na ndenge mosusu, atako nalingaka kobatela nimero na ngai ya telefone na privé."
    },
    "formatter": {
        "title": "Mobongisi ya JSON & YAML .",
        "description": "Formateur JSON & YAML ezali esaleli oyo epesaka yo nzela ya ko formater ba fichiers JSON mpe yaml. Etongami na Go mpe WebAssembly, mpe esalemi mpo na kozala mbangu mpe malamu. Formateur esalemi mpo na kozala pete mpo na kosalela, na interface moko ya pete oyo epesaka yo nzela ya ko coller na code JSON to yaml na yo mpe ko formater yango na clique ya bouton.",
        "more_info1": "Mpo na koyeba makambo mosusu, talá na README oyo ezali na .",
        "more_info2": "Bobombi ya formateur ya JSON/YAML.",
        "format_as": "Format lokola:",
        "auto_detect": "Auto Détecter",
        "format": "Format ."
    },
    "cube_solver": {
        "title": "Solveur ya cube ya Rubix .",
        "start": "Kobongisa"
    },
    "tiger": {
        "title": "Lingala ya Tigre .",
        "description": "Langage ya programmation ya Tigre ezali langage ya programmation personnalisé oyo etongami na Go & Rust mpo na ko expérimenter conception ya interprète mpe performance. Esalemi na site internet ya portefeuille na kosalelaka Assemblée Web. Langage ya programmation ya Tigre ezali langage ya programmation personnalisé oyo etongami na Go & Rust mpo na ko expérimenter conception ya interprète mpe performance. Esalemi na site internet ya portefeuille na kosalelaka Assemblée Web.",
        "more_info1": "Mpo na koyeba makambo mosusu, talá na README oyo ezali na .",
        "more_info2": "Tigre Programmation Language GitHub ebombelo.",
        "select_engine": "Pona Moteur:",
        "tiger_code": "Code ya tigre:",
        "run_tiger": "Kima Tiger .",
        "output": "Bobimisi:"
    },
    "tab": {
        "title": "Patrick Goodwin .",
        "description": "Ingénieur logiciel ya stack mobimba oyo azali na Floride centrale ."
    },
    "copy": {
        "text": "Kopi ya .",
        "copied": "Kosala kopi na yango!"
    },
    "social_media": {
        "github": "GitHub .",
        "instagram": "Instagram .",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok .",
        "youtube": "YouTube .",
        "text_strip": "Bolanda ngai ."
    },
    "logotext": "Patrick ."
}