{
    "name": "ການລົງທືນ",
    "menu": {
        "home": "ບ້ານ",
        "about": "ກ່ຽວກັບຂ້ອຍ",
        "portfolio": "ການລົງທືນ",
        "projects": "ໂຄງການເວບໄຊທ໌",
        "tiger": "ເສືອພາສາ",
        "portfolio_translator": "ນັກແປພາສາ Portfolio",
        "formatter": "ຮູບແບບ JSON & YAML",
        "cube_solver": "Rubix Cube Solver",
        "contact": "ຕິດຕໍ່ຂ້ອຍ"
    },
    "home": {
        "title": "ບ້ານ",
        "animated": {
            "first": "ນັກວິສະວະກອນຊອບແວທີ່ເຕັມຮູບແບບ",
            "second": "ນັກພັດທະນາເວັບໄຊຕ໌",
            "third": "ນັກພັດທະນາເກມ",
            "fourth": "ຜູ້ສ້າງ Creme Content"
        },
        "footer": "ເວບໄຊທ໌ດຽວນີ້ໄດ້ແປແລະມີຄວາມສາມາດໃນການເປັນ 100+ ພາສາ!",
        "descriptionA": "ມີປະສົບການກ່ຽວກັບໂຄງການການພັດທະນາຂອງຜູ້ໃຊ້ຢ່າງສໍາເລັດຜົນໃນການປັບປຸງປະສົບການຂອງ Java.",
        "descriptionB": "ນອກຈາກນັ້ນ, ຂ້າພະເຈົ້າເປັນຜູ້ສ້າງເນື້ອໃນພູມສາດທີ່ປະສົບຜົນສໍາເລັດໃນການຄິດໄລ່ຂອງເວທີສື່ສັງຄົມຫຼາຍຄັ້ງ, ລວມທັງ Instagram, ແລະ Tiktok, ເພື່ອໃຫ້ໄດ້ຮັບພື້ນຖານຂອງຜູ້ຕິດຕາມ.",
        "portfolio_button": "ຫຼັກຊັບຂອງຂ້ອຍ",
        "contact_button": "ຕິດຕໍ່ຂ້ອຍ",
        "about_button": "ກ່ຽວກັບຂ້ອຍ"
    },
    "about": {
        "title": "ກ່ຽວກັບຂ້ອຍ",
        "personal_summary": {
            "title": "ບົດສະຫຼຸບສ່ວນບຸກຄົນ",
            "text": "ໃນຖານະເປັນນັກພັດທະນາໂປແກຼມ Stack ແບບເຕັມຮູບແບບໂດຍອີງໃສ່ Orlando, ຂ້ອຍໄດ້ສະແດງຄວາມຊໍານານໃນເຕັກໂນໂລຢີຕ່າງໆ, ຈາກ Java ແລະ C ++ ເພື່ອປະຕິກິລິຍາ. ດ້ວຍບັນທຶກຕິດຕາມຂອງໂຄງການທີ່ມີຄວາມຫນ້າສົນໃຈ, ລວມທັງໂຄງການດັດແປງ Java ສໍາລັບ Minecraft, ຂ້ອຍໄດ້ໃຫ້ຄວາມເປັນຜູ້ນໍາແລະນະວັດຕະກໍາ. ຄວາມຕັ້ງໃຈຂອງຂ້າພະເຈົ້າຕໍ່ຄວາມເປັນເລີດແມ່ນເຫັນໄດ້ໃນຄວາມສາມາດໃນການຈັດການໂຄງການຂອງຂ້ອຍ, ແກ້ໄຂບັນຫາທີ່ສັບສົນ, ແລະການປະສົບຜົນສໍາເລັດຂອງຜູ້ໃຊ້."
        },
        "professional_experience": {
            "title": "ປະສົບການດ້ານວິຊາຊີບ",
            "entries": [
                {
                    "jobtitle": "ນັກວິສະວະກອນຊອບແວ Junio ​​r",
                    "where": "ການປະກັນໄພ Orion180",
                    "date": "2024 - ປະຈຸບັນ"
                },
                {
                    "jobtitle": "ຜູ້ກໍ່ຕັ້ງ & ນັກພັດທະນາໂປແກຼມ Stack ເຕັມ",
                    "where": "ທິປະແດງສູງ",
                    "date": "ປີ 2020 - 2024"
                },
                {
                    "jobtitle": "ນັກວິສະວະກອນຊອບແວທີ່ເຕັມຮູບແບບ",
                    "where": "ເລັ່ງການຮຽນຮູ້",
                    "date": "2023"
                },
                {
                    "jobtitle": "ຜູ້ພັດທະນາ Web Web (ໂຄງການນັກສຶກສາ)",
                    "where": "ໂຄງການ GDI ມະຫາວິທະຍາໄລ CELLSON FOREST",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "ຜູ້ຄຸມງານໂຕະ",
                    "where": "ມະຫາວິທະຍາໄລ Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "ຜູ້ຄຸມງານໂຕະ",
                    "where": "ມະຫາວິທະຍາໄລ Clemson",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "ທັກສະດ້ານເຕັກນິກ",
            "header1": "ພາສາການຂຽນໂປແກຼມ",
            "header2": "ກອບແລະຫ້ອງສະຫມຸດ",
            "header3": "ເຄື່ອງມືແລະເຕັກໂນໂລຢີ"
        },
        "services": {
            "title": "ການບໍລິການຂອງຂ້ອຍ",
            "entries": [
                {
                    "title": "ວິສະວະກໍາ stack ເຕັມ",
                    "text": "ຂ້າພະເຈົ້າສະເຫນີວິທີແກ້ໄຂທີ່ສົມບູນແບບທົ່ວທັງການພັດທະນາດ້ານຫນ້າແລະດ້ານຫຼັງ, ຮັບປະກັນການເຊື່ອມໂຍງແລະການເຮັດວຽກທີ່ບໍ່ມີປະໂຫຍດຕະຫຼອດໄລຍະທາງ."
                },
                {
                    "title": "ການພັດທະນາເວບໄຊທ໌",
                    "text": "ດ້ວຍຄວາມຊໍານານໃນ HTML, CSS, ແລະ JavaScript Frameworms ເຊັ່ນ react.js, i craft ເວັບໄຊທ໌ທີ່ຫນ້າສົນໃຈແລະເປັນມິດກັບຜູ້ໃຊ້ທີ່ເຫມາະສົມກັບຄວາມຕ້ອງການແລະຄວາມມັກຂອງລູກຄ້າ."
                },
                {
                    "title": "ການພັດທະນາເກມ",
                    "text": "ການໃຊ້ພາສາທີ່ໃຊ້ໃນຂະນະທີ່ Java ແລະ C ++, ຂ້າພະເຈົ້າຊ່ຽວຊານໃນການສ້າງປະສົບການການຫຼີ້ນເກມທີ່ສົມບູນ, ຈາກການຈັດຕັ້ງປະຕິບັດແລະການປະຕິບັດທີ່ສົມບູນແບບ."
                }
            ]
        }
    },
    "portfolio": {
        "title": "ການລົງທືນ",
        "filter_by": "ການກັ່ນຕອງ Portfolio ໂດຍ:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca Json",
                "text": "ໂຄງການ Python ທີ່ກະຕຸ້ນການແປພາສາ. ອະນຸຍາດໃຫ້ໃຊ້ເວບໄຊທ໌ຂອງຂ້ອຍທີ່ຖືກແປເປັນ 70+ ພາສາ, ລວມທັງສະເປນ, ຝຣັ່ງ, ຈີນ, ພາສາຈີນ, ແລະອື່ນໆ, ແລະອື່ນໆ, ແລະອື່ນໆ ໂຄງການນີ້ແມ່ນໃຊ້ເພື່ອສ້າງເວບໄຊທ໌ທີ່ມີຫລາຍຮູບແບບ, ເຊິ່ງເປັນປະໂຫຍດຫຼາຍໃນການເຂົ້າເຖິງຜູ້ຊົມກວ້າງກວ່າ. ດ້ວຍໂຄງການນີ້, ຫຼາຍກວ່າ 99% ຂອງໂລກສາມາດອ່ານຫຼັກຊັບຂອງຂ້ອຍໃນພາສາທີ່ຄ່ອງແຄ້ວ.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "ເຊື່ອມຕໍ່ສີ່",
                "text": "ຄອບຄົວໃຫຍ່ຂອງການຈັດຕັ້ງປະຕິບັດຫຼາຍກວ່າ 50+ ໃນການຈັດຕັ້ງປະຕິບັດຂອງສີ່ເກມເຊື່ອມຕໍ່. ໂຄງການນີ້ປະກອບມີການຈັດຕັ້ງປະຕິບັດໃນ 30 ພາສາການຂຽນໂປແກຼມທີ່ແຕກຕ່າງກັນ, ລວມທັງ Java, C ++, Python, JavaScript, ແລະອື່ນໆ. ນອກຈາກນັ້ນ, ມັນຍັງປະກອບມີຫຼາຍກວ່າ 20+ ກອບທີ່ແຕກຕ່າງກັນຫຼືຮູບແບບອື່ນໆ, ລວມທັງ react.js, ruby ​​ສຸດລາງລົດໄຟ, asp.net, ແລະອື່ນໆ.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "app grocery",
                "text": "ໃບສະຫມັກເຕັມຮູບແບບຄົບຊຸດ. ໃບສະຫມັກດັ່ງກ່າວປະຕິບັດຕາມຮູບແບບຄວບຄຸມ / ບໍລິການ / ຫ້ອງທົດແທນ",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "ໂຄງການ Introp",
                "text": "ໂຄງການທີ່ມີເອກະສານເອກະສານລະຫວ່າງພາສາການຂຽນໂປແກຼມທີ່ແຕກຕ່າງກັນ. ປະຈຸບັນປະກອບມີ 15 ພາສາການຂຽນໂປແກຼມທີ່ແຕກຕ່າງກັນແລະມີ 18 ແບບປະຕິບັດ.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "ລົງທະບຽນສິນຄ້າຄົງຄັງ",
                "text": "ຈຸດທີ່ເຕັມໄປດ້ວຍຕົວຢ່າງຂອງການຂາຍ (POS) ລົງທະບຽນກັບລະບົບການຈັດການສິນຄ້າຄົງຄັງທີ່ສ້າງດ້ວຍມຸມເປັນລ່ຽມ 17+ ແລະ node.j. ຄໍາຮ້ອງສະຫມັກນີ້ສະແດງໃຫ້ເຫັນລະບົບ POS ຊັ້ນຮຽນທີ່ເປັນມືອາຊີບກັບການກວດສອບຄວາມຖືກຕ້ອງຂອງຜູ້ໃຊ້, ການຄວບຄຸມການເຂົ້າເຖິງທີ່ອີງໃສ່ບົດບາດ, ການຕິດຕາມສິນຄ້າຄົງຄັງ, ແລະການປຸງແຕ່ງການຈ່າຍເງິນ.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "ແບບຟອມ JSON & YAML AUTO",
                "text": "ເສັ້ນໃຍແລະອັດຕະໂນມັດສໍາລັບໄຟລ໌ JSON & YAML. ໂຄງການນີ້ແມ່ນໃຊ້ເພື່ອສ້າງຮູບແບບເອກະສານ JSON & YAML, ເຊິ່ງເປັນປະໂຫຍດຫຼາຍສໍາລັບການຮັກສາລະຫັດທີ່ສະອາດແລະຈັດລະບຽບ. ສ້າງດ້ວຍ GO, ລວບລວມກັບ Webassembly, ແລະຝັງເຂົ້າໄປໃນກຸ່ມຂອງຂ້ອຍເປັນໂຄງການເວັບໄຊທ໌້. ຮູບແບບເພີ່ມເຕີມທີ່ຈະມາໃນອະນາຄົດ.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "ເຄື່ອງຈັກຜະລິດໄຟຟ້າ Minecraft Json",
                "text": "JSON Generator ສ້າງໃນ Python ສໍາລັບ Minecraft Packce & Data Pack. ໂຄງການນີ້ແມ່ນໃຊ້ໃນການຜະລິດໄຟລ໌ JSON ສໍາລັບ Minecraft Mods, ລວມທັງສິນຄ້າ, ທ່ອນໄມ້, ແລະຫນ່ວຍງານ. ມີປະໂຫຍດຫຼາຍສໍາລັບບໍ່ພຽງແຕ່ສ້າງຂໍ້ມູນທີ່ກໍານົດເອງເທົ່ານັ້ນ, ແຕ່ສໍາລັບແບບເຊັ່ນດຽວກັນຜ່ານຄຸນນະສົມບັດການປ່ຽນຊື່ mod.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "ປະສົບການດ້ານການສຶກສາຂອງຂ້ອຍ",
                "text": "ຄຽງຄູ່ກັບໂຄງການສ່ວນຕົວຂອງຂ້າພະເຈົ້າ, ຂ້າພະເຈົ້າຍັງໄດ້ຮັບທັກສະຫຼາຍຢ່າງຈາກປະສົບການດ້ານການສຶກສາ. ກົດບ່ອນນີ້ເພື່ອເບິ່ງໂປຣໄຟລ໌ LinkedIn ຂອງຂ້ອຍສໍາລັບຂໍ້ມູນເພີ່ມເຕີມ.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "ປະສົບການດ້ານວິຊາຊີບຂອງຂ້ອຍ",
                "text": "ຄຽງຄູ່ກັບໂຄງການສ່ວນຕົວຂອງຂ້າພະເຈົ້າ, ຂ້າພະເຈົ້າຍັງໄດ້ຮັບທັກສະຫຼາຍຢ່າງຈາກປະສົບການດ້ານວິຊາຊີບ. ກົດບ່ອນນີ້ເພື່ອເບິ່ງໂປຣໄຟລ໌ LinkedIn ຂອງຂ້ອຍສໍາລັບຂໍ້ມູນເພີ່ມເຕີມ.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "ເວັບໄຊທ໌ Patrick Goodwin Portfolio",
                "text": "ເວບໄຊທ໌ນີ້ແມ່ນເວັບໄຊທ໌ PLOCTMOOLIO ສ່ວນຕົວຂອງຂ້ອຍ, ສ້າງດ້ວຍ react.js. ໂຄງການນີ້ແມ່ນໃຊ້ເພື່ອສະແດງທັກສະແລະໂຄງການຂອງຂ້ອຍ, ພ້ອມທັງໃຫ້ເວທີສໍາລັບນາຍຈ້າງທີ່ມີທ່າແຮງຕິດຕໍ່ຂ້ອຍ. ໂຄງການນີ້ແມ່ນໃຊ້ເພື່ອສ້າງຄວາມເປັນມືອາຊີບທາງອິນເຕີເນັດ.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "ຫໍສະມຸດສະມຸດສະບັບ Lua script ຂອງ Patrick script",
                "text": "ຫໍສະມຸດທີ່ເປັນປະໂຫຍດຂອງສະຄິບ LUA ເພື່ອການອ້າງອີງໃນອະນາຄົດ. ຫໍສະມຸດນີ້ຖືກນໍາໃຊ້ເພື່ອອັດຕະໂນມັດວຽກງານໃນສະຄິບທີ່ໃຊ້ສໍາລັບວຽກງານທີ່ຕ້ອງການໂດຍປົກກະຕິ, ຄືກັບພາສາທີ່ມີລາຍລັກສະນະທີ່ໄວກ່ວາທັງ python ແລະ ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "ຕົວອັກສອນ Microsoft Excel ຂອງ Patrick Excel (VBA)",
                "text": "ຫໍສະມຸດທີ່ມີປະໂຫຍດຂອງຫນັງສື VBA scripts ສໍາລັບ Microsoft Excel. ຫໍສະມຸດນີ້ແມ່ນໃຊ້ເພື່ອອັດຕະໂນມັດວຽກງານໃນການຜະລິດທີ່ດີເລີດໃນ Excel Spreadsheets.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "patrick's neovim config",
                "text": "ການຕັ້ງຄ່າ Neovim ສ່ວນຕົວຂອງຂ້ອຍ. ໂຄງການນີ້ແມ່ນໃຊ້ໃນການຕັ້ງຄ່າ NOOVIM ກັບຄວາມມັກຂອງຂ້ອຍ, ລວມທັງການກົດປຸ່ມ, ຫົວຂໍ້, ແລະ plugins. ໂຄງການນີ້ແມ່ນໃຊ້ເພື່ອເຮັດໃຫ້ Neovim ມີຄວາມເປັນມິດກັບຜູ້ໃຊ້ແລະມີປະສິດທິພາບເພີ່ມເຕີມສໍາລັບການນໍາໃຊ້ສ່ວນຕົວຂອງຂ້ອຍ.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "ເຄື່ອງຈັກຜະລິດແຜນທີ່ Patrick",
                "text": "ການສ້າງແຜນທີ່ຂອງສະຫະລັດອາເມລິກາແລະສະຫະລັດອາເມລິກາ, ສ້າງດ້ວຍ Python ໂດຍໃຊ້ຫ້ອງສະຫມຸດ GeoplotLib. ໂຄງການນີ້ແມ່ນໃຊ້ເພື່ອສ້າງແຜນທີ່ຂອງສະຫະລັດອາເມລິກາ, ລວມທັງເຂດປົກຄອງເມືອງແລະລັດ. ໂຄງການນີ້ແມ່ນໃຊ້ເພື່ອສ້າງແຜນທີ່ທີ່ກໍານົດເອງສໍາລັບການເບິ່ງເຫັນຂໍ້ມູນແລະການວິເຄາະ.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "ຫໍສະມຸດ Patrick Powrick PowerShell",
                "text": "ຫໍສະມຸດທີ່ມີປະໂຫຍດຂອງຕົວ PowerShell Scripts ສໍາລັບການອ້າງອີງໃນອະນາຄົດ. ມີປະໂຫຍດກັບຄຸນລັກສະນະຕົວຫນັງສື, ຂ້າພະເຈົ້າເຫັນວ່າສິ່ງນີ້ມີປະໂຫຍດຢ່າງຍິ່ງນີ້ສໍາລັບວຽກອັດຕະໂນມັດຈາກ Windows Terminal, ຄືກັບຜູ້ໃຊ້ຂອງ Windows OS ເລື້ອຍໆ.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "ຫໍສະຫມຸດສະຄິບ Ruby ຂອງ Patrick",
                "text": "ຫໍສະມຸດທີ່ມີປະໂຫຍດຂອງສະຄິບ Ruby ສໍາລັບການອ້າງອີງໃນອະນາຄົດ. ມີປະໂຫຍດສໍາລັບ Ruby ໃນອະນາຄົດກ່ຽວກັບການພັດທະນາແນວຄິດທີ່ພັດທະນາ.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "ຜູ້ກໍ່ສ້າງທັກສະ PDF",
                "text": "ຜູ້ສ້າງ PDF ທີ່ກໍານົດເອງທີ່ສ້າງຂື້ນກັບ Python ຜ່ານການຂະຫຍາຍ PDFKIT ແລະ JINJA2, ພ້ອມທີ່ຈະຈັດຮູບແບບ HTML ແລະ JSON. ໂຄງການນີ້ແມ່ນໃຊ້ໃນການຜະລິດເອກະສານ PDF ຈາກບັນຊີທັກສະແລະໂຄງການ. ໂຄງການນີ້ສາມາດຖືກນໍາໃຊ້ເພື່ອສ້າງຊີວະປະຫວັດຫຍໍ້ PDF ທີ່ກໍາຫນົດເອງ, ເຊິ່ງເປັນປະໂຫຍດຫຼາຍສໍາລັບການສະຫມັກວຽກ.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "ໂຄງການການເຂົ້າລະຫັດ rijandel",
                "text": "ຄອບຄົວຫນຶ່ງຂອງການຈັດຕັ້ງປະຕິບັດ 10+ ການຈັດຕັ້ງປະຕິບັດຂອງ Algorithm ການເຂົ້າລະຫັດຂອງ Rijandel ໃນປີ 128, 192, ແລະ 256 Bits. ໂຄງການນີ້ແມ່ນໃຊ້ເພື່ອສະແດງໃຫ້ເຫັນເຖິງລະບົບການເຂົ້າລະຫັດ rijandel ໃນພາສາການຂຽນໂປແກຼມທີ່ແຕກຕ່າງກັນ. ໂຄງການນີ້ແມ່ນໃຊ້ເພື່ອສ້າງຄອບຄົວໃນການຈັດຕັ້ງປະຕິບັດການເຂົ້າລະຫັດການເຂົ້າລະຫັດຂອງ Rijandel.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "MineMlC Minecraft Mod",
                "text": "minecraft mod ທີ່ເພີ່ມເຄື່ອງມືທີ່ກໍານົດເອງ, ລົດຫຸ້ມເກາະ, Mobs, ບລັອກ, ຂະຫນາດ, ແລະມີຫຼາຍລັກສະນະອື່ນໆຕໍ່ເກມ. ສ້າງຂື້ນກັບລຸ້ນ Java 8-17 ສໍາລັບເລືອກ Minecraft ສະບັບລະຫວ່າງ 1.16 ແລະ 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "ພາສາ Tiger",
                "text": "ພາສາການຂຽນໂປແກຼມທີ່ກໍາຫນົດເອງທີ່ສ້າງໃນທັງ GO GO & Rust ເພື່ອທົດລອງໃຊ້ກັບນາຍແປພາສາແລະການປະຕິບັດ. ຈັດຕັ້ງປະຕິບັດໃນເວບໄຊທ໌ Portfolio ໂດຍໃຊ້ເວບໄຊທ໌.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger Tailgating ເວັບໄຊທ໌ Pros",
                "text": "ເວັບໄຊທ໌ທີ່ຂ້ອຍສ້າງໃນປີ 2024 ສໍາລັບ Tiger Tailgating Pros, ບໍລິສັດ Tailgating ໃນ Clemson, SC. ສ້າງດ້ວຍ react.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "ໂຄງການເຄື່ອງຈັກ",
                "text": "ຄອບຄົວຂອງການຈັດຕັ້ງປະຕິບັດຫຼາຍກວ່າ 30+ ການຈັດຕັ້ງປະຕິບັດຂອງເຄື່ອງ turing. ໃຊ້ເພື່ອສະແດງໃຫ້ເຫັນຄວາມສົມບູນທີ່ສະແດງໃຫ້ເຫັນເຖິງພາສາການຂຽນໂປແກຼມທີ່ແຕກຕ່າງກັນສໍາລັບການຄົ້ນຄວ້າ, ໂດຍສະເພາະສໍາລັບພາສາການຂຽນໂປແກຼມເສືອ.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "ພາສາ Tiger"
    },
    "contact": {
        "title": "ຕິດຕໍ່ຂ້ອຍ",
        "header": "ຂໍ້ມູນຕິດຕໍ່",
        "email": "PattyGsocials@gmail.com",
        "description": "ຂ້າພະເຈົ້າຕອບສະຫນອງຕໍ່ຄໍາຖາມຈາກອີເມວ, ຂໍ້ຄວາມ LinkedIn, ແລະຂໍ້ຄວາມ instagram. ຂ້ອຍຍັງຈະໂທຫາກັບຄືນຖ້າຈໍານວນຂອງຂ້ອຍສະຫນອງໃຫ້ຜ່ານຊີວະປະຫວັດຫຼືຖ້າບໍ່ດັ່ງນັ້ນ, ເຖິງແມ່ນວ່າຂ້ອຍມັກຮັກສາເລກໂທລະສັບຂອງຂ້ອຍ."
    },
    "formatter": {
        "title": "ຮູບແບບ JSON & YAML",
        "description": "ຮູບແບບ JSON & YAML ແມ່ນເຄື່ອງມືທີ່ຊ່ວຍໃຫ້ທ່ານສາມາດສ້າງຮູບແບບໄຟລ໌ JSON ແລະ YAML. ມັນຖືກສ້າງຂຶ້ນດ້ວຍການໄປແລະ Webassembly, ແລະມັນຖືກອອກແບບໃຫ້ໄວແລະມີປະສິດທິພາບ. ຮູບແບບສໍາລັບໄດ້ຮັບການອອກແບບໃຫ້ງ່າຍຕໍ່ການໃຊ້, ດ້ວຍການໂຕ້ຕອບງ່າຍໆທີ່ຊ່ວຍໃຫ້ທ່ານສາມາດວາງລະຫັດ JSON ຫຼື Yaml ຂອງທ່ານດ້ວຍການກົດປຸ່ມ.",
        "more_info1": "ສໍາລັບຂໍ້ມູນເພີ່ມເຕີມ, ຫມາຍເຖິງ readme ໃນ",
        "more_info2": "ຫໍສະມຸດແບບ JSON / YAML.",
        "format_as": "ຮູບແບບເປັນ:",
        "auto_detect": "ກວດພົບອັດຕະໂນມັດ",
        "format": "ຮູບແບບ"
    },
    "cube_solver": {
        "title": "Rubix Cube Solver",
        "start": "ແກ້"
    },
    "tiger": {
        "title": "ເສືອພາສາ",
        "description": "ພາສາ Tigs Tiger ແມ່ນພາສາການຂຽນໂປແກຼມທີ່ກໍານົດເອງທີ່ສ້າງຂື້ນໃນທັງ GO GO & Rust ເພື່ອທົດລອງການອອກແບບນາຍພາສາແລະການປະຕິບັດ. ຈັດຕັ້ງປະຕິບັດໃນເວບໄຊທ໌ Portfolio ໂດຍໃຊ້ເວບໄຊທ໌. ພາສາ Tigs Tiger ແມ່ນພາສາການຂຽນໂປແກຼມທີ່ກໍານົດເອງທີ່ສ້າງຂື້ນໃນທັງ GO GO & Rust ເພື່ອທົດລອງການອອກແບບນາຍພາສາແລະການປະຕິບັດ. ຈັດຕັ້ງປະຕິບັດໃນເວບໄຊທ໌ Portfolio ໂດຍໃຊ້ເວບໄຊທ໌.",
        "more_info1": "ສໍາລັບຂໍ້ມູນເພີ່ມເຕີມ, ຫມາຍເຖິງ readme ໃນ",
        "more_info2": "ພາສາການຂຽນໂປແກຼມ Tiger GitHub ຫໍສະມຸດ.",
        "select_engine": "ເລືອກເຄື່ອງຈັກ:",
        "tiger_code": "ລະຫັດເສືອ:",
        "run_tiger": "ແລ່ນເສືອ",
        "output": "ຜົນໄດ້ຮັບ:"
    },
    "tab": {
        "title": "ການລົງທືນ",
        "description": "ວິສະວະກອນຊອບແວທີ່ເຕັມໄປດ້ວຍອັດຕາສ່ວນກາງ"
    },
    "copy": {
        "text": "ສໍາເນົາ",
        "copied": "ຄັດລອກ!"
    },
    "social_media": {
        "github": "github",
        "instagram": "ນ້ໍາຣາມ",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "youtube",
        "text_strip": "ຕິດຕາມຂ້ອຍ"
    },
    "languages": {
        "title": "ນັກແປພາສາ Portfolio",
        "description": "ຄົ້ນພົບວິທີການລົງທືນຂອງຂ້ອຍສາມາດເຂົ້າເຖິງນັກທ່ອງທ່ຽວທົ່ວໂລກດ້ວຍການສະຫນັບສະຫນູນຫຼາຍກວ່າ 100 ພາສາ.",
        "global_accessibility": {
            "title": "ການເຂົ້າເຖິງທົ່ວໂລກ",
            "description": "ການລົງທືນຂອງຂ້ອຍແມ່ນມີຢູ່ໃນ ONE {ຈໍານວນ} ພາສາ, ເຮັດໃຫ້ນັກທ່ອງທ່ຽວສາມາດເຂົ້າເຖິງນັກທ່ອງທ່ຽວທົ່ວໂລກ. ວິທີການທີ່ມີຫລາຍພາສານີ້ສະແດງໃຫ້ເຫັນຄວາມຕັ້ງໃຈຂອງຂ້າພະເຈົ້າຕໍ່ຄວາມຕັ້ງໃຈແລະການເຂົ້າເຖິງທົ່ວໂລກໃນການພັດທະນາຊອບແວ.",
            "stats": {
                "languages_supported": "ພາສາທີ່ຮອງຮັບ",
                "countries_represented": "ປະເທດທີ່ເປັນຕົວແທນ",
                "continents_covered": "ທະວີບທີ່ປົກຄຸມ"
            }
        },
        "features": {
            "title": "ຄຸນນະສົມບັດ",
            "items": [
                {
                    "title": "ການແປເວລາທີ່ແທ້ຈິງ:",
                    "description": "ປ່ຽນພາສາທັນທີກັບຕົວເລືອກພາສາ"
                },
                {
                    "title": "ພາສາທີ່ອີງໃສ່ URL:",
                    "description": "ຄວາມມັກຂອງພາສາແມ່ນຖືກຮັກສາໄວ້ໃນ URL"
                },
                {
                    "title": "ສະຫນັບສະຫນູນສະຄິບຂອງຄົນພື້ນເມືອງ:",
                    "description": "rendering rendering ທີ່ຖືກຕ້ອງຂອງ scripts ເຊັ່ນ arabic, ຈີນ, hindi, ແລະອື່ນໆ"
                },
                {
                    "title": "ຄວາມອ່ອນໄຫວດ້ານວັດທະນະທໍາ:",
                    "description": "ການແປພາສາພິຈາລະນາສະພາບການວັດທະນະທໍາ, ບໍ່ແມ່ນຄວາມຫມາຍທີ່ແທ້ຈິງ"
                },
                {
                    "title": "SEO ທີ່ດີທີ່ສຸດ:",
                    "description": "ແຕ່ລະພາສາທີ່ປ່ຽນແປງພາສາແມ່ນດີທີ່ສຸດສໍາລັບເຄື່ອງຈັກຊອກຫາ"
                }
            ]
        },
        "world_map": {
            "title": "ແຜນທີ່ໂລກແບບໂຕ້ຕອບ",
            "description": "ວາງປະຕູຕ່າງໆໃນແຜນທີ່ເພື່ອເບິ່ງພາສາທີ່ສະຫນັບສະຫນູນຂອງພວກເຂົາ:",
            "languages_label": "ພາສາ",
            "legend": {
                "supported": "ພາສາທີ່ຮອງຮັບ",
                "not_supported": "ບໍ່ມີການສະຫນັບສະຫນູນດ້ານພາສາ"
            },
            "zoom_controls": {
                "zoom_in": "ຊູມເຂົ້າ",
                "zoom_out": "ຊູມອອກ",
                "reset": "ຕັ້ງຄ່າ View"
            }
        },
        "supported_languages": {
            "title": "ພາສາທີ່ຮອງຮັບ"
        },
        "interactive_country_map": {
            "title": "ແຜນທີ່ປະເທດແບບໂຕ້ຕອບ",
            "description": "ວາງປະຕູຂ້າງລຸ່ມນີ້ເພື່ອເບິ່ງພາສາທີ່ສະຫນັບສະຫນູນຂອງພວກເຂົາ:",
            "language_count": {
                "single": "ພາສາ",
                "multiple": "ພາສາ"
            }
        },
        "tooltips": {
            "no_language_support": "ບໍ່ມີການສະຫນັບສະຫນູນດ້ານພາສາ"
        }
    },
    "logotext": "ແພ່ຂຽວ"
}