{
    "name": "Patrikas Goodwinas",
    "menu": {
        "home": "Namai",
        "about": "Apie mane",
        "portfolio": "Portfelis",
        "projects": "Svetainių projektai",
        "tiger": "Tigro kalba",
        "formatter": "JSON ir YAML FORMATERTAS",
        "contact": "Susisiekite su manimi"
    },
    "home": {
        "title": "Namai",
        "animated": {
            "first": "Visas kamino programinės įrangos inžinierius",
            "second": "Žiniatinklio kūrėjas",
            "third": "Žaidimų kūrėjas",
            "fourth": "Turinio kūrėjas"
        },
        "footer": "Dabar svetainė išvertė ir yra prieinama 100 ir daugiau kalbų!",
        "descriptionA": "Patyręs pilno kamieno programinės įrangos inžinierius ir žiniatinklio kūrėjas, turintis įrodytą sėkmingai vadovaujančių plėtros projektų istoriją, pradedant „Java“ modifikacijų kūrimu „Minecraft“ ir baigiant vartotojų patirtimi „React.js“ ir įgyvendinant saugias REST API, tuo pačiu nuolat naudojantis judriomis metodikomis ir efektyviu komandos bendradarbiavimu.",
        "descriptionB": "Be to, aš esu geografijos turinio kūrėjas, kuris sėkmingai panaudojo kelių socialinės žiniasklaidos platformų, įskaitant „Instagram“, „YouTube“ ir „Tiktok“, algoritmus, kad gautų garbingą ir įtraukiančią sekėjų bazę.",
        "portfolio_button": "Mano portfelis",
        "contact_button": "Susisiekite su manimi",
        "about_button": "Apie mane"
    },
    "about": {
        "title": "Apie mane",
        "personal_summary": {
            "title": "Asmeninė santrauka",
            "text": "Aš, kaip patyręs pilno „Stack“ programinės įrangos kūrėjas, įsikūręs Orlande, FL, aš pademonstravau įvairių technologijų patirtį, pradedant „Java“ ir „C ++“ - „React.js“ ir „Node.js“. Turėdamas daugybę vadovų projektų, įskaitant „Java“ modifikavimo programos „Minecraft“ plėtrą ir apdovanojimą sunkvežimių vairuotojams, aš pademonstravau lyderystę ir inovacijas. Mano įsipareigojimas kompetencijai akivaizdžiai išryškina mano sugebėjimą supaprastinti projekto valdymą, išspręsti sudėtingas problemas ir pateikti aukštos kokybės sprendimus, kurie pagerina vartotojo patirtį ir skatina organizacinę sėkmę."
        },
        "professional_experience": {
            "title": "Profesinė patirtis",
            "entries": [
                {
                    "jobtitle": "Jaunesnysis programinės įrangos inžinierius",
                    "where": "„Orion180“ draudimas",
                    "date": "2024 m. - Dalyvauti"
                },
                {
                    "jobtitle": "Įkūrėjas ir pilna „Stack“ programinės įrangos kūrėjas",
                    "where": "Suprememc",
                    "date": "2020 - 2024 m"
                },
                {
                    "jobtitle": "Visas kamino programinės įrangos inžinierius",
                    "where": "Paspartinkite mokymąsi",
                    "date": "2023 m"
                },
                {
                    "jobtitle": "Pagrindinis žiniatinklio kūrėjas (studentų programa)",
                    "where": "Clemsono universiteto GDI programa",
                    "date": "2021 - 2022 m"
                },
                {
                    "jobtitle": "Stalo vadovas",
                    "where": "Clemsono universitetas",
                    "date": "2021 - 2022 m"
                }
            ]
        },
        "technical_skills": {
            "title": "Techniniai įgūdžiai",
            "header1": "Programavimo kalbos",
            "header2": "Sistemos ir bibliotekos",
            "header3": "Įrankiai ir technologijos"
        },
        "services": {
            "title": "Mano paslaugos",
            "entries": [
                {
                    "title": "Pilna kamino inžinerija",
                    "text": "Aš siūlau išsamius sprendimus tiek iš priekio, tiek galinio kūrimo, užtikrinant sklandų integraciją ir funkcionalumą visoje programinės įrangos kaminoje."
                },
                {
                    "title": "Žiniatinklio kūrimas",
                    "text": "Turėdamas žinių apie HTML, CSS ir „JavaScript“ sistemas, tokias kaip „React.js“, aš kuriu vizualiai patrauklias ir patogias svetaines, pritaikytas patenkinti konkrečius klientų poreikius ir nuostatas."
                },
                {
                    "title": "Žaidimo plėtra",
                    "text": "Kalbos, tokios kaip „Java“ ir „C ++“, aš specializuojuosi kurdama svaiginančią žaidimų patirtį, nuo koncepcijos ir dizaino iki įgyvendinimo ir optimizavimo, užtikrinant patrauklumą ir sklandų našumą."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfelis",
        "filter_by": "Filtrų portfelis:",
        "entries": {
            "biblioteca": {
                "title": "BIBLIOTECA JSON",
                "text": "„Python“ projektas, supaprastinantis kalbos vertimus. Leidžia mano svetainių portfelį išversti į 70 ir daugiau kalbų, įskaitant ispanų, prancūzų, kinų, arabų ir daugelį kitų. Šis projektas naudojamas kurti daugiakalbį svetainių portfelį, kuris yra labai naudingas norint pasiekti platesnę auditoriją. Naudodamas šį projektą, daugiau kaip 99% pasaulio gali laisvai perskaityti mano portfelį.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Prijunkite keturis",
                "text": "Masyvi daugiau nei 50 ir daugiau „Connect Four“ žaidimų įgyvendinimų šeima. Šis projektas apima įgyvendinimus daugiau nei 30 skirtingų programavimo kalbų, įskaitant „Java“, „C ++“, „Python“, „JavaScript“ ir dar daugiau. Be to, tai taip pat apima daugiau nei 20 skirtingų rėmų ar kitų formatų, įskaitant „React.js“, „Ruby on Rails“, ASP.NET ir dar daugiau.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Interop projektas",
                "text": "Projektas, kuriame dokumentuoja skirtingų programavimo kalbų sąveiką. Šiuo metu apima 15 skirtingų programavimo kalbų ir 18 vykdymo modelių.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "„JSON & YAML Auto Formatter“",
                "text": "„JSON & YAML“ failų „Linter & Autoformatter“. Šis projektas naudojamas formatuoti JSON ir YAML failus, kurie yra labai naudingi, kad kodas būtų švarus ir organizuotas. Sukurtas su „Go“, sudarytas su „Webassembly“ ir įtrauktas į mano portfelį kaip svetainės projektą. Daugiau formatų ateityje.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "„Minecraft JSON“ generatorius",
                "text": "Lengvas JSON generatorius, įmontuotas „Python“, skirtas „Minecraft“ ištekliams ir duomenų pakuotėms. Šis projektas naudojamas generuoti JSON failus „Minecraft Mods“, įskaitant pasirinktinius elementus, blokus ir subjektus. Labai naudinga ne tik kuriant pasirinktinius duomenų rinkinius, bet ir modifikacijoms, taip pat naudojant MOD pavadinimo perjungimo funkciją.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Mano švietimo patirtis",
                "text": "Be savo asmeninių projektų, aš taip pat įgijau daugybę įgūdžių iš švietimo patirties. Norėdami gauti daugiau informacijos, spustelėkite čia, jei norite pamatyti mano „LinkedIn“ profilį.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Mano profesinė patirtis",
                "text": "Be savo asmeninių projektų, aš taip pat įgijau daugybę įgūdžių iš profesinės patirties. Norėdami gauti daugiau informacijos, spustelėkite čia, jei norite pamatyti mano „LinkedIn“ profilį.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patriko Goodwino portfelio svetainė",
                "text": "Ši svetainė yra mano asmeninio portfelio svetainė, sukurta su „React.js“. Šis projektas naudojamas demonstruoti mano įgūdžius ir projektus, taip pat suteikti galimybę potencialiems darbdaviams susisiekti su manimi. Šis projektas naudojamas norint sukurti profesionalų buvimą internete.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patriko Lua scenarijaus biblioteka",
                "text": "Naudinga LUA scenarijų biblioteka ateityje. Ši biblioteka naudojama automatizuoti užduotis „Lua“ scenarijuose, kurios gali būti naudingos atliekant reikalingas užduotis, nes „Lua“ paprastai yra greitesnė scenarijaus kalba nei „Python“ ir „Ruby“.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patriko „Microsoft Excel“ skaičiuoklės scenarijai (VBA)",
                "text": "Naudinga „Microsoft Excel“ VBA scenarijų biblioteka. Ši biblioteka naudojama automatizuoti užduotis „Excel“ skaičiuoklėse.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Patriko „Neovim“ konfigūracija",
                "text": "Mano asmeninė „Neovim“ konfigūracija. Šis projektas naudojamas mano skoniui sukonfigūruoti „Neovim“, įskaitant pasirinktinius klavišus, temas ir papildinius. Šis projektas naudojamas tam, kad Neovim būtų patogesnis ir efektyvesnis mano asmeniniam naudojimui.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patriko žemėlapių generatorius",
                "text": "Jungtinių Valstijų apygardos ir valstijos žemėlapių generatorius, pastatytas su „Python“, naudojant geopandas ir „Matplotlib“ bibliotekas. Šis projektas naudojamas generuoti JAV žemėlapius, įskaitant apskričių ir valstijų žemėlapius. Šis projektas naudojamas kuriant pasirinktinius duomenų vizualizacijos ir analizės žemėlapius.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patriko „PowerShell“ scenarijaus biblioteka",
                "text": "Naudinga „PowerShell“ scenarijų biblioteka ateityje. Naudinga naudojant „$ Profile“ scenarijaus funkciją, manau, kad tai nepaprastai naudinga automatizuoti užduotis iš „Windows“ terminalo, nes aš esu dažnas „Windows OS“ vartotojas.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patriko rubino scenarijaus biblioteka",
                "text": "Naudinga „Ruby“ scenarijų biblioteka ateityje. Naudinga būsimiems „Ruby“ „Rails“ plėtros koncepcijose.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF įgūdžių kūrėjas",
                "text": "Pasirinktinis PDF statybininkas, pastatytas su „Python“ per „PDFKIT“ ir „Jinja2“ plėtinius, kartu su HTML ir JSON formatavimu. Šis projektas naudojamas generuoti PDF failus iš įgūdžių ir projektų sąrašo. Šis projektas gali būti naudojamas kuriant pasirinktinį PDF atnaujinimą, kuris yra labai naudingas programų darbams.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandelio šifravimo projektas",
                "text": "10+ „Rijandel“ šifravimo algoritmo įgyvendinimo 128, 192 ir 256 bitų šeima. Šis projektas naudojamas parodyti Rijandelio šifravimo algoritmą skirtingomis programavimo kalbomis. Šis projektas naudojamas kuriant Rijandelio šifravimo algoritmo įgyvendinimo šeimą.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "„Suprememc Minecraft Mod“",
                "text": "„Minecraft“ modelis, pridedantis pasirinktinius įrankius, šarvus, minias, blokus, matmenis ir daug daugiau žaidimo funkcijų. Sukurtos su „Java“ versijomis 8-17, kad būtų galima pasirinkti „Minecraft“ versijas nuo 1,16 iki 1,20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tigro programavimo kalba",
                "text": "Individualizuota programavimo kalba, sukurta tiek „Go“, ir „Rust“, kad būtų galima eksperimentuoti su vertėjo dizainu ir našumu. Įdiegta portfelio svetainėje naudojant žiniatinklio surinkimą.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tigro uodegos privalumų svetainė",
                "text": "Svetainė, kurią pastatyta 2024 m. „Tiger Bagating Pros“, „Bagating Company“ įmonė Clemson, SC. Pastatytas su „React.js“.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing Machine projektas",
                "text": "„Turing Machine“ įgyvendinimas daugiau nei 30 metų. Naudojamas įvairių programavimo kalbų, skirtų tyrimams, išsamumą, ypač tigro programavimo kalbai.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tigro programavimo kalba"
    },
    "contact": {
        "title": "Susisiekite su manimi",
        "header": "Kontaktinė informacija",
        "email": "pattygsocials@gmail.com",
        "description": "Aš atsakau į klausimus iš el. Pašto, „LinkedIn“ ir „Instagram“ pranešimų. Aš taip pat paskambinsiu, jei mano numeris bus pateiktas atnaujinant ar kitaip, nors aš norėčiau, kad mano telefono numeris būtų privatus."
    },
    "formatter": {
        "title": "JSON ir YAML FORMATERTAS",
        "description": "„JSON & YAML Formatter“ yra įrankis, leidžiantis suformatuoti JSON ir YAML failus. Jis pastatytas su „Go“ ir „Webassembly“, ir yra sukurtas kaip greitas ir efektyvus. „Formatter“ yra sukurtas taip, kad būtų lengva naudoti, su paprasta sąsaja, leidžiančia įklijuoti JSON ar YAML kodą ir suformatuoti jį mygtuko paspaudimu.",
        "more_info1": "Norėdami gauti daugiau informacijos, skaitykite „README“",
        "more_info2": "JSON/YAML „Formatter“ saugykla.",
        "format_as": "Formatas kaip:",
        "auto_detect": "Automatinis aptikimas",
        "format": "Formatas"
    },
    "tiger": {
        "title": "Tigro kalba",
        "description": "Tigro programavimo kalba yra pritaikyta programavimo kalba, sukurta „Go“ ir „Rust“, kad būtų galima eksperimentuoti su vertėjo dizainu ir našumu. Įdiegta portfelio svetainėje naudojant žiniatinklio surinkimą. Tigro programavimo kalba yra pritaikyta programavimo kalba, sukurta „Go“ ir „Rust“, kad būtų galima eksperimentuoti su vertėjo dizainu ir našumu. Įdiegta portfelio svetainėje naudojant žiniatinklio surinkimą.",
        "more_info1": "Norėdami gauti daugiau informacijos, skaitykite „README“",
        "more_info2": "Tigro programavimo kalbos „GitHub“ saugykla.",
        "select_engine": "Pasirinkite variklį:",
        "tiger_code": "Tigro kodas:",
        "run_tiger": "Paleisti tigrą",
        "output": "Išvestis:"
    },
    "tab": {
        "title": "Patrikas Goodwinas",
        "description": "Visas „Stack“ programinės įrangos inžinierius, įsikūręs Centrinėje Floridoje"
    },
    "copy": {
        "text": "Kopijuoti",
        "copied": "Nukopijuota!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "„Instagram“",
        "linkedin": "„LinkedIn“",
        "tiktok": "Tiktok",
        "youtube": "„YouTube“",
        "text_strip": "Sekite mane"
    },
    "logotext": "Patrikas"
}