{
    "name": "Patriks Goodvins",
    "menu": {
        "home": "Mājas",
        "about": "Par mani",
        "portfolio": "Portfelis",
        "projects": "Vietņu projekti",
        "tiger": "Tīģeru valoda",
        "formatter": "Json & yaml formatter",
        "cube_solver": "Rubiksa kubu risinātājs",
        "contact": "Sazinieties ar mani"
    },
    "home": {
        "title": "Mājas",
        "animated": {
            "first": "Pilna kaudze programmatūras inženieris",
            "second": "Tīmekļa izstrādātājs",
            "third": "Spēļu izstrādātājs",
            "fourth": "Satura veidotājs"
        },
        "footer": "Vietne, kas tagad tiek tulkota un ir pieejama 100+ valodās!",
        "descriptionA": "Pieredzējis pilnas kaudzes programmatūras inženieris un tīmekļa izstrādātājs ar pierādītu veiksmīgi vadošu attīstības projektu vēsturi, sākot no Java modifikāciju izveidošanas Minecraft un beidzot ar lietotāju pieredzes uzlabošanu react.js un drošas REST API ieviešanai, vienlaikus konsekventi izmantojot veiklu metodoloģiju un efektīvu komandas sadarbību.",
        "descriptionB": "Turklāt es esmu ģeogrāfijas satura veidotājs, kurš ir veiksmīgi izmantojis vairāku sociālo mediju platformu, ieskaitot Instagram, YouTube un Tiktok, algoritmus, lai iegūtu cienījamu un saistošu sekotāju bāzi.",
        "portfolio_button": "Mans portfelis",
        "contact_button": "Sazinieties ar mani",
        "about_button": "Par mani"
    },
    "about": {
        "title": "Par mani",
        "personal_summary": {
            "title": "Personīgais kopsavilkums",
            "text": "Kā pieredzējis pilnas kaudzes programmatūras izstrādātājs, kas atrodas Orlando, FL, esmu demonstrējis kompetenci dažādās tehnoloģijās, sākot no Java un C ++, lai reaģētu.js un node.js. Veicot vadošus projektus, tostarp Java modifikācijas programmas izstrādi Minecraft un atalgojošu vietni kravas automašīnu vadītājiem, esmu demonstrējis vadību un inovācijas. Mana apņemšanās sasniegt izcilību ir acīmredzama ar manu spēju pilnveidot projektu vadību, atrisināt sarežģītas problēmas un sniegt augstas kvalitātes risinājumus, kas uzlabo lietotāju pieredzi un veicina organizācijas panākumus."
        },
        "professional_experience": {
            "title": "Profesionāla pieredze",
            "entries": [
                {
                    "jobtitle": "Junioru programmatūras inženieris",
                    "where": "ORION180 apdrošināšana",
                    "date": "2024. gads - tagadne"
                },
                {
                    "jobtitle": "Dibinātājs un pilna steka programmatūras izstrādātājs",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Pilna kaudze programmatūras inženieris",
                    "where": "Paātrināt mācīšanos",
                    "date": "2023. gads"
                },
                {
                    "jobtitle": "Vadošais tīmekļa izstrādātājs (studentu programma)",
                    "where": "Klemsona universitātes GDI programma",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Galda uzraugs",
                    "where": "Klemsona universitāte",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Tehniskās prasmes",
            "header1": "Programmēšanas valodas",
            "header2": "Ietvari un bibliotēkas",
            "header3": "Rīki un tehnoloģijas"
        },
        "services": {
            "title": "Mani pakalpojumi",
            "entries": [
                {
                    "title": "Pilna kaudzes inženierija",
                    "text": "Es piedāvāju visaptverošus risinājumus gan priekšējā, gan aizmugurējā attīstībā, nodrošinot vienmērīgu integrāciju un funkcionalitāti visā programmatūras kaudzē."
                },
                {
                    "title": "Tīmekļa attīstība",
                    "text": "Izmantojot kompetenci HTML, CSS un JavaScript ietvaros, piemēram, React.js, es izstrādāju vizuāli pievilcīgas un lietotājam draudzīgas vietnes, kas pielāgotas klientu īpašajām vajadzībām un vēlmēm."
                },
                {
                    "title": "Spēļu attīstība",
                    "text": "Piesaistot tādas valodas kā Java un C ++, es specializējos ieskaujošu spēļu pieredzes radīšanā, sākot no koncepcijas un dizaina līdz ieviešanai un optimizācijai, nodrošinot iesaistīšanos spēles un vienmērīgu veiktspēju."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfelis",
        "filter_by": "Filtrēšanas portfelis ar:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca json",
                "text": "Python projekts, kas racionalizē valodu tulkojumus. Ļauj manu vietnes portfeli tulkot 70+ valodās, ieskaitot spāņu, franču, ķīniešu, arābu un daudzus citus. Šis projekts tiek izmantots, lai izveidotu daudzvalodu vietņu portfeli, kas ir ļoti noderīgs, lai sasniegtu plašāku auditoriju. Izmantojot šo projektu, vairāk nekā 99% pasaules var lasīt manu portfeli tekošā valodā.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Savienot četrus",
                "text": "Masīva ģimene, kas ir vairāk nekā 50 vairāk nekā 50 Connect četru spēles ieviešana. Šis projekts ietver ieviešanu vairāk nekā 30 dažādās programmēšanas valodās, ieskaitot Java, C ++, Python, JavaScript un daudz ko citu. Turklāt tas ietver arī vairāk nekā 20 vairāk dažādus ietvarus vai citus formātus, ieskaitot React.js, Ruby on Rails, Asp.net un daudz ko citu.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Savstarpējā projekts",
                "text": "Projekts, kas dokumentē savietojamību starp dažādām programmēšanas valodām. Pašlaik ietilpst 15 dažādas programmēšanas valodas un 18 izpildes modeļi.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "Json & yaml auto formatter",
                "text": "JSON & YAML failu oderējums un autoformaters. Šis projekts tiek izmantots JSON & YAML failu formatēšanai, kas ir ļoti noderīgi, lai kods būtu tīrs un sakārtots. Būvēts ar Go, apkopots ar WebAssembly un iegults manā portfelī kā vietnes projekts. Vairāk formātu, kas nāk nākotnē.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON ģenerators",
                "text": "Viegls JSON ģenerators, kas iebūvēts Python Minecraft resursu un datu pakotnēm. Šis projekts tiek izmantots JSON failu ģenerēšanai Minecraft modi, ieskaitot pielāgotos vienumus, blokus un entītijas. Ļoti noderīgi ne tikai pielāgotu datu paku izveidošanai, bet arī modiem, izmantojot mod nosaukuma komutācijas funkciju.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Mana izglītības pieredze",
                "text": "Līdztekus saviem personīgajiem projektiem es arī esmu ieguvis daudzas prasmes no izglītības pieredzes. Noklikšķiniet šeit, lai skatītu manu LinkedIn profilu, lai iegūtu papildinformāciju.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Mana profesionālā pieredze",
                "text": "Līdztekus saviem personīgajiem projektiem es arī esmu ieguvis daudzas prasmes no profesionālās pieredzes. Noklikšķiniet šeit, lai skatītu manu LinkedIn profilu, lai iegūtu papildinformāciju.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrika Goodvina portfeļa vietne",
                "text": "Šī vietne ir mana personīgā portfeļa vietne, kas veidota ar react.js. Šis projekts tiek izmantots, lai parādītu manas prasmes un projektus, kā arī nodrošinātu platformu potenciālajiem darba devējiem, lai ar mani sazinātos. Šis projekts tiek izmantots, lai izveidotu profesionālu klātbūtni tiešsaistē.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patrika Lua skriptu bibliotēka",
                "text": "Noderīga LUA skriptu bibliotēka turpmākai atsaucei. Šī bibliotēka tiek izmantota, lai automatizētu uzdevumus LUA skriptos, kas var noderēt veiktspējas un neēdu uzdevumu veikšanai, jo Lua parasti ir ātrāka skriptu valoda nekā gan Python, gan Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrika Microsoft Excel izklājlapu skripti (VBA)",
                "text": "Noderīga VBA skriptu bibliotēka Microsoft Excel. Šī bibliotēka tiek izmantota, lai automatizētu uzdevumus Excel izklājlapās.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Patrika neovim konfigurācija",
                "text": "Mana personīgā neovim konfigurācija. Šis projekts tiek izmantots, lai konfigurētu Neovimu pēc manas vēlēšanās, ieskaitot pielāgotus atslēgu ieslodzījumus, tēmas un spraudņus. Šis projekts tiek izmantots, lai padarītu NEOVIM draudzīgāku un efektīvāku manai personīgai lietošanai.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patrika karšu ģenerators",
                "text": "Amerikas Savienoto Valstu apgabala un štata karšu ģenerators, kas izveidots ar Python, izmantojot Geopandas un Matplotlib bibliotēkas. Šis projekts tiek izmantots, lai izveidotu Amerikas Savienoto Valstu kartes, ieskaitot grāfistes un štatu kartes. Šis projekts tiek izmantots, lai izveidotu pielāgotas kartes datu vizualizācijai un analīzei.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patrika PowerShell skriptu bibliotēka",
                "text": "Noderīga PowerShell skriptu bibliotēka turpmākai atsaucei. Noderīgs ar $ profila skripta funkciju, es uzskatu, ka tas ir ārkārtīgi noderīgs, lai automatizētu uzdevumus no Windows termināļa, jo esmu biežs Windows OS lietotājs.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patrika Rubīna skriptu bibliotēka",
                "text": "Noderīga rubīna skriptu bibliotēka turpmākai atsaucei. Noderīgs nākotnes Ruby on Rails attīstības jēdzieniem.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF prasmju veidotājs",
                "text": "Pielāgots PDF veidotājs, kas izveidots ar Python, izmantojot PDFKIT un Jinja2 paplašinājumus, līdzās HTML un JSON formatēšanai. Šis projekts tiek izmantots, lai ģenerētu PDF failus no prasmju un projektu saraksta. Šo projektu var izmantot, lai izveidotu pielāgotu PDF CV, kas ir ļoti noderīga darba lietojumprogrammām.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandel šifrēšanas projekts",
                "text": "Rijandela šifrēšanas algoritma 128, 192 un 256 bitu ģimene 128, 192 un 256 bitos. Šis projekts tiek izmantots, lai demonstrētu Rijandela šifrēšanas algoritmu dažādās programmēšanas valodās. Šis projekts tiek izmantots, lai izveidotu Rijandela šifrēšanas algoritma ieviešanas saimi.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc minecraft mod",
                "text": "Minecraft mod, kas pievieno pielāgotus rīkus, bruņas, mobus, blokus, izmērus un daudz citu spēli. Izbūvēts ar Java versijām 8-17, lai izvēlētos Minecraft versijas no 1,16 līdz 1,20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tīģeru programmēšanas valoda",
                "text": "Pielāgota programmēšanas valoda, kas iebūvēta gan Go, gan Rust, lai eksperimentētu ar tulka dizainu un veiktspēju. Ievietots portfeļa vietnē, izmantojot tīmekļa montāžu.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger Tailing Pros vietne",
                "text": "Vietne, kuru es uzbūvēju 2024. gadā, lai iegūtu Tiger Tailing Pros, aizmugurējo uzņēmumu Clemson, SC. Veidots ar react.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Tēringa mašīnas projekts",
                "text": "Vairāk nekā 30 vairāk nekā 30 Tjūringas ieviešanas ģimene. Izmanto, lai demonstrētu Tēringa pilnīgumu dažādām programmēšanas valodām pētniecībai, īpaši tīģeru programmēšanas valodai.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tīģeru programmēšanas valoda"
    },
    "contact": {
        "title": "Sazinieties ar mani",
        "header": "Kontaktinformācija",
        "email": "Pattygsocials@gmail.com",
        "description": "Es atbildu uz jautājumiem no e -pasta, LinkedIn ziņojumiem un Instagram ziņojumiem. Es arī piezvanīšu, ja mans numurs tiek nodrošināts, izmantojot atsākšanu vai kā citādi, lai gan es labprātāk saglabāju savu tālruņa numuru privātu."
    },
    "formatter": {
        "title": "Json & yaml formatter",
        "description": "JSON & YAML FORMATTER ir rīks, kas ļauj formatēt JSON un YAML failus. Tas ir veidots ar Go un WebAssembly, un tas ir paredzēts ātri un efektīvam. Formaters ir veidots tā, lai būtu ērti lietojams, ar vienkāršu saskarni, kas ļauj ielīmēt JSON vai YAML kodu un formatēt to ar pogas klikšķi.",
        "more_info1": "Lai iegūtu papildinformāciju, skatiet ReadMe in the",
        "more_info2": "JSON/Yaml formatter Repository.",
        "format_as": "Formāts kā:",
        "auto_detect": "Automātiska noteikšana",
        "format": "Formāts"
    },
    "cube_solver": {
        "title": "Rubiksa kubu risinātājs",
        "solve": "Atrisināt"
    },
    "tiger": {
        "title": "Tīģeru valoda",
        "description": "Tīģera programmēšanas valoda ir pielāgota programmēšanas valoda, kas iebūvēta gan Go, gan Rust, lai eksperimentētu ar tulka dizainu un veiktspēju. Ievietots portfeļa vietnē, izmantojot tīmekļa montāžu. Tīģera programmēšanas valoda ir pielāgota programmēšanas valoda, kas iebūvēta gan Go, gan Rust, lai eksperimentētu ar tulka dizainu un veiktspēju. Ievietots portfeļa vietnē, izmantojot tīmekļa montāžu.",
        "more_info1": "Lai iegūtu papildinformāciju, skatiet ReadMe in the",
        "more_info2": "Tīģera programmēšanas valodas Github repozitorija.",
        "select_engine": "Atlasīt motoru:",
        "tiger_code": "Tīģera kods:",
        "run_tiger": "Run Tīģeris",
        "output": "Izlaide:"
    },
    "tab": {
        "title": "Patriks Goodvins",
        "description": "Pilna kaudze programmatūras inženieris, kas atrodas Centrālajā Floridā"
    },
    "copy": {
        "text": "Kopija",
        "copied": "Kopēts!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "Youtube",
        "text_strip": "Seko man"
    },
    "logotext": "Patriks"
}