{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "an-trano",
        "about": "Momba ahy",
        "portfolio": "portfolio-",
        "projects": "Tetikasa tranonkala",
        "tiger": "Fiteny Tiger",
        "formatter": "JSON & Former JSON",
        "contact": "Mifandraisa amiko"
    },
    "home": {
        "title": "an-trano",
        "animated": {
            "first": "Injeniera rindrambaiko feno",
            "second": "Mpanamboatra tranonkala",
            "third": "Mpampiasa lalao",
            "fourth": "Mpamorona ny votoatiny"
        },
        "descriptionA": "Zava-misy injeniera sy mpitaona tranonkala feno dia misy tantaram-pampianarana mahomby amin'ny famoronana ny Minecraft mba hanatsarana ny traikefa an'ny mpampiasa",
        "descriptionB": "Ankoatr'izay, Mpamorona ny votoam-pamokarana ara-barotra aho izay naharesy ny algorithm an'ny sehatra media marobe marobe, anisan'izany ny Instagram, YouTube, ary Tiktok, mba hahazoana fototry ny fiasa sy ny fikambanam-pandihazo.",
        "portfolio_button": "Ny portfolio-ko",
        "contact_button": "Mifandraisa amiko",
        "about_button": "Momba ahy"
    },
    "about": {
        "title": "Momba ahy",
        "personal_summary": {
            "title": "Famintinana manokana",
            "text": "Ho toy ny mpamorona rindrambaiko feno za-draharaha miorina ao Orlando, FL, dia naneho fahaiza-manao amin'ny teknolojia isan-karazany, avy any Java sy C ++ to React.js sy Node.js.. Miaraka amin'ny firaketana an-tsoratra momba ny tetikasa lefona, ao anatin'izany ny fampandrosoana ny fandaharam-pampianarana Java ho an'ny Minecraft sy tranonkala mahafa-po ho an'ny mpamily kamiao, dia naneho ny fitarihana sy ny fanavaozana aho. Ny fanolorantenako ny fahaizako dia miharihary amin'ny fahaizako manitatra ny fitantanana ny tetikasa, mamaha ireo olana sarotra, ary alefa vahaolana avo lenta izay manatsara ny fahombiazan'ny mpampiasa sy ny fahombiazan'ny fandaminana."
        },
        "professional_experience": {
            "title": "Fanandramana matihanina",
            "entries": [
                {
                    "jobtitle": "Injeniera rindrambaiko",
                    "where": "Orion180 Fiantohana",
                    "date": "2024 - ankehitriny"
                },
                {
                    "jobtitle": "Mpanorina & Full Software Software",
                    "where": "Sifrememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Injeniera rindrambaiko feno",
                    "where": "Manafaingana ny fianarana",
                    "date": "2023"
                },
                {
                    "jobtitle": "Mpitondra mpamorona tranonkala (programa mpianatra)",
                    "where": "CLEMSON ONIBLONE GDI",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Desk Supervisor",
                    "where": "Oniversite Clemson",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Fahaiza-manao ara-teknika",
            "header1": "Languages ​​fandaharana",
            "header2": "Frameworks & Libraries",
            "header3": "Fitaovana sy teknolojia"
        },
        "services": {
            "title": "Ny serivisiko",
            "entries": [
                {
                    "title": "Feno injeniera feno",
                    "text": "Manolotra vahaolana feno amin'ny fivoarana eo anoloana sy ny fivoarana farany aho, miantoka ny fampidirana seavless sy ny fampiasa amin'ny rindrambaiko rehetra."
                },
                {
                    "title": "Fampandrosoana ny tranonkala",
                    "text": "Miaraka amin'ny fahaiza-manao ao amin'ny HTML, CSS, ary JavaScript Frameworks toa ny REACT.JS, dia nanao asa tanana nahitam-po sy sariaka ny sariaka aho mba hihaona amin'ny filàna sy ny filan'ny mpampiasa."
                },
                {
                    "title": "Fampandrosoana ny lalao",
                    "text": "Ny fiteny manampahefana toa an'i Java sy C ++, dia manam-pahaizana manokana amin'ny famoronana traikefa milentika, avy amin'ny foto-kevitra sy ny famolavolana ny fampiharana sy ny fanamboarana azy, hiantohana ny fampidirana lalao sy ny fampisehoana tsara."
                }
            ]
        }
    },
    "portfolio": {
        "title": "portfolio-",
        "filter_by": "Filter portfolio amin'ny:",
        "entries": {
            "biblioteca": {
                "title": "BIBLIOTECA JSON",
                "text": "Tetikasa python izay mamolavola fandikan-teny amin'ny fiteny. Mamela ny portfolio ny tranokalako ho voadika amin'ny fiteny 70+, ao anatin'izany ny Espaniôla, frantsay, Sinoa, Sinoa, Arabo, ary maro hafa. Ity tetikasa ity dia ampiasaina hamoronana portfolio-tranonkala marobe, izay tena ilaina amin'ny fanatrarana mpihaino malalaka kokoa. Miaraka amin'ity tetik'asa ity, maherin'ny 99% izao tontolo izao no afaka mamaky ny portfolio-ko amin'ny fiteny mahay.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Mampifandray efatra",
                "text": "Fianakaviana be dia be ny fampiharana 50+ ny fampiharana ny lalao efatra mampifandray. Ity tetikasa ity dia ahitana ny fampiharana ao amin'ny fiteny maro samihafa 30 mahery, anisan'izany ny Java, C ++, Python, JavaScript, sy ny maro hafa. Ankoatr'izay, dia misy koa ny frameworks 20+ samihafa na ny endrika hafa, ao anatin'izany ny react.js, ruby ​​amin'ny lalamby, ASP.NET, ary ny maro hafa.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Tetikasa interop",
                "text": "Tetikasa iray izay antontan-taratasy mifandraika amin'ny fiteny fandaharana samihafa. Anisan'izany ny fiteny 15 isan-karazany 15 sy ny fomba famonoana 18.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "JSON & AUT AUTO AUTO AUTO",
                "text": "LINTER & AutoFormatter ho an'ny rakitra JSON & Yaml. Ity tetikasa ity dia ampiasaina amin'ny Fandraisana an'i Json & Yaml Files, izay tena ilaina amin'ny fitandremana ny kaody madio sy ny fandaminana. Namboarina niaraka tamin'ny Go, namboarina tamin'ny tranokala, ary niditra tao amin'ny portfolio ho tetikasan'ny tranokala. Endrika maro kokoa ho avy amin'ny ho avy.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON Generator",
                "text": "Lightweight JSON Generator namboarina tao amin'ny python ho an'ny fonosana minecraft & data fonosana. Ity tetikasa ity dia ampiasaina amin'ny famokarana ireo rakitra JSON ho an'ny MODS MINECRAFT, ao anatin'izany ny entana, ny sakana ary ny sampana. Tena mahasoa tokoa ho an'ny tsy famoronana tahirinkevitra mahazatra, fa ho an'ny Mods ihany koa amin'ny alàlan'ny endri-peo Mod anarana.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Ny zavatra niainako",
                "text": "Miaraka amin'ny tetikasako manokana dia nahazo fahaiza-manao maro koa aho avy amin'ny traikefa ara-panabeazana. Tsindrio eto raha hijery ny mombamomba ny LinkedIn raha te hahalala bebe kokoa.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Ny zavatra niainako matihanina",
                "text": "Miaraka amin'ny tetikasako manokana, dia nahazo fahaiza-manao maro koa aho avy amin'ny traikefa matihanina. Tsindrio eto raha hijery ny mombamomba ny LinkedIn raha te hahalala bebe kokoa.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Tranonkala Patrick Goodwin portfolio",
                "text": "Ity tranonkala ity dia tranonkalan'ny portfololio manokana ahy, namboarina tamin'ny react.js. Ity tetikasa ity dia ampiasaina hanehoana ny fahaizako sy ny tetik'asa, ary koa ny manome sehatra ho an'ny mpampiasa mety ho afaka hifandray amiko. Ity tetikasa ity dia ampiasaina amin'ny famoronana fanatrehana an-tserasera matihanina.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Lazain'ny Lua Lua Patrick's",
                "text": "Tranomboky iray mahasoa ao amin'ny script any Lua ho an'ny fanondroana ho avy. Ity tranomboky ity dia ampiasaina amin'ny asa automatique ao amin'ny Scripts Lua, izay mety ho tonga amin'ny asa an-kery ho an'ny asa-fampisehoana, satria i Lua dia fiteny tsotra kokoa noho ny python sy ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Scripts Scriptsheet Scripts (VBA)",
                "text": "Tranombokam-tranomboky mahasoa ao amin'ny script vba ho an'ny Microsoft Excel. Ity tranomboky ity dia ampiasaina amin'ny asa automatique amin'ny splanceets expel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Config's Neovim Neovim",
                "text": "Ny fanitsiana neovim manokana. Ity tetikasa ity dia ampiasaina amin'ny fanamafisana an'i Neovim amin'ny tiako, ao anatin'izany ny fanalahidy, lohahevitra ary plugins. Ity tetikasa ity dia ampiasaina mba hahatonga an'i Neovim bebe kokoa amin'ny mpampiasa sy mahomby amin'ny fampiasana ahy manokana.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Ny mpamokatra sarintany an'i Patrick",
                "text": "A United Stony County & State Map Mpanamboatra Map, namboarina tamin'ny python tamin'ny alàlan'ny tranomboky Geopandas sy Matplotlib. Ity tetikasa ity dia ampiasaina amin'ny famokarana sarintany any Etazonia, ao anatin'izany ny sarintany sy ny sarintany. Ity tetikasa ity dia ampiasaina hamoronana sarintany mahazatra ho an'ny sary sy ny famakafakana.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Tranombok'i Patrick's Powershell Script",
                "text": "Famakiam-boky mahasoa amin'ny sora-baventy powershell ho an'ny fanondroana ho avy. Mahasoa amin'ny endri-tsoratra ao amin'ny Script Copfication, hitako fa mahasoa be dia be ny asa ho azy avy amin'ny terminal Windows, satria mpampiasa matetika amin'ny Windows OS aho.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Library Ruby Script an'i Patrick's",
                "text": "Tranomboky mahasoa amin'ny sora-baventy ruby ​​ho an'ny fanondroana ho avy. Mahasoa ho an'ny ruby ​​ho avy amin'ny foto-kevitra fampandrosoana ny lalamby.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "Mpanamboatra fahaiza-manao PDF",
                "text": "Mpanorina PDF fanao namboarina miaraka amin'ny python amin'ny alàlan'ny pdfkit sy jinja2 extension, eo amoron'ny html sy json. Ity tetikasa ity dia ampiasaina amin'ny famolavolana rakitra PDF avy amin'ny lisitry ny fahaiza-manao sy ny tetikasa. Ity tetikasa ity dia azo ampiasaina hamoronana resume PDF mahazatra, izay tena ilaina amin'ny fampiharana ny asa.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Tetikasa encryp enjryel",
                "text": "Fianakaviana iray amin'ny fampiharana 10+ ny algorithpes enjandel envrypm tamin'ny 128, 192, ary 256 bitika. Ity tetikasa ity dia ampiasaina hanehoana ny algorithm ny enjandel amin'ny fiteny fandaharana samihafa. Ity tetikasa ity dia ampiasaina hamoronana fianakaviana ny fampiharana ny fanatanterahana ny algorithm.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Minecraft Minecraft Suprememc",
                "text": "Mod Movement Modecraft izay manampy fitaovana, fiarovan-tena, fiarovan-tena, sakana, sakana, refy, ary endri-javatra maro hafa amin'ny lalao. Namboarina niaraka tamin'ny dikan-teny java 8-17 ho an'ny voafantina Minecraft Versions eo anelanelan'ny 1.16 sy 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Fitenin'ny fandaharana Tiger",
                "text": "Ny fandaharam-potoam-pandraisana amam-panao namboarina ao anaty sy ny harafesina amin'ny fanandramana amin'ny famolavolana sy ny fampisehoana mpandika teny. Nampiharina tao amin'ny tranokalan'ny portfolio tamin'ny alàlan'ny fivoriambe.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger mampifandray tranonkala pros",
                "text": "Tranonkala iray naoriko tamin'ny 2024 ho an'ny Tiger Torigating Pros, orinasa mitambatra ao Clemson, SC. Namboarina niaraka tamin'ny react.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Tetikasa milina",
                "text": "Fianakavianan'ny famandrihana 30+ amin'ny milina fitadiavam-bola. Nampiasaina hanehoana ny fametahana fahafenoana ho an'ny fiteny fandaharana samihafa ho an'ny fikarohana, indrindra ho an'ny fiteny fandaharana tigra.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Fitenin'ny fandaharana Tiger"
    },
    "contact": {
        "title": "Mifandraisa amiko",
        "header": "Antsipiriany ifandraisana",
        "email": "pattygsocials@gmail.com",
        "description": "Mamaly ny fanontaniana amin'ny mailaka, Linkedin Messages, ary hafatra manokana aho. Hiverina ihany koa aho raha omena ny isa ny isa na tsia, na raha tsy izany, na dia aleoko mitokana aza ny nomeraon-telefaoniko."
    },
    "formatter": {
        "title": "JSON & Former JSON",
        "description": "Ny mpamorona JSON & Yaml dia fitaovana ahafahanao mamorona ny rakitra JSON sy Yaml. Namboarina miaraka amin'ny fandehanana sy webassembly, ary natao ho haingana sy mahomby. Ny mpamboatra dia natao ho mora ampiasaina, miaraka amin'ny interface tsotra izay ahafahanao mametaka ao amin'ny JSON na Yaml Code ary mamolavola azy amin'ny alàlan'ny tsindrio bokotra.",
        "more_info1": "Raha mila fanazavana fanampiny, dia jereo ny README ao amin'ny",
        "more_info2": "JSON / Yam format repositories.",
        "format_as": "Format AS:",
        "auto_detect": "Auto hita",
        "format": "endrika"
    },
    "tiger": {
        "title": "Fiteny Tiger",
        "description": "Ny fiteny fandaharana tigra dia ny fiteny fandaharana mahazatra namboarina ao anaty sy ny harafesina mba hanandrana ny famolavolana sy ny fampisehoana mpandika teny. Nampiharina tao amin'ny tranokalan'ny portfolio tamin'ny alàlan'ny fivoriambe. Ny fiteny fandaharana tigra dia ny fiteny fandaharana mahazatra namboarina ao anaty sy ny harafesina mba hanandrana ny famolavolana sy ny fampisehoana mpandika teny. Nampiharina tao amin'ny tranokalan'ny portfolio tamin'ny alàlan'ny fivoriambe.",
        "more_info1": "Raha mila fanazavana fanampiny, dia jereo ny README ao amin'ny",
        "more_info2": "Fiteny github github an'ny Tiger.",
        "select_engine": "Safidio ny motera:",
        "tiger_code": "Kaody Tiger:",
        "run_tiger": "Mihazakazaka tigra",
        "output": "Output:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Injeniera rindrambaiko feno trano miorina ao afovoan'i Florida"
    },
    "copy": {
        "text": "dika mitovy",
        "copied": "Nopetahana!"
    },
    "social_media": {
        "github": "GitHub",
        "instagram": "Instagram",
        "linkedin": "Linkedin",
        "tiktok": "Tiktok",
        "youtube": "YOUTUBE",
        "text_strip": "Araho aho"
    },
    "logotext": "Patrick"
}