{
    "name": "Патрик Гудвин",
    "menu": {
        "home": "Дома",
        "about": "За мене",
        "portfolio": "Портфолио",
        "projects": "Проекти на веб -страница",
        "tiger": "Јазик на тигар",
        "formatter": "JSON и YAML FORMATER",
        "cube_solver": "Решение на коцка Рубикс",
        "contact": "Контактирајте ме"
    },
    "home": {
        "title": "Дома",
        "animated": {
            "first": "Инженер за софтвер со целосен магацин",
            "second": "Веб -развивач",
            "third": "Развивач на игри",
            "fourth": "Создател на содржина"
        },
        "footer": "Веб -страница сега преведена и достапна на 100+ јазици!",
        "descriptionA": "Искусен инженер за софтвер со целосна работа и развивач на веб со демонстрирана историја на успешно водечки развојни проекти, од создавање на Java измени за Minecraft до подобрување на корисничкото искуство во React.JS и спроведување на безбедни API на REST, додека постојано се користат агилни методологии и ефективна тимска соработка.",
        "descriptionB": "Покрај тоа, јас сум креатор на содржини за географија, кој успешно ги искористи алгоритмите на повеќе платформи за социјални медиуми, вклучувајќи ги Инстаграм, ЈуТјуб и Титок, за да стекне респектабилна и ангажирана база на следбеници.",
        "portfolio_button": "Моето портфолио",
        "contact_button": "Контактирајте ме",
        "about_button": "За мене"
    },
    "about": {
        "title": "За мене",
        "personal_summary": {
            "title": "Лично резиме",
            "text": "Како искусен развивач на софтвер со целосен оџак со седиште во Орландо, Флорида, покажав експертиза во разни технологии, од Јава и Ц ++ до React.js и Node.js. Со евиденција за проекти за водење на копчиња, вклучително и развој на програма за модификација на Java за Minecraft и наградувачка веб -страница за возачи на камиони, јас ги покажав лидерството и иновациите. Мојата посветеност на извонредност е евидентна во мојата способност да го насочам управувањето со проекти, да решам комплексни проблеми и да испорачувам висококвалитетни решенија кои го подобруваат корисничкото искуство и водат организациски успех."
        },
        "professional_experience": {
            "title": "Професионално искуство",
            "entries": [
                {
                    "jobtitle": "Инженер за помлад софтвер",
                    "where": "ОРИОН180 Осигурување",
                    "date": "2024 година - сегашност"
                },
                {
                    "jobtitle": "Основач и развивач на софтвер за целосен магацин",
                    "where": "Suprememc",
                    "date": "2020 - 2024 година"
                },
                {
                    "jobtitle": "Инженер за софтвер со целосен магацин",
                    "where": "Забрзајте го учењето",
                    "date": "2023 година"
                },
                {
                    "jobtitle": "Водечки веб -развивач (студентска програма)",
                    "where": "Програма на ГДИ на Универзитетот Климсон",
                    "date": "2021 - 2022 година"
                },
                {
                    "jobtitle": "Надзорник на бирото",
                    "where": "Универзитет Климсон",
                    "date": "2021 - 2022 година"
                }
            ]
        },
        "technical_skills": {
            "title": "Технички вештини",
            "header1": "Програмски јазици",
            "header2": "Рамки и библиотеки",
            "header3": "Алатки и технологии"
        },
        "services": {
            "title": "Моите услуги",
            "entries": [
                {
                    "title": "Инженеринг со целосен оџак",
                    "text": "Јас нудам сеопфатни решенија и во развој на предниот и задниот дел, обезбедувајќи лесна интеграција и функционалност во текот на целиот магацин на софтвер."
                },
                {
                    "title": "Веб развој",
                    "text": "Со експертиза во рамки HTML, CSS и JavaScript како React.js, јас занает визуелно привлечни и лесни за корисниците, прилагодени за да ги задоволат специфичните потреби и преференции на клиентите."
                },
                {
                    "title": "Развој на игри",
                    "text": "Јазици за искористување како што се Java и C ++, јас сум специјализиран за создавање искуства со импресивни игри, од концепт и дизајн до имплементација и оптимизација, обезбедувајќи ангажирање на игра и непречено работење."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Портфолио",
        "filter_by": "Портфолио на филтрирање од:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca Json",
                "text": "Проект за Пајтон кој ги насочува преводите на јазиците. Овозможува моето портфолио на веб -страницата да се преведе на 70+ јазици, вклучувајќи шпански, француски, кинески, арапски и многу други. Овој проект се користи за создавање на повеќејазично портфолио на веб -страница, што е многу корисно за постигнување поширока публика. Со овој проект, над 99% од светот можат да го прочитаат моето портфолио на течен јазик.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Поврзете четири",
                "text": "Масивно семејство од над 50+ имплементации на Connect Four Game. Овој проект вклучува имплементации на над 30 различни програмски јазици, вклучувајќи ги Java, C ++, Python, JavaScript и многу повеќе. Покрај тоа, исто така вклучува и над 20+ различни рамки или други формати, вклучувајќи React.js, Ruby On Rails, ASP.NET и многу повеќе.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Интерноп проект",
                "text": "Проект што ја документира интероперабилноста помеѓу различните јазици за програмирање. Во моментов вклучува 15 различни јазици за програмирање и 18 модели на извршување.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "JSON & YAML Auto Formater",
                "text": "Linter & Autoformatter за датотеки JSON & YAML. Овој проект се користи за форматирање на датотеки JSON и YAML, што е многу корисно за одржување на чист и организиран код. Изграден со GO, составен со веб -страница и вметната во моето портфолио како проект за веб -страница. Повеќе формати што треба да дојдат во иднина.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON генератор",
                "text": "Лесен генератор JSON изграден во Python за пакетите за ресурси и податоци Minecraft. Овој проект се користи за генерирање на JSON -датотеки за режими Minecraft, вклучувајќи сопствени артикли, блокови и субјекти. Многу корисно не само за создавање сопствени податоци за податоци, туку и за режими, како и преку функцијата за префрлување на името MOD.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Моето образовно искуство",
                "text": "Покрај моите лични проекти, јас исто така стекнав бројни вештини од образовно искуство. Кликнете овде за да го видите мојот профил LinkedIn за повеќе информации.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Моето професионално искуство",
                "text": "Покрај моите лични проекти, јас исто така стекнав бројни вештини од професионално искуство. Кликнете овде за да го видите мојот профил LinkedIn за повеќе информации.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Веб -страница за портфолио на Патрик Гудвин",
                "text": "Оваа веб -страница е моја веб -страница за лично портфолио, изградена со React.js. Овој проект се користи за да ги покажам моите вештини и проекти, како и да обезбеди платформа за потенцијалните работодавци да ме контактираат. Овој проект се користи за создавање професионално присуство на Интернет.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Библиотека за скрипти на Патрик Луа",
                "text": "Корисна библиотека со скрипти на Луа за идна референца. Оваа библиотека се користи за автоматизирање на задачите во скриптите на Луа, кои можат да бидат корисни за задачи за потреба од перформанси, бидејќи Луа обично е побрз јазик за скриптирање од Пајтон и Руби.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Скрипти за табели на Мајкрософт Ексел на Патрик (ВБА)",
                "text": "Корисна библиотека со скрипти за VBA за Microsoft Excel. Оваа библиотека се користи за автоматизирање на задачите во табелите на Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Конфигурацијата на Патрик Неовим",
                "text": "Мојата лична конфигурација на Новим. Овој проект се користи за конфигурирање на Neovim според мојата желба, вклучително и прилагодени клучеви, теми и додатоци. Овој проект се користи за да се направи Neovim повеќе лесен за корисниците и ефикасен за мојата лична употреба.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Генератор на мапи на Патрик",
                "text": "Генератор на мапи во округот и државни мапи во САД, изграден со Пајтон со користење на библиотеките Геопандас и Матплотлиб. Овој проект се користи за генерирање мапи на Соединетите држави, вклучувајќи ги и окружните и државните мапи. Овој проект се користи за создавање сопствени мапи за визуелизација и анализа на податоците.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Библиотека за скрипти на Патрик Пауерсхел",
                "text": "Корисна библиотека со скрипти за PowerShell за идна референца. Корисно со функцијата за скрипти за профили $, сметам дека ова е неизмерно корисно за автоматизирање на задачите од терминалот Виндоус, бидејќи јас сум чест корисник на оперативниот систем Виндоус.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Библиотека за скрипти на Патрик Руби",
                "text": "Корисна библиотека со скрипти на Руби за идна референца. Корисно за идните концепти за развој на Руби на шини.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF Builder Builder",
                "text": "Прилагоден PDF градител изграден со Python преку екстензиите PDFKIT и Jinja2, заедно со форматирањето на HTML и JSON. Овој проект се користи за генерирање на PDF -датотеки од список на вештини и проекти. Овој проект може да се користи за создавање сопствена биографија на PDF, што е многу корисно за апликации за работа.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Проект за криптирање на Ријандел",
                "text": "Семејство од 10+ имплементации на алгоритмот за криптирање во Ријандел во 128, 192 и 256 бита. Овој проект се користи за да се демонстрира алгоритмот за криптирање на Ријандел на различни јазици за програмирање. Овој проект се користи за создавање семејство на имплементации на алгоритмот за криптирање во Ријандел.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod",
                "text": "Modecraft Mod кој додава сопствени алатки, оклоп, толпи, блокови, димензии и многу други карактеристики на играта. Изградена со Java верзии 8-17 за избрани верзии на Minecraft помеѓу 1,16 и 1,20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Јазик за програмирање на тигар",
                "text": "Обичен програмски јазик, изграден и во GO & Rust за да експериментирате со дизајнот на преведувачот и перформансите. Имплементирана на веб -страницата за портфолио со користење на веб -собрание.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Веб -страница за добрите страни на тигар",
                "text": "Веб -страница што ја изградив во 2024 година за Tiger Tairgating Pros, компанија за опашка во Клемсон, СЦ. Изграден со React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Проект за машина за теринг",
                "text": "Семејство од над 30+ имплементации на машината Туринг. Се користи за да се демонстрира комплетноста на Туринг за различни програмски јазици за истражување, особено за јазикот за програмирање на Тигар.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Јазик за програмирање на тигар"
    },
    "contact": {
        "title": "Контактирајте ме",
        "header": "Информации за контакт",
        "email": "pattygsocials@gmail.com",
        "description": "Одговарам на прашања од е -пошта, пораки на LinkedIn и пораки на Инстаграм. Исто така, ќе се јавам ако мојот број е обезбеден преку биографија или на друг начин, иако претпочитам да го чувам мојот телефонски број приватен."
    },
    "formatter": {
        "title": "JSON и YAML FORMATER",
        "description": "Formater Json & Yaml е алатка која ви овозможува да ги форматирате датотеките JSON и YAML. Изграден е со GO и WebAssembly, и дизајниран е да биде брз и ефикасен. Formater е дизајниран да биде лесен за употреба, со едноставен интерфејс кој ви овозможува да залепите во вашиот JSON или YAML код и да го форматирате со кликнување на копчето.",
        "more_info1": "За повеќе информации, погледнете го README во",
        "more_info2": "Json/yaml formatter складиште.",
        "format_as": "Формат како:",
        "auto_detect": "Автоматско откривање",
        "format": "Формат"
    },
    "cube_solver": {
        "title": "Решение на коцка Рубикс",
        "solve": "Реши"
    },
    "tiger": {
        "title": "Јазик на тигар",
        "description": "Јазикот за програмирање на Тигар е сопствен јазик за програмирање, изграден и во GO & Rust за да експериментира со дизајнот и перформансите на преведувачот. Имплементирана на веб -страницата за портфолио со користење на веб -собрание. Јазикот за програмирање на Тигар е сопствен јазик за програмирање, изграден и во GO & Rust за да експериментира со дизајнот и перформансите на преведувачот. Имплементирана на веб -страницата за портфолио со користење на веб -собрание.",
        "more_info1": "За повеќе информации, погледнете го README во",
        "more_info2": "Програмирање на тигар за програмирање Github складиште.",
        "select_engine": "Изберете мотор:",
        "tiger_code": "Тигар код:",
        "run_tiger": "Стартувај Тигар",
        "output": "Излез:"
    },
    "tab": {
        "title": "Патрик Гудвин",
        "description": "Инженер за целосен софтвер за оџаци со седиште во Централна Флорида"
    },
    "copy": {
        "text": "Копија",
        "copied": "Копирани!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Инстаграм",
        "linkedin": "LinkedIn",
        "tiktok": "Тикток",
        "youtube": "YouTube",
        "text_strip": "Следи ме"
    },
    "logotext": "Патрик"
}