{
    "name": "Патрик Гудвин",
    "menu": {
        "home": "Гэр",
        "about": "Миний тухай",
        "portfolio": "Портфолио",
        "projects": "Вэбсайт төслүүд",
        "tiger": "Tigisage хэл",
        "formatter": "JSON & YAML Formatter",
        "cube_solver": "Rubix Cube Solver",
        "contact": "Надтай холбогдоорой"
    },
    "home": {
        "title": "Гэр",
        "animated": {
            "first": "Бүрэн стек програм хангамжийн инженер",
            "second": "Вэб хөгжүүлэгч",
            "third": "Тоглоомын хөгжүүлэгч",
            "fourth": "Агуулга бүтээгч"
        },
        "footer": "Одоо вэбсайт нь 100+ хэлээр орчуулагдсан ба AVAINT-ийг дамжуулж, авах боломжтой!",
        "descriptionA": "Freeplet Profus програм хангамжийг сайжруулахын тулд javeCraft-ийн тусламжийн төслийн болон Apis-ийг хэрэгжүүлж, javeCraft-ийн javaftion-ийг үүсгэж, Apis-ийг хэрэгжүүлж, байнгын аписийг хэрэгжүүлж, тогтмол зохион байгуулалт,",
        "descriptionB": "Нэмж хэлэхэд би instagry, youtube, youtube, youtube, youtube, youtube, youtube, tiktok-ийг үүнд хүндэлж,,",
        "portfolio_button": "Миний портфолио",
        "contact_button": "Надтай холбогдоорой",
        "about_button": "Миний тухай"
    },
    "about": {
        "title": "Миний тухай",
        "personal_summary": {
            "title": "Хандааны үүрэг",
            "text": "Орландо, FLLONT програм хангамж, FLINCON COLDONTON COOTIONDER-д IS, JAVA ба C ++, NODECESE-ээс INESCENTIONESION-д үзүүлэв. Minecraft-д зориулсан Javehead Project-ийн бүртгэлийг Minecraft болон Truck Minecraft болон Truck Drive-д зориулсан JAVA-ийн драйверыг хөгжүүлэх, Төгсөлтийн амлалт нь төслийн менежментийн менежментийг хязгаарлаж, төвөгтэй асуудлыг шийдвэрлэх чадвартай бөгөөд нарийн төвөгтэй асуудлыг шийдвэрлэх, хэрэглэгчдийн туршлага, боловсруулалтын ажилтнуудыг сайжруулах өндөр чанартай шийдлийг гаргаж өгдөг."
        },
        "professional_experience": {
            "title": "Мэргэжлийн туршлага",
            "entries": [
                {
                    "jobtitle": "Junior програмын инженер",
                    "where": "Orion180 даатгал",
                    "date": "2024 - танилцуулах"
                },
                {
                    "jobtitle": "ҮЙЛДВЭРЛЭЛИЙН АВТОМАШИНГ, БҮРТГЭЛИЙН НЭГДСЭН",
                    "where": "Дрюпемем",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Бүрэн стек програм хангамжийн инженер",
                    "where": "Сурах хурдасгах",
                    "date": "2023"
                },
                {
                    "jobtitle": "Хар тугалга вэб хөгжүүлэгч (Оюутны хөтөлбөр)",
                    "where": "Клемсон их сургуулийн GDI хөтөлбөр",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "ШИНЭ ОЛОН УРЬЖ БАЙНА",
                    "where": "Клемсон их сургууль",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Техникийн ур чадвар",
            "header1": "Програмчлалын хэл",
            "header2": "Хүрээ ба номын сан",
            "header3": "Хэрэгсэл ба технологи"
        },
        "services": {
            "title": "Миний үйлчилгээ",
            "entries": [
                {
                    "title": "Бүрэн овоолсон инженерчлэл",
                    "text": "Урьдчилан болон арын болон арын хөгжлийн судалгаагаар дэлгэрэнгүй, арын хэсгүүдэд дамжуулан бүх програм хангамжийн туршлагыг санал болгож байна."
                },
                {
                    "title": "Техног",
                    "text": "Access, CSS, CSS, CS, JAVS, JAVESCRIT FINED-тэй мэргэжлийн хүчин чадалтай."
                },
                {
                    "title": "Тоглоомын хөгжил",
                    "text": "Java ба C & C ++ гэх мэт хөшүүргийн хэлийг ашиглах, оновчтой тоглоомын туршлагыг хэрэгжүүлэх, оновчтой болгох, оновчтой байдал, гөлгөр гүйцэтгэл, гөлгөр гүйцэтгэлийг бий болгоход чиглэсэн байдаг."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Портфолио",
        "filter_by": "Portfolio-г шалгана уу:",
        "entries": {
            "biblioteca": {
                "title": "Библиотека Жсон",
                "text": "Хэлний орчуулгыг даван туулах python төсөл. Миний вэбсайтын портфолиоыг 70+ хэлээр орчуулахыг хориглоно. Энэ төслийг олон суралцаж буй хүмүүст илүү их хэрэгтэй, олон тооны үзэгчдэд хүрэхэд маш их хэрэгтэй байдаг. Энэ төслийн тусламжтайгаар дэлхийн 99-өөс дээш хувь нь миний портфолиоыг чөлөөтэй хэлээр уншиж чаддаг.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Дөрөв",
                "text": "Холболтын дөрвөн тоглолтын 50+ гаруй+ хэрэглээтэй гэр бүл. Энэхүү төсөл нь java, c ++, ++, ++, ++, python, javascript, үүнд үүнд 30 гаруй програмчлалд багтдаг. Нэмж хэлбэл, энэ нь 20+ өөр форман эсвэл бусад формат эсвэл бусад формат эсвэл төмөр зам, aspse, asp.net, бусад.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Халамжийн төсөл",
                "text": "Өөр өөр програмчлалын хэл хоорондын хоорондох харилцан үйлчлэлийн харилцан үйлчлэл. Одоогийн байдлаар 15 өөр програмчлалын хэл, 18-ийн гүйцэтгэлийн хээ орно.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "JSON & YAML AUTO FORMATTRATE",
                "text": "ХУВИЙН ХУВЬЦАА & Autoformourcator нь JSON & YAML файлууд. Энэ төслийг JSON & YAML файлуудыг форматлахад ашигладаг, кодыг цэвэрлэхэд хэрэгтэй байдаг. Гол, суулгасан, вебсайтны төсөл болгон миний портфолио руу байрлуулсан. Ирээдүйд илүү олон форматууд.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft json generator",
                "text": "MINECRAFT READE PYTONT-д PyThone-д зориулсан хөнгөн JOND генераторыг барьсан. Энэ төсөл нь MINECRAFT MODS-д JSOAFT MODS-д CONDECRAFT MODS-д зориулагдсан JSOAFT файлуудыг үүсгэхэд ашигладаг. Зөвхөн зан үйлийн дата үүсгэхгүй байх нь маш их хэрэгтэй, гэхдээ mods-д бас mods нэр солих функцээр дамждаг.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Миний боловсролын туршлага",
                "text": "Миний хувийн төслүүдийн хажууд, би боловсролын туршлагаас олон ур чадвар эзэмшсэн. Миний LinkedIn профайлыг үзэхийн тулд энд дарна уу.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Мэргэжлийн туршлага",
                "text": "Миний хувийн төслүүдийн хажууд, бас мэргэжлийн туршлагаасаа олон ур чадвар эзэмшсэн. Миний LinkedIn профайлыг үзэхийн тулд энд дарна уу.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Патрик Гудвин Портфолио вэбсайт",
                "text": "Энэ вэбсайт бол миний хувийн портфолио вэбсайт юм. Энэ төслийг миний ур чадвар, төслүүдийг харуулахын тулд, мөн болзошгүй ажил олгогчдод хандахын тулд платформыг үзүүлэхэд ашигладаг. Энэ төслийг мэргэжлийн онлайн байгаа эсэхийг бий болгоход ашигладаг.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Патрикийн Луа Скриптийн номын сан",
                "text": "Ирээдүйн лавлагаанд зориулсан LUA Scripts-ийн ашигтай номын сан. Энэ номын сан нь LUA Scripts-ийн даалгавруудыг ашиглан луа-гийн тусламжтайгаар хийх ажлыг гүйцэтгэж болох, луйвар хийх боломжтой.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Патрикийн Microsoft Excel-ийн хүснэгт скрипт (VBA)",
                "text": "Microsoft Excel-ийн VBA-ийн скриптүүдийн ашигтай сан. Энэ номын сан нь Excel хүснэгтэд даалгавруудыг автоматжуулахад ашиглагддаг.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Патрикийн Неовимийн тохиргоо",
                "text": "Миний хувийн неовимийн тохиргоо. Энэ төслийг неов ял оноох түлхүүрийн түлхүүр, сэдэв, загвар, залгаасыг багтаасан болно. Энэ төслийг өөрийн хувийн хэрэглээнд ээлтэй, үр дүнтэй болгоход ашигладаг.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Патрикийн газрын зургийн генератор",
                "text": "АНУ-ын County County & State газрын зургийн генератор, геопанда ба Matplotlib номын санг ашиглан питоноор барьсан. Энэ төсөл нь АНУ-ын газрын зураг үүсгэхэд ашиглагддаг, муж, улсын газрын зураг үүсгэдэг. Энэ төсөл нь өгөгдлийн дүрслэл, дүн шинжилгээ, дүн шинжилгээ хийхэд зориулагдсан хувийн газрын зургийг үүсгэхэд ашиглагддаг.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Патрикийн PowerShell Script-ийн номын сан",
                "text": "Ирээдүйн лавлагааны eAcershell скриптийн хэрэгцээтэй номын сан. Профайлын скрипт функцэд ашиг тустай, би Windows OS-ийн байнгын хэрэглэгчдийн байнга хэрэглэгчдээс автоматаар даалгаврыг агуулдаг.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Патрикийн бадмаараг скрипт номын сан",
                "text": "Ирээдүйд лавлагаанд зориулж бадмаараг скриптүүдийн ашигтай номын сан. Ирээдүйн бадмаараг rails-ийн хөгжлийн тухай ойлголтын талаархи ашиг тустай.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF ур чадварын барилгачин",
                "text": "PDFKIT ба JINJIT, JINJA2-ээр дамжуулан PDFKIT болон JINCING BORED, HTML, JSON FARTERACTEADED-ээр дамжуулан барьсан. Энэ төслийг ур чадвар, төслийн жагсаалтаас PDF файл үүсгэхэд ашигладаг. Энэ төслийг PDF PDF-ийг үүсгэхэд ашиглаж болно.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "RIJANDEL Шифрлэлтийн төсөл",
                "text": "192, 192, 256, 256 бит, 256 бит. Энэ төсөл нь Rijandel шифрлэлтийн шифрлэлт алгоритмыг өөр өөр програмчлалын хэл дээр харуулахад ашиглагддаг. Энэхүү төслийг Rijandel distribrp этгээдийн алгоритмын хэрэгжүүлгийн байгууллагаа үүсгэхэд ашигладаг.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Supresmc Minecraft Mod",
                "text": "Захиалга, хуяг, Moor, Mobs, Mobs, блок, хэмжээс, хэмжээст, олон функцийг нэмж оруулдаг Minecraft mod. Java хувилбарыг 1.16 ба 1.20 хооронд сонгоно уу.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tiger програмчлалын хэл",
                "text": "СУРГАЛТЫН ХАМГИЙН ХУГАЦААНЫ ХУГАЦААНЫ ХУГАЦААНЫ ХУГАЦААНЫ ТУХАЙ ХУУЛИЙН ХУВЬЦАА. Вэб чуулгыг ашиглан PortFolio вэбсайт дээр хэрэгжүүлсэн.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger Taingating ProS вэбсайт",
                "text": "Tiger Outgating Prose-д зориулж 2024 оны вэбсайт, Клемсон дахь оёдлын компанид зориулж хийсэн вэбсайт. Урвалд орсон .js .js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "TUNNING MAVE төсөл",
                "text": "Туркийн машины 30+ гаруй хэрэглээ. Судалгааны янз бүрийн хэллэгийг судалж, ялангуяа Tiger програмчлалын хэл дээр янз бүрийн програмчлалын хэл дээр бүрэн гүйцэд үзүүлэхэд ашигладаг.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tiger програмчлалын хэл"
    },
    "contact": {
        "title": "Надтай холбогдоорой",
        "header": "Холбогдох мэдээлэл",
        "email": "PattyGSocials@gmail.com",
        "description": "Би имэйл, LinkedIn мессеж, Instagram мессежээс лавлагаа өгөхөд хариу өгч байна. Хэрэв миний утасны дугаарыг ашиглан дугаараа өгөх эсвэл өөрөөр хэлбэл би утасны дугаараа нууцлахыг илүүд үздэг бол буцааж залгах болно."
    },
    "formatter": {
        "title": "JSON & YAML Formatter",
        "description": "JSON & YAML Facebatter бол JSON, YAML файлуудыг форматлах боломжийг олгодог хэрэгсэл юм. Энэ нь GO ба WEBASEMBLEMBLIMBLIMBLIMBLE-ийг барьсан бөгөөд энэ нь хурдан бөгөөд үр дүнтэй байх зорилготой юм. Форматорууд нь json эсвэл yaml код дээр буулгахад хялбар интерфэйсийг ашиглахад хялбар бөгөөд үүнийг товшоод товчин дээр дарна уу.",
        "more_info1": "Дэлгэрэнгүй мэдээллийг, readme-д хандана уу",
        "more_info2": "JSON / YAML Formater Repoository.",
        "format_as": "Дараах байдлаар форматлах:",
        "auto_detect": "Автоматаар илрүүлэх",
        "format": "Хэлбэр хэмжээ"
    },
    "cube_solver": {
        "title": "Rubix Cube Solver",
        "solve": "Бодох"
    },
    "tiger": {
        "title": "Tigisage хэл",
        "description": "Tiger програмчлалын хэл нь орчуулагч, гүйцэтгэлтэй туршилт, гүйцэтгэлтэйгээр хийсэн хувийн програмчлалын хэл юм. Вэб чуулгыг ашиглан PortFolio вэбсайт дээр хэрэгжүүлсэн. Tiger програмчлалын хэл нь орчуулагч, гүйцэтгэлтэй туршилт, гүйцэтгэлтэйгээр хийсэн хувийн програмчлалын хэл юм. Вэб чуулгыг ашиглан PortFolio вэбсайт дээр хэрэгжүүлсэн.",
        "more_info1": "Дэлгэрэнгүй мэдээллийг, readme-д хандана уу",
        "more_info2": "Tiger програмчлалын хэл github хадгалах газар.",
        "select_engine": "Хөдөлгүүрийг сонгоно уу:",
        "tiger_code": "Tiger код:",
        "run_tiger": "Гүйх",
        "output": "Гаралт:"
    },
    "tab": {
        "title": "Патрик Гудвин",
        "description": "Төв флорида дээр суурилсан бүрэн стек програм хангамжийн инженер"
    },
    "copy": {
        "text": "Хуулах",
        "copied": "Хуулбарласан!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Inasstrras",
        "linkedin": "Лингай даавуу",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Намайг дига"
    },
    "logotext": "Эх хүүхд тэтгот"
}