{
    "name": "पॅट्रिक गुडविन",
    "menu": {
        "home": "मुख्यपृष्ठ",
        "about": "माझ्याबद्दल",
        "portfolio": "पोर्टफोलिओ",
        "projects": "वेबसाइट प्रकल्प",
        "tiger": "वाघ भाषा",
        "portfolio_translator": "पोर्टफोलिओ अनुवादक",
        "formatter": "JSON आणि YAML स्वरूप",
        "cube_solver": "रुबिक्स क्यूब सॉल्व्हर",
        "contact": "माझ्याशी संपर्क साधा"
    },
    "home": {
        "title": "मुख्यपृष्ठ",
        "animated": {
            "first": "पूर्ण स्टॅक सॉफ्टवेअर अभियंता",
            "second": "वेब विकसक",
            "third": "गेम विकसक",
            "fourth": "सामग्री निर्माता"
        },
        "footer": "वेबसाइट आता अनुवादित आणि 100+ भाषांमध्ये उपलब्ध!",
        "descriptionA": "अनुभवी पूर्ण-स्टॅक सॉफ्टवेअर अभियंता आणि वेब विकसक यशस्वीरित्या अग्रगण्य विकास प्रकल्पांच्या प्रात्यक्षिक इतिहासासह, मिनीक्राफ्टसाठी जावा बदल तयार करण्यापासून प्रतिक्रिया.जेमध्ये वापरकर्त्याचा अनुभव वाढविण्यापासून आणि सुरक्षित आरईएसटी एपीआयची अंमलबजावणी करण्यापासून, सतत चपळ पद्धती आणि प्रभावी कार्यसंघ सहकार्याने कार्यरत आहेत.",
        "descriptionB": "याव्यतिरिक्त, मी एक भूगोल सामग्री निर्माता आहे ज्याने एक आदरणीय आणि आकर्षक अनुयायी बेस मिळविण्यासाठी इन्स्टाग्राम, यूट्यूब आणि टिकटोकसह एकाधिक सोशल मीडिया प्लॅटफॉर्मच्या अल्गोरिदमचा यशस्वीरित्या फायदा केला आहे.",
        "portfolio_button": "माझा पोर्टफोलिओ",
        "contact_button": "माझ्याशी संपर्क साधा",
        "about_button": "माझ्याबद्दल"
    },
    "about": {
        "title": "माझ्याबद्दल",
        "personal_summary": {
            "title": "वैयक्तिक सारांश",
            "text": "ऑर्लॅंडो, एफएल येथे आधारित एक अनुभवी पूर्ण स्टॅक सॉफ्टवेअर विकसक म्हणून, मी जावा आणि सी ++ पासून प्रतिक्रिया. जेएस आणि नोड.जे. पर्यंत विविध तंत्रज्ञानामध्ये कौशल्य दर्शविले आहे. मिनीक्राफ्टसाठी जावा मॉडिफिकेशन प्रोग्रामच्या विकासासह आणि ट्रक ड्रायव्हर्ससाठी फायद्याची वेबसाइट यासह भालेच्या प्रकल्पांच्या ट्रॅक रेकॉर्डसह, मी नेतृत्व आणि नाविन्यपूर्ण प्रदर्शन केले आहे. प्रोजेक्ट मॅनेजमेंट सुव्यवस्थित करणे, जटिल समस्या सोडविणे आणि वापरकर्त्याचा अनुभव वाढविणारे आणि संघटनात्मक यश चालविणारी उच्च-गुणवत्तेची निराकरणे देण्याच्या माझ्या क्षमतेमध्ये उत्कृष्टतेबद्दलची माझी वचनबद्धता स्पष्ट आहे."
        },
        "professional_experience": {
            "title": "व्यावसायिक अनुभव",
            "entries": [
                {
                    "jobtitle": "कनिष्ठ सॉफ्टवेअर अभियंता",
                    "where": "ओरियन 180 विमा",
                    "date": "2024 - उपस्थित"
                },
                {
                    "jobtitle": "संस्थापक आणि पूर्ण स्टॅक सॉफ्टवेअर विकसक",
                    "where": "सुपरमेमक",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "पूर्ण स्टॅक सॉफ्टवेअर अभियंता",
                    "where": "शिक्षणास गती द्या",
                    "date": "2023"
                },
                {
                    "jobtitle": "लीड वेब विकसक (विद्यार्थी प्रोग्राम)",
                    "where": "क्लेमसन युनिव्हर्सिटी जीडीआय प्रोग्राम",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "डेस्क सुपरवायझर",
                    "where": "क्लेमसन विद्यापीठ",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "डेस्क सुपरवायझर",
                    "where": "क्लेमसन विद्यापीठ",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "तांत्रिक कौशल्ये",
            "header1": "प्रोग्रामिंग भाषा",
            "header2": "फ्रेमवर्क आणि लायब्ररी",
            "header3": "साधने आणि तंत्रज्ञान"
        },
        "services": {
            "title": "माझ्या सेवा",
            "entries": [
                {
                    "title": "पूर्ण स्टॅक अभियांत्रिकी",
                    "text": "मी संपूर्ण सॉफ्टवेअर स्टॅकमध्ये अखंड एकत्रीकरण आणि कार्यक्षमता सुनिश्चित करून, फ्रंट-एंड आणि बॅक-एंड विकास दोन्हीमध्ये सर्वसमावेशक निराकरणे ऑफर करतो."
                },
                {
                    "title": "वेब विकास",
                    "text": "एचटीएमएल, सीएसएस आणि रिएक्ट.जेएस सारख्या जावास्क्रिप्ट फ्रेमवर्कमधील तज्ञांसह, मी ग्राहकांच्या विशिष्ट गरजा आणि प्राधान्ये पूर्ण करण्यासाठी दृश्यास्पद आणि वापरकर्ता-अनुकूल वेबसाइट्स तयार करतो."
                },
                {
                    "title": "खेळ विकास",
                    "text": "जावा आणि सी ++ सारख्या भाषांचा फायदा घेत, मी संकल्पना आणि डिझाइनपासून अंमलबजावणी आणि ऑप्टिमायझेशनपर्यंत, व्यस्त गेमप्ले आणि गुळगुळीत कामगिरी सुनिश्चित करून, विसर्जित गेमिंग अनुभव तयार करण्यात तज्ज्ञ आहे."
                }
            ]
        }
    },
    "portfolio": {
        "title": "पोर्टफोलिओ",
        "filter_by": "द्वारा फिल्टर पोर्टफोलिओ:",
        "entries": {
            "biblioteca": {
                "title": "बिब्लिओटेका जेसन",
                "text": "एक पायथन प्रकल्प जो भाषा भाषांतर सुव्यवस्थित करतो. स्पॅनिश, फ्रेंच, चीनी, अरबी आणि इतर बर्‍याच जणांसह माझ्या वेबसाइट पोर्टफोलिओचे 70+ भाषांमध्ये भाषांतर करण्यास अनुमती देते. हा प्रकल्प बहुभाषिक वेबसाइट पोर्टफोलिओ तयार करण्यासाठी वापरला जातो, जो व्यापक प्रेक्षकांपर्यंत पोहोचण्यासाठी खूप उपयुक्त आहे. या प्रकल्पासह, जगातील 99% पेक्षा जास्त लोक माझा पोर्टफोलिओ अस्खलित भाषेत वाचू शकतात.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "चार कनेक्ट करा",
                "text": "कनेक्ट फोर गेमच्या 50+ पेक्षा जास्त अंमलबजावणीचे भव्य कुटुंब. या प्रकल्पात जावा, सी ++, पायथन, जावास्क्रिप्ट आणि बरेच काही यासह 30 हून अधिक वेगवेगळ्या प्रोग्रामिंग भाषांमध्ये अंमलबजावणीचा समावेश आहे. याव्यतिरिक्त, यात 20+ हून अधिक भिन्न फ्रेमवर्क किंवा इतर स्वरूपांचा समावेश आहे, ज्यात रिएक्ट.जेएस, रुबी ऑन रेल्स, एएसपी.नेट आणि बरेच काही समाविष्ट आहे.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "किराणा अ‍ॅप",
                "text": "किराणा आयटम व्यवस्थापित करण्यासाठी संपूर्ण पूर्ण-स्टॅक .नेट 9 ब्लेझर सर्व्हर अनुप्रयोग. अनुप्रयोग चिकाटीसाठी अस्तित्वाच्या फ्रेमवर्क कोअरसह कंट्रोलर/सर्व्हिस/रेपॉजिटरी पॅटर्नचे अनुसरण करतो आणि त्यात एक व्यापक चाचणी सूट समाविष्ट आहे.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "इंटरप प्रोजेक्ट",
                "text": "एक प्रकल्प जो वेगवेगळ्या प्रोग्रामिंग भाषांमधील इंटरऑपरेबिलिटीचे दस्तऐवज करतो. सध्या 15 भिन्न प्रोग्रामिंग भाषा आणि 18 अंमलबजावणीच्या नमुन्यांचा समावेश आहे.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "इन्व्हेंटरी रजिस्टर",
                "text": "एंग्युलर 17+ आणि नोड.जे. सह तयार केलेल्या इन्व्हेंटरी मॅनेजमेंट सिस्टमसह पूर्ण-स्टॅक डेमो पॉईंट ऑफ सेल (पीओएस) नोंदणी करा. हा अनुप्रयोग वापरकर्ता प्रमाणीकरण, भूमिका-आधारित प्रवेश नियंत्रण, इन्व्हेंटरी ट्रॅकिंग आणि मॉक पेमेंट प्रोसेसिंगसह एक व्यावसायिक-ग्रेड पीओएस सिस्टम दर्शवितो.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "JSON आणि YAML ऑटो स्वरूप",
                "text": "जेएसओएन आणि यामल फायलींसाठी एक लाइन्टर आणि ऑटोफॉर्मेटर. हा प्रकल्प जेएसओएन आणि यामल फायलींचे स्वरूपन करण्यासाठी वापरला जातो, जो कोड स्वच्छ आणि व्यवस्थित ठेवण्यासाठी खूप उपयुक्त आहे. वेबसह तयार केलेले, वेबसेंब्लीसह संकलित केलेले आणि वेबसाइट प्रोजेक्ट म्हणून माझ्या पोर्टफोलिओमध्ये एम्बेड केलेले. भविष्यात अधिक स्वरूप येणे.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON जनरेटर",
                "text": "मिनीक्राफ्ट रिसोर्स अँड डेटा पॅकसाठी पायथनमध्ये तयार केलेले लाइटवेट जेएसओएन जनरेटर. हा प्रकल्प सानुकूल आयटम, ब्लॉक्स आणि घटकांसह मिनीक्राफ्ट मोडसाठी जेएसओएन फायली व्युत्पन्न करण्यासाठी वापरला जातो. केवळ सानुकूल डेटापॅक तयार करण्यासाठीच नव्हे तर मोडसाठी तसेच मोड नावाच्या स्विचिंग वैशिष्ट्याद्वारे मोडसाठी उपयुक्त आहे.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "माझा शैक्षणिक अनुभव",
                "text": "माझ्या वैयक्तिक प्रकल्पांबरोबरच मी शैक्षणिक अनुभवातून असंख्य कौशल्ये देखील मिळविली आहेत. अधिक माहितीसाठी माझे लिंक्डइन प्रोफाइल पाहण्यासाठी येथे क्लिक करा.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "माझा व्यावसायिक अनुभव",
                "text": "माझ्या वैयक्तिक प्रकल्पांबरोबरच, मी व्यावसायिक अनुभवातून असंख्य कौशल्ये देखील मिळविली आहेत. अधिक माहितीसाठी माझे लिंक्डइन प्रोफाइल पाहण्यासाठी येथे क्लिक करा.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "पॅट्रिक गुडविन पोर्टफोलिओ वेबसाइट",
                "text": "ही वेबसाइट माझी वैयक्तिक पोर्टफोलिओ वेबसाइट आहे, जी रिएक्ट.जेएससह तयार केलेली आहे. हा प्रकल्प माझे कौशल्य आणि प्रकल्प प्रदर्शित करण्यासाठी तसेच संभाव्य नियोक्ते माझ्याशी संपर्क साधण्यासाठी व्यासपीठ प्रदान करण्यासाठी वापरला जातो. हा प्रकल्प व्यावसायिक ऑनलाइन उपस्थिती तयार करण्यासाठी वापरला जातो.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "पॅट्रिकची लुआ स्क्रिप्ट लायब्ररी",
                "text": "भविष्यातील संदर्भासाठी लुआ स्क्रिप्टची उपयुक्त लायब्ररी. या लायब्ररीचा उपयोग एलयूए स्क्रिप्टमध्ये कामे स्वयंचलित करण्यासाठी केला जातो, जो कामगिरी-आवश्यक कार्यांसाठी उपयोगी ठरू शकतो, कारण एलयूए सहसा पायथन आणि रुबी या दोहोंपेक्षा वेगवान स्क्रिप्टिंग भाषा असते.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "पॅट्रिकची मायक्रोसॉफ्ट एक्सेल स्प्रेडशीट स्क्रिप्ट्स (व्हीबीए)",
                "text": "मायक्रोसॉफ्ट एक्सेलसाठी व्हीबीए स्क्रिप्टची उपयुक्त लायब्ररी. या लायब्ररीचा वापर एक्सेल स्प्रेडशीटमध्ये कार्य स्वयंचलित करण्यासाठी केला जातो.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "पॅट्रिकची निओव्हिम कॉन्फिगरेशन",
                "text": "माझे वैयक्तिक निओव्हिम कॉन्फिगरेशन. हा प्रकल्प सानुकूल कीबिंडिंग्ज, थीम आणि प्लगइनसह माझ्या आवडीनुसार निओव्हिम कॉन्फिगर करण्यासाठी वापरला जातो. हा प्रकल्प माझ्या वैयक्तिक वापरासाठी नवोव्हिमला अधिक वापरकर्ता-अनुकूल आणि कार्यक्षम करण्यासाठी वापरला जातो.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "पॅट्रिकचा नकाशा जनरेटर",
                "text": "जिओपॅन्डस आणि मॅटप्लोटलिब लायब्ररी वापरुन पायथनसह तयार केलेले युनायटेड स्टेट्स काउंटी आणि राज्य नकाशा जनरेटर. हा प्रकल्प काउन्टी आणि राज्य नकाशेसह अमेरिकेचे नकाशे तयार करण्यासाठी वापरला जातो. हा प्रकल्प डेटा व्हिज्युअलायझेशन आणि विश्लेषणासाठी सानुकूल नकाशे तयार करण्यासाठी वापरला जातो.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "पॅट्रिकची पॉवरशेल स्क्रिप्ट लायब्ररी",
                "text": "भविष्यातील संदर्भासाठी पॉवरशेल स्क्रिप्ट्सची एक उपयुक्त लायब्ररी. $ प्रोफाइल स्क्रिप्ट वैशिष्ट्यासह उपयुक्त, विंडोज टर्मिनलमधून स्वयंचलित कार्यांसाठी हे मला खूप उपयुक्त वाटते, कारण मी विंडोज ओएसचा वारंवार वापरकर्ता आहे.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "पॅट्रिकची रुबी स्क्रिप्ट लायब्ररी",
                "text": "भविष्यातील संदर्भासाठी रुबी स्क्रिप्ट्सची एक उपयुक्त लायब्ररी. भविष्यात रुबीसाठी रेल्स डेव्हलपमेंटल कॉन्सेप्ट्ससाठी उपयुक्त.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "पीडीएफ कौशल्य बिल्डर",
                "text": "एचटीएमएल आणि जेएसओएन फॉरमॅटिंगसह पीडीएफकिट आणि जिन्जा 2 विस्तारांद्वारे पायथनसह तयार केलेला एक सानुकूल पीडीएफ बिल्डर. हा प्रकल्प कौशल्य आणि प्रकल्पांच्या सूचीमधून पीडीएफ फायली व्युत्पन्न करण्यासाठी वापरला जातो. हा प्रकल्प सानुकूल पीडीएफ रेझ्युमे तयार करण्यासाठी वापरला जाऊ शकतो, जो नोकरीच्या अनुप्रयोगांसाठी खूप उपयुक्त आहे.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "रिजांडेल एन्क्रिप्शन प्रकल्प",
                "text": "128, 192 आणि 256 बिट्समध्ये रिजांडेल एन्क्रिप्शन अल्गोरिदमच्या 10+ अंमलबजावणीचे कुटुंब. हा प्रकल्प वेगवेगळ्या प्रोग्रामिंग भाषांमध्ये रिजांडेल एन्क्रिप्शन अल्गोरिदम दर्शविण्यासाठी वापरला जातो. हा प्रकल्प रिजांडेल एन्क्रिप्शन अल्गोरिदमच्या अंमलबजावणीचे कुटुंब तयार करण्यासाठी वापरला जातो.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "सुपरमेमक मिनीक्राफ्ट मोड",
                "text": "गेममध्ये सानुकूल साधने, चिलखत, मॉब, ब्लॉक्स, परिमाण आणि बर्‍याच वैशिष्ट्ये जोडणारी एक मिनीक्राफ्ट मोड. 1.16 ते 1.20 दरम्यान निवडलेल्या मिनीक्राफ्ट आवृत्त्यांसाठी जावा आवृत्ती 8-17 सह तयार केलेले.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "वाघ प्रोग्रामिंग भाषा",
                "text": "इंटरप्रिटर डिझाइन आणि कामगिरीचा प्रयोग करण्यासाठी जीओ आणि रस्ट या दोहोंमध्ये तयार केलेली सानुकूल प्रोग्रामिंग भाषा. वेब असेंब्ली वापरुन पोर्टफोलिओ वेबसाइटवर लागू केले.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "वाघ टेलगेटिंग प्रो वेबसाइट",
                "text": "टायगर टेलगेटिंग प्रो, क्लेमसन, एससी मधील टेलगेटिंग कंपनीसाठी मी 2024 मध्ये तयार केलेली वेबसाइट. Reect.js सह अंगभूत.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "ट्युरिंग मशीन प्रकल्प",
                "text": "ट्युरिंग मशीनच्या 30+ पेक्षा जास्त अंमलबजावणीचे कुटुंब. संशोधनासाठी, विशेषत: वाघ प्रोग्रामिंग भाषेसाठी वेगवेगळ्या प्रोग्रामिंग भाषांसाठी ट्युरिंग पूर्णता दर्शविण्यासाठी वापरले जाते.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "वाघ प्रोग्रामिंग भाषा"
    },
    "contact": {
        "title": "माझ्याशी संपर्क साधा",
        "header": "संपर्क माहिती",
        "email": "PATTYEGSOCIALS@gmail.com",
        "description": "मी ईमेल, लिंक्डइन संदेश आणि इन्स्टाग्राम संदेशांच्या चौकशीस प्रतिसाद देतो. माझा नंबर रेझ्युमेद्वारे किंवा अन्यथा प्रदान केल्यास मी परत कॉल करेन, जरी मी माझा फोन नंबर खाजगी ठेवणे पसंत करतो."
    },
    "formatter": {
        "title": "JSON आणि YAML स्वरूप",
        "description": "जेएसओएन आणि यामल फॉरमॅटर हे एक साधन आहे जे आपल्याला जेएसओएन आणि यामल फायलींचे स्वरूपन करण्यास अनुमती देते. हे गो आणि वेबसेंब्लीसह तयार केले गेले आहे आणि ते वेगवान आणि कार्यक्षम होण्यासाठी डिझाइन केलेले आहे. फॉरमॅटर वापरण्यास सुलभ बनविण्यासाठी डिझाइन केलेले आहे, एका साध्या इंटरफेससह जे आपल्याला आपल्या जेएसओएन किंवा यामल कोडमध्ये पेस्ट करण्यास आणि बटणाच्या क्लिकसह स्वरूपित करण्यास अनुमती देते.",
        "more_info1": "अधिक माहितीसाठी, मधील रीडमचा संदर्भ घ्या",
        "more_info2": "JSON/YAML फॉर्मॅटर रेपॉजिटरी.",
        "format_as": "म्हणून स्वरूपः",
        "auto_detect": "स्वयं शोध",
        "format": "स्वरूप"
    },
    "cube_solver": {
        "title": "रुबिक्स क्यूब सॉल्व्हर",
        "start": "सोडवा"
    },
    "tiger": {
        "title": "वाघ भाषा",
        "description": "टायगर प्रोग्रामिंग भाषा ही एक सानुकूल प्रोग्रामिंग भाषा आहे जी इंटरप्रिटर डिझाइन आणि कामगिरीचा प्रयोग करण्यासाठी जीओ आणि रस्ट या दोहोंमध्ये तयार केलेली आहे. वेब असेंब्ली वापरुन पोर्टफोलिओ वेबसाइटवर लागू केले. टायगर प्रोग्रामिंग भाषा ही एक सानुकूल प्रोग्रामिंग भाषा आहे जी इंटरप्रिटर डिझाइन आणि कामगिरीचा प्रयोग करण्यासाठी जीओ आणि रस्ट या दोहोंमध्ये तयार केलेली आहे. वेब असेंब्ली वापरुन पोर्टफोलिओ वेबसाइटवर लागू केले.",
        "more_info1": "अधिक माहितीसाठी, मधील रीडमचा संदर्भ घ्या",
        "more_info2": "वाघ प्रोग्रामिंग भाषा गीथब रेपॉजिटरी.",
        "select_engine": "इंजिन निवडा:",
        "tiger_code": "वाघ कोड:",
        "run_tiger": "वाघ चालवा",
        "output": "आउटपुट:"
    },
    "tab": {
        "title": "पॅट्रिक गुडविन",
        "description": "सेंट्रल फ्लोरिडामध्ये आधारित पूर्ण स्टॅक सॉफ्टवेअर अभियंता"
    },
    "copy": {
        "text": "कॉपी",
        "copied": "कॉपी!"
    },
    "social_media": {
        "github": "गीथब",
        "instagram": "इन्स्टाग्राम",
        "linkedin": "लिंक्डइन",
        "tiktok": "टिकटोक",
        "youtube": "YouTube",
        "text_strip": "माझे अनुसरण करा"
    },
    "languages": {
        "title": "पोर्टफोलिओ अनुवादक",
        "description": "100 पेक्षा जास्त भाषांच्या समर्थनासह जगभरातील अभ्यागतांसाठी माझा पोर्टफोलिओ कसा प्रवेशयोग्य आहे ते शोधा.",
        "global_accessibility": {
            "title": "जागतिक प्रवेशयोग्यता",
            "description": "माझा पोर्टफोलिओ ओव्हर {गणना} भाषांमध्ये उपलब्ध आहे, ज्यामुळे तो जगभरातील अभ्यागतांसाठी प्रवेशयोग्य आहे. हा बहुभाषिक दृष्टीकोन सॉफ्टवेअर डेव्हलपमेंटमधील सर्वसमावेशकता आणि जागतिक पोहोच याबद्दलची माझी वचनबद्धता दर्शवते.",
            "stats": {
                "languages_supported": "भाषा समर्थित",
                "countries_represented": "देशांचे प्रतिनिधित्व केले",
                "continents_covered": "खंड झाकलेले"
            }
        },
        "features": {
            "title": "वैशिष्ट्ये",
            "items": [
                {
                    "title": "रीअल-टाइम भाषांतर:",
                    "description": "भाषा निवडकर्त्यासह त्वरित भाषा स्विच करा"
                },
                {
                    "title": "URL-आधारित भाषा:",
                    "description": "भाषेची प्राधान्ये URL मध्ये संरक्षित आहेत"
                },
                {
                    "title": "नेटिव्ह स्क्रिप्ट समर्थन:",
                    "description": "अरबी, चीनी, हिंदी आणि अधिक सारख्या स्क्रिप्टचे योग्य प्रस्तुत"
                },
                {
                    "title": "सांस्कृतिक संवेदनशीलता:",
                    "description": "भाषांतर केवळ शाब्दिक अर्थ नव्हे तर सांस्कृतिक संदर्भांचा विचार करतात"
                },
                {
                    "title": "एसईओ ऑप्टिमाइझः",
                    "description": "प्रत्येक भाषेचा प्रकार शोध इंजिनसाठी ऑप्टिमाइझ केला जातो"
                }
            ]
        },
        "world_map": {
            "title": "परस्परसंवादी जागतिक नकाशा",
            "description": "त्यांच्या समर्थित भाषा पाहण्यासाठी नकाशावर देशांवर फिरवा:",
            "languages_label": "भाषा",
            "legend": {
                "supported": "भाषा समर्थित",
                "not_supported": "भाषा समर्थन नाही"
            },
            "zoom_controls": {
                "zoom_in": "झूम इन",
                "zoom_out": "झूम आउट",
                "reset": "रीसेट व्ह्यू"
            }
        },
        "supported_languages": {
            "title": "समर्थित भाषा"
        },
        "interactive_country_map": {
            "title": "परस्परसंवादी देश नकाशा",
            "description": "त्यांच्या समर्थित भाषा पाहण्यासाठी खालील देशांवर फिरवा:",
            "language_count": {
                "single": "भाषा",
                "multiple": "भाषा"
            }
        },
        "tooltips": {
            "no_language_support": "भाषा समर्थन नाही"
        }
    },
    "logotext": "पॅट्रिक"
}