{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Rumah",
        "about": "Mengenai saya",
        "portfolio": "Portfolio",
        "projects": "Projek laman web",
        "tiger": "Bahasa harimau",
        "portfolio_translator": "Penerjemah Portfolio",
        "formatter": "Formatter Json & Yaml",
        "cube_solver": "Rubix Cube Solver",
        "contact": "Hubungi saya"
    },
    "home": {
        "title": "Rumah",
        "animated": {
            "first": "Jurutera Perisian Stack Penuh",
            "second": "Pemaju Web",
            "third": "Pemaju Permainan",
            "fourth": "Pencipta Kandungan"
        },
        "footer": "Laman web kini diterjemahkan & boleh didapati dalam 100+ bahasa!",
        "descriptionA": "Jurutera perisian penuh sentuhan penuh & pemaju web dengan sejarah yang ditunjukkan oleh projek pembangunan yang berjaya, daripada mewujudkan pengubahsuaian Java untuk Minecraft untuk meningkatkan pengalaman pengguna dalam React.js dan melaksanakan API REST selamat, sementara secara konsisten menggunakan metodologi tangkas dan kerjasama pasukan yang berkesan.",
        "descriptionB": "Di samping itu, saya adalah pencipta kandungan geografi yang telah berjaya memanfaatkan algoritma pelbagai platform media sosial, termasuk Instagram, YouTube, dan Tiktok, untuk mendapatkan pangkalan pengikut yang dihormati dan menarik.",
        "portfolio_button": "Portfolio saya",
        "contact_button": "Hubungi saya",
        "about_button": "Mengenai saya"
    },
    "about": {
        "title": "Mengenai saya",
        "personal_summary": {
            "title": "Ringkasan Peribadi",
            "text": "Sebagai pemaju perisian stack penuh berpengalaman yang berpusat di Orlando, FL, saya telah menunjukkan kepakaran dalam pelbagai teknologi, dari Java dan C ++ ke React.js dan Node.js. Dengan rekod jejak projek kepala, termasuk pembangunan program pengubahsuaian Java untuk Minecraft dan laman web yang memberi ganjaran untuk pemandu trak, saya telah mempamerkan kepimpinan dan inovasi. Komitmen saya terhadap kecemerlangan jelas dalam keupayaan saya untuk menyelaraskan pengurusan projek, menyelesaikan masalah yang rumit, dan memberikan penyelesaian berkualiti tinggi yang meningkatkan pengalaman pengguna dan memacu kejayaan organisasi."
        },
        "professional_experience": {
            "title": "Pengalaman profesional",
            "entries": [
                {
                    "jobtitle": "Jurutera Perisian Junior",
                    "where": "Orion180 Insurans",
                    "date": "2024 - hadir"
                },
                {
                    "jobtitle": "Pemaju Perisian Pengasas & Penuh Stack",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Jurutera Perisian Stack Penuh",
                    "where": "Mempercepatkan pembelajaran",
                    "date": "2023"
                },
                {
                    "jobtitle": "Pemaju Web Lead (Program Pelajar)",
                    "where": "Program GDI Universiti Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Penyelia meja",
                    "where": "Clemson University",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Penyelia meja",
                    "where": "Clemson University",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Kemahiran teknikal",
            "header1": "Bahasa pengaturcaraan",
            "header2": "Rangka Kerja & Perpustakaan",
            "header3": "Alat & Teknologi"
        },
        "services": {
            "title": "Perkhidmatan saya",
            "entries": [
                {
                    "title": "Kejuruteraan Stack Penuh",
                    "text": "Saya menawarkan penyelesaian yang komprehensif di kedua-dua pembangunan front-end dan back-end, memastikan integrasi dan fungsi yang lancar di seluruh stack perisian."
                },
                {
                    "title": "Pembangunan Web",
                    "text": "Dengan kepakaran dalam rangka kerja HTML, CSS, dan JavaScript seperti React.js, saya membuat laman web yang menarik dan mesra pengguna yang disesuaikan untuk memenuhi keperluan dan keutamaan khusus pelanggan."
                },
                {
                    "title": "Pembangunan permainan",
                    "text": "Memanfaatkan bahasa seperti Java dan C ++, saya pakar dalam mencipta pengalaman permainan yang mendalam, dari konsep dan reka bentuk untuk pelaksanaan dan pengoptimuman, memastikan permainan yang menarik dan prestasi yang lancar."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfolio",
        "filter_by": "Portfolio penapis oleh:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca Json",
                "text": "Projek Python yang menyelaraskan terjemahan bahasa. Membolehkan portfolio laman web saya diterjemahkan ke dalam 70+ bahasa, termasuk bahasa Sepanyol, Perancis, Cina, Arab, dan banyak lagi. Projek ini digunakan untuk membuat portfolio laman web berbilang bahasa, yang sangat berguna untuk mencapai khalayak yang lebih luas. Dengan projek ini, lebih daripada 99% dunia dapat membaca portfolio saya dalam bahasa yang fasih.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Sambungkan empat",
                "text": "Keluarga besar lebih daripada 50+ pelaksanaan permainan Connect Four. Projek ini termasuk pelaksanaan di lebih daripada 30 bahasa pengaturcaraan yang berbeza, termasuk Java, C ++, Python, JavaScript, dan banyak lagi. Di samping itu, ia juga termasuk lebih daripada 20+ rangka kerja yang berbeza atau format lain, termasuk React.js, Ruby on Rails, ASP.NET, dan banyak lagi.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "Aplikasi runcit",
                "text": "Stack lengkap .NET 9 aplikasi pelayan Blazor untuk menguruskan item runcit. Aplikasi ini mengikuti corak pengawal/perkhidmatan/repositori dengan teras kerangka entiti untuk kegigihan dan termasuk suite ujian yang komprehensif.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Projek Interop",
                "text": "Satu projek yang dokumen interoperabilitas antara bahasa pengaturcaraan yang berbeza. Pada masa ini termasuk 15 bahasa pengaturcaraan yang berbeza dan 18 corak pelaksanaan.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Daftar Inventori",
                "text": "Daftar Demo Titik Jualan (POS) penuh dengan sistem pengurusan inventori yang dibina dengan Angular 17+ dan Node.js. Aplikasi ini menunjukkan sistem POS gred profesional dengan pengesahan pengguna, kawalan akses berasaskan peranan, penjejakan inventori, dan pemprosesan pembayaran mengejek.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "Formatter Auto Json & Yaml",
                "text": "Linter & AutoforMatter untuk fail JSON & YAML. Projek ini digunakan untuk memformat fail JSON & YAML, yang sangat berguna untuk menyimpan kod bersih dan teratur. Dibina dengan GO, disusun dengan webassembly, dan tertanam ke dalam portfolio saya sebagai projek laman web. Lebih banyak format yang akan datang pada masa akan datang.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON Generator",
                "text": "Penjana JSON ringan yang dibina di Python untuk Minecraft Resource & Data Packs. Projek ini digunakan untuk menjana fail JSON untuk mod Minecraft, termasuk item tersuai, blok, dan entiti. Sangat berguna untuk bukan sahaja mencipta datapacks tersuai, tetapi untuk mod juga melalui ciri penukaran nama mod.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Pengalaman pendidikan saya",
                "text": "Di samping projek peribadi saya, saya juga telah memperoleh banyak kemahiran dari pengalaman pendidikan. Klik di sini untuk melihat profil LinkedIn saya untuk maklumat lanjut.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Pengalaman profesional saya",
                "text": "Di samping projek peribadi saya, saya juga telah memperoleh banyak kemahiran dari pengalaman profesional. Klik di sini untuk melihat profil LinkedIn saya untuk maklumat lanjut.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Laman web portfolio Patrick Goodwin",
                "text": "Laman web ini adalah laman web portfolio peribadi saya, dibina dengan React.js. Projek ini digunakan untuk mempamerkan kemahiran dan projek saya, serta menyediakan platform bagi majikan yang berpotensi untuk menghubungi saya. Projek ini digunakan untuk mewujudkan kehadiran dalam talian profesional.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Perpustakaan Skrip Lua Patrick",
                "text": "Perpustakaan Skrip LUA yang berguna untuk rujukan masa depan. Perpustakaan ini digunakan untuk mengautomasikan tugas-tugas dalam skrip Lua, yang boleh menjadi berguna untuk tugas-tugas yang diperlukan, kerana Lua biasanya bahasa skrip yang lebih cepat daripada Python dan Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Skrip Spreadsheet Microsoft Excel Patrick (VBA)",
                "text": "Perpustakaan berguna skrip VBA untuk Microsoft Excel. Perpustakaan ini digunakan untuk mengautomasikan tugas dalam spreadsheet Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Konfigurasi Neovim Patrick",
                "text": "Konfigurasi Neovim peribadi saya. Projek ini digunakan untuk mengkonfigurasi Neovim mengikut keinginan saya, termasuk keybinding, tema, dan plugin tersuai. Projek ini digunakan untuk menjadikan Neovim lebih mesra pengguna dan cekap untuk kegunaan peribadi saya.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Penjana Peta Patrick",
                "text": "Penjana peta County & State Amerika Syarikat, yang dibina dengan Python menggunakan perpustakaan geopandas dan matplotlib. Projek ini digunakan untuk menjana peta Amerika Syarikat, termasuk peta daerah dan negeri. Projek ini digunakan untuk membuat peta tersuai untuk visualisasi dan analisis data.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Perpustakaan Skrip PowerShell Patrick",
                "text": "Perpustakaan Skrip PowerShell yang berguna untuk rujukan masa depan. Berguna dengan ciri skrip profil $, saya dapati ini sangat berguna untuk mengautomasikan tugas dari terminal Windows, kerana saya adalah pengguna yang kerap dari OS Windows.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Perpustakaan Skrip Ruby Patrick",
                "text": "Perpustakaan Skrip Ruby yang berguna untuk rujukan masa depan. Berguna untuk masa depan Ruby on Rails Concepts.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "Pembina Kemahiran PDF",
                "text": "Pembina PDF tersuai yang dibina dengan Python melalui sambungan PDFKIT dan JINJA2, bersama format HTML dan JSON. Projek ini digunakan untuk menjana fail PDF dari senarai kemahiran dan projek. Projek ini boleh digunakan untuk membuat resume PDF tersuai, yang sangat berguna untuk aplikasi kerja.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Projek Penyulitan Rijandel",
                "text": "Keluarga 10+ pelaksanaan algoritma penyulitan Rijandel pada 128, 192, dan 256 bit. Projek ini digunakan untuk menunjukkan algoritma penyulitan Rijandel dalam bahasa pengaturcaraan yang berbeza. Projek ini digunakan untuk mewujudkan keluarga pelaksanaan algoritma penyulitan Rijandel.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Supremc Minecraft Mod",
                "text": "Mod Minecraft yang menambah alat, perisai, perusuh, blok, dimensi, dan banyak lagi ciri untuk permainan. Dibina dengan versi Java 8-17 untuk memilih versi Minecraft antara 1.16 dan 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Bahasa pengaturcaraan harimau",
                "text": "Bahasa pengaturcaraan tersuai yang dibina di kedua -dua Go & Rust untuk bereksperimen dengan reka bentuk dan prestasi jurubahasa. Dilaksanakan di laman web portfolio menggunakan pemasangan web.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Laman web Tiger Tailgating Pro",
                "text": "Sebuah laman web yang saya bina pada tahun 2024 untuk Tiger Tailgating Pro, sebuah syarikat tailgating di Clemson, SC. Dibina dengan React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Projek Mesin Turing",
                "text": "Keluarga lebih daripada 30+ pelaksanaan mesin Turing. Digunakan untuk menunjukkan kesempurnaan Turing untuk bahasa pengaturcaraan yang berbeza untuk penyelidikan, terutama untuk bahasa pengaturcaraan Tiger.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Bahasa pengaturcaraan harimau"
    },
    "contact": {
        "title": "Hubungi saya",
        "header": "Maklumat hubungan",
        "email": "pattygsocials@gmail.com",
        "description": "Saya menjawab pertanyaan dari e -mel, mesej LinkedIn, dan mesej Instagram. Saya juga akan memanggil semula jika nombor saya disediakan melalui resume atau sebaliknya, walaupun saya lebih suka menyimpan nombor telefon saya secara peribadi."
    },
    "formatter": {
        "title": "Formatter Json & Yaml",
        "description": "Formatter JSON & YAML adalah alat yang membolehkan anda memformat fail JSON dan YAML. Ia dibina dengan Go dan WebAssembly, dan ia direka untuk menjadi cepat dan cekap. Formatter direka untuk menjadi mudah digunakan, dengan antara muka yang mudah yang membolehkan anda menampal dalam kod JSON atau YAML anda dan formatnya dengan klik butang.",
        "more_info1": "Untuk maklumat lanjut, rujuk readme di",
        "more_info2": "JSON/YAML Formatter Repository.",
        "format_as": "Format sebagai:",
        "auto_detect": "Mengesan automatik",
        "format": "Format"
    },
    "cube_solver": {
        "title": "Rubix Cube Solver",
        "start": "Menyelesaikan"
    },
    "tiger": {
        "title": "Bahasa harimau",
        "description": "Bahasa pengaturcaraan harimau adalah bahasa pengaturcaraan tersuai yang dibina di kedua -dua Go & Rust untuk bereksperimen dengan reka bentuk dan prestasi jurubahasa. Dilaksanakan di laman web portfolio menggunakan pemasangan web. Bahasa pengaturcaraan harimau adalah bahasa pengaturcaraan tersuai yang dibina di kedua -dua Go & Rust untuk bereksperimen dengan reka bentuk dan prestasi jurubahasa. Dilaksanakan di laman web portfolio menggunakan pemasangan web.",
        "more_info1": "Untuk maklumat lanjut, rujuk readme di",
        "more_info2": "Bahasa pengaturcaraan Tiger Repositori GitHub.",
        "select_engine": "Pilih Enjin:",
        "tiger_code": "Kod Harimau:",
        "run_tiger": "Jalankan Harimau",
        "output": "Output:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Jurutera Perisian Stack Penuh yang berpusat di Florida Tengah"
    },
    "copy": {
        "text": "Salin",
        "copied": "Disalin!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Ikuti saya"
    },
    "languages": {
        "title": "Penerjemah Portfolio",
        "description": "Ketahui bagaimana portfolio saya dapat diakses oleh pelawat dari seluruh dunia dengan sokongan untuk lebih dari 100 bahasa.",
        "global_accessibility": {
            "title": "Kebolehcapaian Global",
            "description": "Portfolio saya boleh didapati dalam bahasa {Count}, menjadikannya mudah diakses oleh pelawat dari seluruh dunia. Pendekatan berbilang bahasa ini menunjukkan komitmen saya terhadap keterangkuman dan jangkauan global dalam pembangunan perisian.",
            "stats": {
                "languages_supported": "Bahasa disokong",
                "countries_represented": "Negara diwakili",
                "continents_covered": "Benua dilindungi"
            }
        },
        "features": {
            "title": "Ciri -ciri",
            "items": [
                {
                    "title": "Terjemahan masa nyata:",
                    "description": "Tukar bahasa dengan serta -merta dengan pemilih bahasa"
                },
                {
                    "title": "Bahasa berasaskan URL:",
                    "description": "Keutamaan bahasa dipelihara dalam URL"
                },
                {
                    "title": "Sokongan skrip asli:",
                    "description": "Penampilan skrip yang betul seperti Arab, Cina, Hindi, dan banyak lagi"
                },
                {
                    "title": "Kepekaan budaya:",
                    "description": "Terjemahan Pertimbangkan Konteks Budaya, Bukan Hanya Maksud Literal"
                },
                {
                    "title": "SEO Dioptimumkan:",
                    "description": "Setiap varian bahasa dioptimumkan untuk enjin carian"
                }
            ]
        },
        "world_map": {
            "title": "Peta Dunia Interaktif",
            "description": "Bergerak ke atas negara di peta untuk melihat bahasa yang disokong mereka:",
            "languages_label": "Bahasa",
            "legend": {
                "supported": "Bahasa disokong",
                "not_supported": "Tiada sokongan bahasa"
            },
            "zoom_controls": {
                "zoom_in": "Zum masuk",
                "zoom_out": "Zum keluar",
                "reset": "Reset View"
            }
        },
        "supported_languages": {
            "title": "Bahasa yang disokong"
        },
        "interactive_country_map": {
            "title": "Peta negara interaktif",
            "description": "Bergegas di negara -negara di bawah untuk melihat bahasa yang disokong mereka:",
            "language_count": {
                "single": "bahasa",
                "multiple": "bahasa"
            }
        },
        "tooltips": {
            "no_language_support": "Tiada sokongan bahasa"
        }
    },
    "logotext": "Patrick"
}