{
    "name": "ပက်ထရစ် Goodwin",
    "menu": {
        "home": "နေအိမ်",
        "about": "ကိုယ့်အကြောင်း",
        "portfolio": "အစုစု",
        "projects": "ဝဘ်ဆိုက်စီမံကိန်းများ",
        "tiger": "ကျားဘာသာစကား",
        "formatter": "JSON & YAML formatter",
        "cube_solver": "Rubix Cube Solver",
        "contact": "ငါ့ကိုဆက်သွယ်ပါ"
    },
    "home": {
        "title": "နေအိမ်",
        "animated": {
            "first": "အပြည့်အဝ stack ဆော့ဝဲလ်အင်ဂျင်နီယာ",
            "second": "Web developer",
            "third": "ဂိမ်း developer",
            "fourth": "အကြောင်းအရာဖန်တီးသူ"
        },
        "footer": "0 ဘ်ဆိုဒ်ယခုဘာသာစကား 100 ကျော်ဖြင့်ဘာသာပြန်ထားသော & ရရှိနိုင်!",
        "descriptionA": "java ကိုအောင်မြင်စွာ ဦး ဆောင်သည့်ဖွံ့ဖြိုးရေးစီမံကိန်းများကိုတီထွင်ခြင်းဖြင့်အောင်မြင်သောဖွံ့ဖြိုးရေးစီမံကိန်းများကိုတီထွင်နိုင်သည့် Java Developments ကိုတီထွင်ခြင်းဖြင့်အောင်မြင်သောဖွံ့ဖြိုးရေးစီမံကိန်းများကိုသရုပ်ပြခြင်းနှင့်လုံခြုံစိတ်ချရသောအနားယူခြင်း APIs ကိုအကောင်အထည်ဖော်နေစဉ်အတွင်းအတွေ့အကြုံရှိသောဖွံ့ဖြိုးရေးစီမံကိန်းများကိုပြုလုပ်ခဲ့သည်။",
        "descriptionB": "ထို့အပြင်ကျွန်ုပ်သည်ပထဝီဝင်, YouTube နှင့် Tiktok အပါအ 0 င်လူမှုမီဒီယာပလက်ဖောင်းများအပါအ 0 င်လူမှုမီဒီယာပလက်ဖောင်းများအပါအ 0 င်လူမှုမီဒီယာပလက်ဖောင်းများအပါအ 0 င်လူမှုမီဒီယာပလက်ဖောင်းများအပါအ 0 င် Social Media Platures ၏ algorithms ကိုအောင်မြင်စွာဖြည့်ဆည်းပေးနိုင်သည့်ပထဝီဝင်အကြောင်းအရာကိုဖန်တီးသူဖန်တီးသူဖြစ်သည်။",
        "portfolio_button": "ငါ့အစုစု",
        "contact_button": "ငါ့ကိုဆက်သွယ်ပါ",
        "about_button": "ကိုယ့်အကြောင်း"
    },
    "about": {
        "title": "ကိုယ့်အကြောင်း",
        "personal_summary": {
            "title": "ပုဂ္ဂိုလ်ရေးအကျဉ်းချုပ်",
            "text": "orlando တွင်အခြေစိုက်သည့်အတွေ့အကြုံရှိသော star stack software developer သည် Java နှင့် C ++ မှကျွမ်းကျင်မှုအမျိုးမျိုးတွင်ကျွမ်းကျင်မှုကိုပြသခဲ့သည်။ MINECRAFT အတွက် Java Modificate နှင့် Truck Drivers များအတွက် Java Modificate program များဖွံ့ဖြိုးတိုးတက်ရေးအပါအ 0 င်အလွယ်တကူပြုပြင်မွမ်းမံခြင်းအစီအစဉ်များနှင့်အတူခေါင်းဆောင်မှုနှင့်ဆန်းသစ်တီထွင်မှုများကိုပြသခဲ့သည်။ My Excellence ကိုကျွန်ုပ်၏ကတိကဝတ်သည်စီမံကိန်းစီမံခန့်ခွဲမှုများကိုဖြေရှင်းနိုင်ခြင်း,"
        },
        "professional_experience": {
            "title": "ပရော်ဖက်ရှင်နယ်အတွေ့အကြုံ",
            "entries": [
                {
                    "jobtitle": "အငယ်တန်းဆော့ဖ်ဝဲအင်ဂျင်နီယာ",
                    "where": "orion180 အာမခံ",
                    "date": "2024 - ပစ္စုပ္ပန်"
                },
                {
                    "jobtitle": "တည်ထောင်သူ & အပြည့်အဝ stack software ကို developer",
                    "where": "မြဲကေြနပ်အပ်",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "အပြည့်အဝ stack ဆော့ဝဲလ်အင်ဂျင်နီယာ",
                    "where": "သင်ယူမှုအရှိန်မြှင့်",
                    "date": "2023"
                },
                {
                    "jobtitle": "ဦး ဆောင်သော web developer (ကျောင်းသားအစီအစဉ်)",
                    "where": "Clemson တက္ကသိုလ် GDI အစီအစဉ်",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "စားပွဲကြီးကြပ်ရေးမှူး",
                    "where": "Clemson တက္ကသိုလ်",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "နည်းပညာကျွမ်းကျင်မှု",
            "header1": "ပရိုဂရမ်ဘာသာစကားများ",
            "header2": "မူဘောင်များနှင့်စာကြည့်တိုက်များ",
            "header3": "Tools များနှင့်နည်းပညာများ"
        },
        "services": {
            "title": "ငါ့ဝန်ဆောင်မှုများ",
            "entries": [
                {
                    "title": "အပြည့်အဝ stack အင်ဂျင်နီယာ",
                    "text": "ကျွန်ုပ်သည်ရှေ့တန်းနှင့်နောက်ပိုင်းအဆုံးဖွံ့ဖြိုးတိုးတက်မှုနှစ်ခုစလုံးတွင်ပြည့်စုံသောဖြေရှင်းနည်းများကိုဆော့ (ဖ်) ဝဲအထပ်တစ်လျှောက်တွင်ပေါင်းစပ်မှုနှင့်လုပ်ဆောင်နိုင်မှုကိုသေချာစေသည်။"
                },
                {
                    "title": "ဝဘ်ဖွံ့ဖြိုးတိုးတက်မှု",
                    "text": "တုန့်ပြန်မှုကဲ့သို့သော HTML, CSS နှင့် JavaScript frameworks တွင်ကျွမ်းကျင်မှုနှင့်အတူကျွန်ုပ်သည်အမြင်အာရုံအတွက်နှစ်သက်ဖွယ်ကောင်းသောအသုံးပြုသူများအတွက်လွယ်ကူသောဝက်ဘ်ဆိုက်များကိုကြည့်ရှုခြင်းနှင့်ဖောက်သည်များ၏သတ်သတ်မှတ်မှတ်လိုအပ်ချက်များနှင့် ဦး စားပေးမှုများနှင့်ပြည့်စုံစွာပြုလုပ်နိုင်သည်။"
                },
                {
                    "title": "ဂိမ်းဖွံ့ဖြိုးတိုးတက်မှု",
                    "text": "Java နှင့် C ++ ကဲ့သို့သောဘာသာစကားများကိုမြှင့်တင်ခြင်း, အယူအဆနှင့်ဒီဇိုင်းမှအကောင်အထည်ဖော်ခြင်းနှင့်အကောင်းမြင်ခြင်းတို့မှ conception နှင့် optimization မှ 0 ယ်ခြင်း,"
                }
            ]
        }
    },
    "portfolio": {
        "title": "အစုစု",
        "filter_by": "PACUFFOLIO အားဖြင့် filter",
        "entries": {
            "biblioteca": {
                "title": "biabioteca JSONS",
                "text": "ဘာသာစကားဘာသာပြန်ခြင်းများကိုပြုလုပ်သော Python Project ။ ကျွန်ုပ်၏ 0 ဘ်ဆိုဒ်အစုစုကိုစပိန်, ပြင်သစ်, တရုတ်, အာရဗီနှင့်အခြားသူများအပါအ 0 င်ဘာသာစကားပေါင်း 70 သို့ပြန်ဆိုရန်ခွင့်ပြုသည်။ ဤစီမံကိန်းကိုဘာသာစကားမျိုးစုံဝက်ဘ်ဆိုက်အစုစုကိုဖန်တီးရန်အသုံးပြုသည်။ ၎င်းသည်ကျယ်ကျယ်ပြန့်ပြန့်ပရိသတ်ကိုရောက်ရှိရန်အလွန်အသုံးဝင်သည်။ ဤစီမံကိန်းနှင့်အတူကမ္ဘာ့ 99% သည်ကျွန်ုပ်၏အစုစုကိုကျွမ်းကျင်စွာစကားကျွမ်းကျင်စွာဖတ်နိုင်သည်။",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "လေးချိတ်ဆက်ပါ",
                "text": "Connect Office ၏အကောင်အထည်ဖော်မှု 50 ကျော်၏အကြီးအကျယ်မိသားစု။ ဤစီမံကိန်းတွင် Java, C ++, Python, JavaScript နှင့်အခြားအရာများအပါအ 0 င်ကွဲပြားခြားနားသောပရိုဂရမ်ဘာသာစကားပေါင်း 30 ကျော်တွင်အကောင်အထည်ဖော်မှုပါ 0 င်သည်။ ထို့အပြင်၎င်းတွင်မူဘောင် (သို့) အခြားပုံစံ 20 ကျော်နှင့်အခြားပုံစံ 20 ကျော်နှင့်အခြားပုံစံများအပါအ 0 င်,",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Interop စီမံကိန်း",
                "text": "ကွဲပြားခြားနားသောပရိုဂရမ်းမင်းဘာသာစကားများအကြားအပြန်အလှန်အကျိုးသက်ရှိစာရွက်စာတမ်းများ။ လက်ရှိတွင်ပရိုဂရမ်ဘာသာစကား 15 ခုနှင့်ကွပ်မျက်ပုံစံ 18 ခုပါ 0 င်သည်။",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "JSON & YAML အော်တို",
                "text": "JSON & YAML ဖိုင်များအတွက် Linkorm & Autoformsters ။ ဤစီမံကိန်းကို JSON & YAML ဖိုင်များကို format လုပ်ရန်အသုံးပြုသည်။ ၎င်းသည်ကုဒ်ကိုသန့်ရှင်းစင်ကြယ်စွာထားရန်အလွန်အသုံးဝင်သည်။ WEBSEMSEMBLY ဖြင့်စုဆောင်းထားသည့် GO နှင့်အတူတည်ဆောက်ပြီး 0 ဘ်ဆိုဒ်စီမံကိန်းတစ်ခုအနေဖြင့်ကျွန်ုပ်၏အစုစုထဲသို့ထည့်သွင်းထားသည်။ အနာဂတ်အတွက်လာရန်ပိုမိုပုံစံများ။",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON Generator",
                "text": "ပေါ့ပါးသော JSONOTOR သည် Python တွင် MINECRAFT အရင်းအမြစ်နှင့် data packs များအတွက်တည်ဆောက်ခဲ့သည်။ ဤစီမံကိန်းကိုစိတ်ကြိုက်ပစ္စည်းများ, လုပ်ကွက်များနှင့်အဖွဲ့အစည်းများအပါအ 0 င် minecraft mods များအတွက် JSONS ဖိုင်များကိုထုတ်လုပ်ရန်အသုံးပြုသည်။ စိတ်ကြိုက် datapacks များကိုသာမကစိတ်ကြိုက် datapacks များကိုသာမက mod name switching feature မှတစ်ဆင့် MODS အတွက်လည်းအလွန်အသုံးဝင်သည်။",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "ငါ့ပညာရေးအတွေ့အကြုံ",
                "text": "ကျွန်ုပ်၏ကိုယ်ရေးကိုယ်တာစီမံကိန်းများနှင့်အတူကျွန်ုပ်သည်ပညာရေးအတွေ့အကြုံမှကျွမ်းကျင်မှုများစွာရရှိခဲ့သည်။ နောက်ထပ်သတင်းအချက်အလက်များအတွက်ကျွန်ုပ်၏ LinkedIn ပရိုဖိုင်းကိုကြည့်ရန်ဤနေရာကိုနှိပ်ပါ။",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "ငါ့ပရော်ဖက်ရှင်နယ်အတွေ့အကြုံ",
                "text": "ကျွန်ုပ်၏ကိုယ်ပိုင်စီမံကိန်းများနှင့်အတူကျွန်ုပ်သည်ပရော်ဖက်ရှင်နယ်အတွေ့အကြုံမှကျွမ်းကျင်မှုများစွာကိုဝယ်ယူခဲ့သည်။ နောက်ထပ်သတင်းအချက်အလက်များအတွက်ကျွန်ုပ်၏ LinkedIn ပရိုဖိုင်းကိုကြည့်ရန်ဤနေရာကိုနှိပ်ပါ။",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Goodwin Portfolio ဝက်ဘ်ဆိုက်",
                "text": "ဤ 0 က်ဘ်ဆိုက်သည်ကျွန်ုပ်၏ကိုယ်ရေးကိုယ်တာအစုစု 0 ဘ်ဆိုဒ်ဖြစ်သည်။ ဤစီမံကိန်းကိုကျွန်ုပ်၏ကျွမ်းကျင်မှုနှင့်စီမံကိန်းများကိုပြသရန်နှင့်ကျွန်ုပ်နှင့်ဆက်သွယ်ရန်အလားအလာရှိသောအလုပ်ရှင်များအတွက်ပလက်ဖောင်းတစ်ခုပေးရန်အသုံးပြုသည်။ ဤစီမံကိန်းကိုပရော်ဖက်ရှင်နယ်အွန်လိုင်းရှိနေခြင်းကိုဖန်တီးရန်အသုံးပြုသည်။",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "ပက်ထရစ်ရဲ့ Lua Script စာကြည့်တိုက်",
                "text": "အနာဂတ်ရည်ညွှန်းအတွက် LUA scripts ၏အသုံးဝင်သောစာကြည့်တိုက်။ ဒီစာကြည့်တိုက်ဟာ LuaSts မှာရှိတဲ့လုပ်ငန်းတွေအတွက်အလုပ်တွေကိုအလိုအလျောက်အလုပ်တွေကိုအလိုအလျောက်အလုပ်များလုပ်ပေးဖို့အသုံးပြုသည်။",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrick ၏ Microsoft Excelsheet scripts (VBA)",
                "text": "Microsoft Excel အတွက် VBA scripts ၏အသုံးဝင်သောစာကြည့်တိုက်။ ဤစာကြည့်တိုက်သည် Excel စာရင်းဇယားများတွင်အလုပ်များကိုအလိုအလျောက်ပြုလုပ်ရန်အသုံးပြုသည်။",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "ပက်ထရစ်ရဲ့ Neovim config",
                "text": "ငါ့ကိုယ်ပိုင်ကိုယ်ပိုင် Neovim Configuration ။ ဤစီမံကိန်းကို CommandBindings, themes များနှင့် plugins များအပါအ 0 င်တီဗွီကိုကျွန်ုပ်ကြိုက်နှစ်သက်သည့်အတွက်အသုံးပြုသည်။ ဤစီမံကိန်းကိုစာသားအသုံးပြုမှုအတွက်အသုံးပြုသူကိုပိုမိုအသုံးဝင်ပြီးထိရောက်စေရန်အသုံးပြုသည်။",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "ပက်ထရစ်ရဲ့မြေပုံ",
                "text": "အမေရိကန်ပြည်ထောင်စုခရိုင်နှင့်ပြည်နယ်မြေပုံမီးစက်သည် Python နှင့်အတူ Python နှင့်အတူတည်ဆောက်ခဲ့သည် Geopandas နှင့် MatplotLib စာကြည့်တိုက်များအသုံးပြုသည်။ ဤစီမံကိန်းကိုခရိုင်နှင့်ပြည်နယ်မြေပုံများအပါအ 0 င်အမေရိကန်ပြည်ထောင်စုမြေပုံများကိုထုတ်လုပ်ရန်အသုံးပြုသည်။ ဤစီမံကိန်းသည်ဒေတာမြင်ကွင်းနှင့်ခွဲခြမ်းစိတ်ဖြာခြင်းအတွက်ထုံးစံမြေပုံများကိုဖန်တီးရန်အသုံးပြုသည်။",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patrick ရဲ့ PowerShell Script စာကြည့်တိုက်",
                "text": "အနာဂတ်ရည်ညွှန်းမှုအတွက် PowerShell scripts ၏အသုံးဝင်သော PowerShell Scripts ။ $ Profile Script အင်္ဂါရပ်နှင့်အတူအသုံးဝင်သည်။ ကျွန်ုပ်သည် Windows OS မကြာခဏအသုံးပြုသူအဖြစ် Windows Terminal မှအလိုအလျောက်လုပ်ငန်းများကိုအလိုအလျောက်လုပ်ဆောင်မှုများအတွက်အလွန်အသုံးဝင်ပါသည်။",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patrick ရဲ့ပတ္တမြား Script စာကြည့်တိုက်",
                "text": "အနာဂတ်ရည်ညွှန်းအတွက်ပတ္တမြား scripts ၏အသုံးဝင်သောစာကြည့်တိုက်။ Trails ဖွံ့ဖြိုးမှုဆိုင်ရာအယူအဆများအတွက်အနာဂတ်ပတ္တမြားများအတွက်အသုံးဝင်သော။",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF SPASSITY BURDER",
                "text": "PDFKIT နှင့် JINJA2 extensions မှတဆင့် python နှင့်အတူ PDF တည်ဆောက်သူသည် HTML နှင့် JSON Formating နှင့်အတူတည်ဆောက်ခဲ့သည်။ ဤစီမံကိန်းကိုကျွမ်းကျင်မှုနှင့်စီမံကိန်းများစာရင်းမှ PDF ဖိုင်များကိုထုတ်လုပ်ရန်အသုံးပြုသည်။ ဤစီမံကိန်းကိုစိတ်ကြိုက် PDF ကိုယ်ရေးကိုယ်တာကိုယ်ရေးရာဇဝင်ကိုဖန်တီးရန်အသုံးပြုနိုင်သည်။ ၎င်းသည်အလုပ် application များအတွက်အလွန်အသုံးဝင်သည်။",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandel encryption project",
                "text": "128, 192 ခုနှစ်, 192, 192, 192 ခုနှစ်, ဒီစီမံကိန်းကိုပရိုဂရုရေမတူတဲ့ဘာသာစကားတွေမှာရီစာဝှက်စနစ် algorithm ကိုသရုပ်ပြဖို့အသုံးပြုသည်။ ဤစီမံကိန်းကို Rijandel encryption algorithm ၏မိသားစုကိုအကောင်အထည်ဖော်ရန်မိသားစုကိုဖန်တီးရန်အသုံးပြုသည်။",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Supremmc MINECRAFT MOD",
                "text": "Customools, သံချပ်ကာများ, လူအုပ်, 1.16 နှင့် 1.20 အကြား minecraft ဗားရှင်းများအတွက် Java ဗားရှင်း 8-17 နှင့်အတူတည်ဆောက်ခဲ့သည်။",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tiger Programming ဘာသာစကား",
                "text": "စကားပြန်ဒီဇိုင်းနှင့်စွမ်းဆောင်ရည်နှင့်အတူစမ်းသပ်ရန်နှစ် ဦး စလုံး Go & Russ နှစ်ခုလုံးအတွက်တည်ဆောက်ခဲ့တဲ့စိတ်ကြိုက်ပရိုဂရမ်းမင်းဘာသာစကား။ Web Clublish ကိုအသုံးပြုပြီးအစုစု 0 ဘ်ဆိုဒ်တွင်အကောင်အထည်ဖော်သည်။",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Terging Tailgating Pros ဝက်ဘ်ဆိုက်",
                "text": "2024 တွင် Terging Tailgating Pros အတွက် Terging Tailgating Pros အတွက် Terginggating Pros တွင် Tailgating ကုမ္ပဏီ, SC ။ React.js နှင့်အတူတည်ဆောက်ခဲ့သည်။",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing စက်စီမံကိန်း",
                "text": "Turing Machine ၏အကောင်အထည်ဖော်မှု 30 ကျော်၏မိသားစု။ အထူးသဖြင့်ကျားပရိုဂည့်ဘာသာစကားအတွက်သုတေသနအတွက်မတူညီသောပရိုဂရမ်းမင်းဘာသာစကားများအတွက်မတူညီသောပရိုဂရမ်းမင်းဘာသာစကားများအတွက် turing ကိုသုတေသနပြုရန်အသုံးပြုခဲ့သည်။",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tiger Programming ဘာသာစကား"
    },
    "contact": {
        "title": "ငါ့ကိုဆက်သွယ်ပါ",
        "header": "ဆက်သွယ်ရန်အချက်အလက်များ",
        "email": "pattygsocials@gmail.com",
        "description": "ငါအီးမေးလ်, LinkedIn မက်ဆေ့ခ်ျများနှင့် Instagram မက်ဆေ့ခ်ျများမှမေးမြန်းစုံစမ်းလိုသည်။ ကျွန်ုပ်၏ဖုန်းနံပါတ်ကိုကိုယ်ရေးရာဇဝင်မှတစ်ဆင့်ပြန်လည်စတင်ရန်သို့မဟုတ်မဟုတ်ရင်ကျွန်ုပ်ဖုန်းနံပါတ်ကိုလျှို့ဝှက်ထားလိုသော်လည်းကျွန်ုပ်ပြန်ခေါ်လိမ့်မည်။"
    },
    "formatter": {
        "title": "JSON & YAML formatter",
        "description": "JSON & YAML FACOMAT ဆိုသည်မှာ JSON နှင့် YAML ဖိုင်များကို format လုပ်ရန်သင့်အားခွင့်ပြုသည့်ကိရိယာတစ်ခုဖြစ်သည်။ ၎င်းကို Go နှင့် Webassement ဖြင့်တည်ဆောက်ထားပြီး၎င်းသည်မြန်ဆန်ထိရောက်စေရန်ဒီဇိုင်းပြုလုပ်ထားသည်။ ပုံစံအမျိုးမျိုးတွင်အသုံးပြုရန်လွယ်ကူသည်, သင်၏ JSON သို့မဟုတ် YAML Code တွင် paste လုပ်ပြီး၎င်းကိုခလုတ်တစ်ခု၏ကလစ် နှိပ်. ၎င်းကို paste လုပ်ထားသည့်ရိုးရှင်းသော interface တစ်ခုရှိသည်။",
        "more_info1": "ပိုမိုသိရှိလိုပါကအတွက် Readme ကိုဖတ်ပါ",
        "more_info2": "JSO / YAML ပုံစံများကိုသိုလှောင်ရုံ။",
        "format_as": "ပုံစံ",
        "auto_detect": "အော်တို detect",
        "format": "ပမာဏ"
    },
    "cube_solver": {
        "title": "Rubix Cube Solver",
        "solve": "ဖေြရှင်း"
    },
    "tiger": {
        "title": "ကျားဘာသာစကား",
        "description": "Tiger Programming Language သည်စကားပြန်ဒီဇိုင်းနှင့်စွမ်းဆောင်ရည်ကိုစမ်းသပ်ရန် Go & Rust နှစ်ခုလုံးတွင်တည်ဆောက်ထားသောစိတ်ကြိုက်ပရိုဂရမ်းမင်းဘာသာစကားဖြစ်သည်။ Web Clublish ကိုအသုံးပြုပြီးအစုစု 0 ဘ်ဆိုဒ်တွင်အကောင်အထည်ဖော်သည်။ Tiger Programming Language သည်စကားပြန်ဒီဇိုင်းနှင့်စွမ်းဆောင်ရည်ကိုစမ်းသပ်ရန် Go & Rust နှစ်ခုလုံးတွင်တည်ဆောက်ထားသောစိတ်ကြိုက်ပရိုဂရမ်းမင်းဘာသာစကားဖြစ်သည်။ Web Clublish ကိုအသုံးပြုပြီးအစုစု 0 ဘ်ဆိုဒ်တွင်အကောင်အထည်ဖော်သည်။",
        "more_info1": "ပိုမိုသိရှိလိုပါကအတွက် Readme ကိုဖတ်ပါ",
        "more_info2": "Tiger Programming Language GitHub repository ကို။",
        "select_engine": "အင်ဂျင်ကိုရွေးချယ်ပါ။",
        "tiger_code": "Tiger Code:",
        "run_tiger": "ကျားပြေး",
        "output": "ထုတ်လုပ်မှု -"
    },
    "tab": {
        "title": "ပက်ထရစ် Goodwin",
        "description": "Florida အလယ်ပိုင်းတွင်အခြေစိုက်သော stack software ကိုအင်ဂျင်နီယာအပြည့်အစုံ"
    },
    "copy": {
        "text": "ကူးရေး",
        "copied": "ကူးယူ!"
    },
    "social_media": {
        "github": "ရွှင်လန်းသော",
        "instagram": "Instagram",
        "linkedin": "intalked",
        "tiktok": "အချစ်",
        "youtube": "youtube",
        "text_strip": "ကိုယ့်နောက်လိုက်ခဲ့ပါ"
    },
    "logotext": "ပက်ထရ"
}