{
    "name": "प्याट्रिटल्टिन",
    "menu": {
        "home": "घर",
        "about": "मेरो बारेमा",
        "portfolio": "पोर्टफोलियो",
        "tiger": "टाइगर भाषा",
        "contact": "मलाई सम्पर्क गर्नुस्"
    },
    "home": {
        "title": "घर",
        "animated": {
            "first": "पूर्ण स्ट्याक सफ्टवेयर इन्जिनियर",
            "second": "वेब विकासकर्ता",
            "third": "खेल विकासकर्ता",
            "fourth": "सामग्री सृष्टिकर्ता"
        },
        "descriptionA": "सफलतापूर्वक नेतृत्व गर्ने विकास परियोजनाहरूको सफलतापूर्वक प्रयोगकर्ता अनुभव बृद्धि गर्न मिश्रित र सुरक्षित आराम गर्ने ईतिहासको प्रदर्शनको लागि पूर्ण-स्ट्याक सफ्टवेयर ईन्जिनियर र वेब विकासकर्ता अनुभवी स्रोतहरू सिर्जना गर्नबाट प्रभावकारी टोलीको सहयोग।",
        "descriptionB": "थप रूपमा, म एक भूगोल सामग्री सिर्जनाकर्ता हुँ जसले इन्स्टाग्राम, यूट्यूब, र टिक्टोक, आदरणीय प्राप्त गर्न, प्रमोटबन्दी प्राप्त गर्न र अनुगमन समन्वय प्राप्त गर्न धेरै सामाजिक मिडिया प्लेटफर्महरूको एल्गोरिदमहरू प्रदान गरेको छ।",
        "portfolio_button": "मेरो पोर्टफोलियो",
        "contact_button": "मलाई सम्पर्क गर्नुस्",
        "about_button": "मेरो बारेमा"
    },
    "about": {
        "title": "मेरो बारेमा",
        "personal_summary": {
            "title": "व्यक्तिगत सारांश",
            "text": "एक अनुभवी पूर्ण स्ट्याक सफ्टवेयर विकासकर्ताको रूपमा ओर्लान्डोमा आधारित, मैले विभिन्न प्रविधिहरूमा विशेषज्ञता देखाएको छु, जाभा र सी ++ प्रतिक्रिया र नोड .Js मा Jaaa संशोधन कार्यक्रमको एक ट्र्याक रेकर्ड सहितको MEQUITATIATIATIATIATION प्रोग्राम को विकास सहित Mava संशोधन कार्यक्रमको विकास सहितको ट्रक चालकहरूको लागि, मैले नेतृत्व र नवीनता प्रदर्शन गरेको छु। प्रोजेक्ट प्रबन्धनलाई प्रवाह गर्ने मेरो क्षमतामा मेरो प्रतिबद्धता प्रस्ट हुन्छ, जटिल समस्याहरू समाधान गर्नुहोस्, र उच्च-गुणवत्ता समाधानहरू डेलिभर गर्नुहोस् र ड्राइभ संगठनात्मक सफलता।"
        },
        "professional_experience": {
            "title": "पेशागत अनुभव",
            "entries": [
                {
                    "jobtitle": "जुनियर सफ्टवेयर ईन्जिनियर",
                    "where": "Orion180 बीमा",
                    "date": "2024 - उपस्थित"
                },
                {
                    "jobtitle": "संस्थापक र पूर्ण स्ट्याक सफ्टवेयर विकासकर्ता",
                    "where": "सर्वोच्चता",
                    "date": "20222 - 20244"
                },
                {
                    "jobtitle": "पूर्ण स्ट्याक सफ्टवेयर इन्जिनियर",
                    "where": "चालच गति",
                    "date": "20223"
                },
                {
                    "jobtitle": "नेतृत्व वेब विकासकर्ता (विद्यार्थी प्रोग्राम)",
                    "where": "क्लेमसन विश्वविद्यालय GDI कार्यक्रम",
                    "date": "2021 - 20222"
                },
                {
                    "jobtitle": "डेस्क सुपरवाइजर",
                    "where": "क्लेम्स विश्वविद्यालय",
                    "date": "2021 - 20222"
                }
            ]
        },
        "technical_skills": {
            "title": "प्राविधिक सीप",
            "header1": "प्रोग्रामिंग भाषाहरू",
            "header2": "फ्रेमवर्क र पुस्तकालयहरू",
            "header3": "उपकरण र टेक्नोलोजीहरू"
        },
        "services": {
            "title": "मेरो सेवाहरू",
            "entries": [
                {
                    "title": "पूर्ण स्ट्याक ईन्जिनियरि।",
                    "text": "म दुबै अगाडी-अन्त र ब्याक-अन्त विकासमा विस्तृत समाधानहरू प्रस्ताव गर्दछु, सम्पूर्ण सफ्टवेयर स्ट्याक भर विवेकहीन एकीकरण र कार्यक्षमता सुनिश्चित गर्दछ।"
                },
                {
                    "title": "वेब विकास",
                    "text": "HTML, CSSL, CSS, र जाभास्क्रिप्ट फ्रेक्रिप्ट फ्रेंस्क्रिप्टल जस्ता विशेषज्ञता। Jss, म दृष्टिविहीन अपील गर्दैछु र प्रयोगकर्ताहरूको विशिष्ट आवश्यकताहरू र प्राथमिकताहरू भेट्छु।"
                },
                {
                    "title": "खेल विकास",
                    "text": "जाभा र c ++ जस्ता भाषाहरू अवधारणा र अप्टिमाइजेसनको लागि, गेमप्ले र सहज प्रदर्शन सुनिश्चित गर्न अचाक्ली गेमिंग अनुभवहरू सिर्जना गर्ने क्रममा म विशेषता र अनुकूलता पाउने छु।"
                }
            ]
        }
    },
    "portfolio": {
        "title": "पोर्टफोलियो",
        "filter_by": "फिल्टर पोर्टफोलियो द्वारा::",
        "entries": {
            "connect_four": {
                "title": "चार जडान गर्नुहोस्",
                "text": "जडानको 50000+ भन्दा बढि कार्यान्वयनहरूको विशाल परिवार। यस परियोजनाले जाभा, c ++, पाइथन, जाभास्क्रिप्ट र अधिक सहित 300 भन्दा बढी विभिन्न प्रोग्रामिंग भाषाहरूमा कार्यान्वयन समावेश गर्दछ। थप रूपमा, यसले 20+ बिभिन्न फ्रेमवर्क वा अन्य ढाँचाहरू समावेश गर्दछ .js, रेलमा, रेलमा, ASP.net, र अधिकमा रूबी पनि समावेश गर्दछ।",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "इन्टरपोप प्रोजेक्ट",
                "text": "एक प्रोजेक्ट जुन विभिन्न प्रोग्रामिंग भाषाहरू बीचको प्रसारणको अन्तर्क्रिया गर्दछ। हाल 1 percents फरक प्रोग्रामिंग भाषाहरू र 1 present कार्यान्वयन ढाँचाहरू समावेश छन्।",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "excel_scripts": {
                "title": "माइक्रोसफ्ट एक्सेल स्प्रेडशिट स्क्रिप्टहरू (vBE)",
                "text": "माइक्रोसफ्ट एक्सेलको लागि VBA स्क्रिप्टको एक उपयोगी पुस्तकालय। यो पुस्तकालय एक्सेल स्प्रेडशिटमा कार्यहरू स्वचालित गर्न प्रयोग गरिन्छ।",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "minecraft_json_generator": {
                "title": "Minecraft json जेनरेटर",
                "text": "हल्का वजनसन जोन जेनसन प्लास्टरमा METHON स्रोत र डाटा प्याकहरूको लागि निर्मित। यो परियोजनाले joncraft मोडहरूको लागि json फाईल उत्पादन गर्न प्रयोग गरीन्छ, कस्टम आईटमहरू, ब्लकहरू र संस्थाहरू सहित। अनुकूलन डाटापक्सहरू मात्र सिर्जना गर्न को लागी धेरै उपयोगी, तर मोडको लागि पनि मोडको नाम स्विच सुविधा मार्फत।",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "मेरो शैक्षिक अनुभव",
                "text": "मेरा व्यक्तिगत परियोजनाहरूको साथमा, मैले शैक्षिक अनुभवबाट धेरै सीपहरू प्राप्त गरेको छु। अधिक जानकारीको लागि मेरो लिंडर्डिन प्रोफाइल हेर्न यहाँ क्लिक गर्नुहोस्।",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "मेरो व्यावसायिक अनुभव",
                "text": "मेरा व्यक्तिगत परियोजनाहरूको साथमा मैले व्यावसायिक अनुभवबाट धेरै सीपहरू प्राप्त गरेको छु। अधिक जानकारीको लागि मेरो लिंडर्डिन प्रोफाइल हेर्न यहाँ क्लिक गर्नुहोस्।",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "प्याट्रिक सॉलिन पोर्टफोलियो वेबसाइट",
                "text": "यो वेबसाइट मेरो व्यक्तिगत पोर्टफोलियो वेबसाइट हो, प्रतिक्रिया संग निर्माण .js। यो परियोजना मेरो कौशलता र परियोजनाहरू प्रदर्शन गर्न पनि प्रयोग गरीन्छ, साथै सम्भावित रोजगारदाताहरूको लागि मस्यौदा तयार गर्न। यो परियोजना एक पेशेवर अनलाइन उपस्थिति सिर्जना गर्न प्रयोग गरीन्छ।",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "प्याट्रिकको लुप्रमा स्क्रिप्ट लाइब्रेरी",
                "text": "भविष्य सन्दर्भ को लागी एक उपयोगी पुस्तकालय। यस पुस्तकालय लुई स्क्रिप्टमा कार्यहरू स्वचालित गर्न प्रयोग गरिन्छ, जुन प्रदर्शन-अभियोद्य कार्यहरूका लागि उपयोगी हुन सक्छ, किनकि लुई सामान्यतया द्रुत स्क्रिप्टिंग भाषा हो जुन दुबै पाइथन र रुबीको तुलनामा छिटो स्क्रिप्टि prain भाषा हुन्छ।",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "neovim_config": {
                "title": "प्याट्रिकको Neovovim कन्फिग",
                "text": "मेरो व्यक्तिगत Neovie कन्फिगरेसन। यो परियोजना मेरो मनपर्नेमा neoviim कन्फिगर गर्न प्रयोग गरिन्छ, अनुकूलन कुञ्जीविद्, थिम, र प्लगइन सहित। यो परियोजना Neoveim अधिक प्रयोगकर्ता-मैत्री र कुशलता को लागी मेरो व्यक्तिगत प्रयोग को लागी।",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "प्याट्रिकको नक्शा जेनरेटर",
                "text": "एक संयुक्त राज्य काउन्टी र राज्य नक्शा जेनरेटर, जैगोन्डास र म्याटपलोटल्श पुस्तकालयहरू प्रयोग गरेर पाइथनको साथ निर्माण गरिएको। यो परियोजना संयुक्त राज्य अमेरिकाको नक्शा उत्पादन गर्न प्रयोग गरिन्छ, काउन्टी र राज्य नक्शा सहित। यो परियोजना डाटा दृश्य र विश्लेषणको लागि अनुकूलन नक्शा सिर्जना गर्न प्रयोग गरिन्छ।",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "प्याट्रिकको शक्ति प्रसिद्ध पुस्तकालय",
                "text": "भविष्यको सन्दर्भको लागि शक्तिशेल स्क्रिप्टहरूको एक उपयोगी पुस्तकालय। $ प्रोफाइल स्क्रिप्ट सुविधाको साथ उपयोगी, मैले विन्डोज टर्मिनलबाट स्वचालित कार्यहरू स्वचालित सहयोगी फेला पार्छु, किनकि म विन्डोज ओएसको बारम्बार प्रयोगकर्ता हुँ।",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "प्याट्रिकको रुबी स्क्रिप्ट लाइब्रेरी",
                "text": "भविष्यको सन्दर्भको लागि रूबेल पुस्तकालयको एक उपयोगी पुस्तकालय। भविष्यका विकासशील अवधारणामा भविष्यको रूबीको लागि उपयोगी।",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF सीप निर्माणकर्ता",
                "text": "एचटीएमएफेक र Jinja 2 विस्तारहरू मार्फत PDFKIT र Jinja2 विस्तारहरू मार्फत PDFKIT र jinja2 विस्तारहरू मार्फत PDFKIT र jinja2 विस्तारहरू मार्फत निर्मित PDFKAIT र JINJA2 विस्तारहरू। यो परियोजना सीप र परियोजनाहरूको सूचीबाट PDF फाईलहरू उत्पन्न गर्न प्रयोग गरिन्छ। यो परियोजना कस्टम PDF पुनःसुरु सिर्जना गर्न प्रयोग गर्न सकिन्छ, जुन रोजगार अनुप्रयोगहरूको लागि धेरै उपयोगी छ।",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "विद्रोजल ईन्क्रिप्शन परियोजना",
                "text": "128, 1 27, र 266 बिट्सनमा सजीजेल ईन्गेरेप्शन एल्गोर्इप्शन एल्गोर्इप्शन एल्गोर्पिट एल्गोर्इजेन को एक परिवार। यो परियोजनाले विभिन्न प्रोग्रामिंग भाषाहरूमा विद्रोजल ईन्गाइचेन्ट एन्गाग्रेन्म प्रदर्शन गर्न प्रयोग गरिन्छ। यो परियोजना विद्रोही ईन्क्रिप्शन एल्प्रेपिट एल्गोरिथ्म को एक परिवार सिर्जना गर्न प्रयोग गरीन्छ।",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "सर्वोम्पीम म्यानुक्राफ्ट मोड",
                "text": "एक mincraft Mod जुन कस्टम उपकरण, आर्मर, मोब्स, ब्लकहरू, आयामहरू, र खेलहरूमा धेरै सुविधाहरू थप गर्दछ। Jajue संस्करणहरू -17-17 को साथ निर्मित Mine1-17 र 1.1 र 1.20 बीचको बीचमा।",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "टाइगर प्रोग्रामिंग भाषा",
                "text": "अनुकूलन प्रोग्रामिंग भाषा अनुवादक डिजाइन र प्रदर्शनको साथ प्रयोग गर्न दुबै गोरूहरू छन्। वेब सम्मेलन प्रयोग गरेर पोर्टफोलियो वेबसाइटमा कार्यान्वयन गरियो।",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "टाइगर टेलगेटिंग पेशेवर वेबसाइट",
                "text": "एक वेबसाइट मैले 20224 मा बनाएको बाघ टेलगेटिंग प्रोपेस्टिंग प्रोसेस, क्रीमन मा एक टेलगेटिंग कम्पनी, sc मा एक टेलगेटिंग कम्पनी, sc मा। प्रतिक्रिया संग निर्माण .js।",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "मेशिन परियोजना मोड",
                "text": "10+ भन्दा बढि मेसिनको 300 ++ कार्यान्वयनहरूको परिवार। अनुसन्धानको लागि पूर्णता परिवर्तन गर्न प्रयोग गरियो, विशेष गरी टाइगर प्रोग्रामिंग भाषाको लागि।",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "टाइगर प्रोग्रामिंग भाषा"
    },
    "contact": {
        "title": "मलाई सम्पर्क गर्नुस्",
        "header": "सम्पर्क जानकारी",
        "email": "Putteotssials@gmail.com",
        "description": "म ईमेल, लिंगेन्ट्स सन्देशहरू, र इन्स्टाग्राम सन्देशहरूबाट सोधपुछ गर्दछ। म फेरि कल गर्दछु यदि मेरो नम्बर पुनःसुरु मार्फत प्रदान गरिएको छ वा अन्यथा म मेरो फोन नम्बर निजी राख्न रुचाउँछु।"
    },
    "tiger": {
        "title": "टाइगर भाषा",
        "description": "टाइगर प्रोग्रामिंग भाषा भनेको अनुवादक डिजाइन र प्रदर्शनका साथ दुबै गोरूद रस्ट भाषामा निर्माण गर्ने अनुकूलन प्रोग्रामिंग भाषा हो। वेब सम्मेलन प्रयोग गरेर पोर्टफोलियो वेबसाइटमा कार्यान्वयन गरियो। टाइगर प्रोग्रामिंग भाषा भनेको अनुवादक डिजाइन र प्रदर्शनका साथ दुबै गोरूद रस्ट भाषामा निर्माण गर्ने अनुकूलन प्रोग्रामिंग भाषा हो। वेब सम्मेलन प्रयोग गरेर पोर्टफोलियो वेबसाइटमा कार्यान्वयन गरियो।",
        "more_info1": "अधिक जानकारी को लागी, मान मा सन्दर्भ गर्नुहोस्",
        "more_info2": "बाघ प्रोग्रामिंग भाषा Githuuuub respitir।",
        "select_engine": "इन्जिन चयन गर्नुहोस्:",
        "tiger_code": "टाइगर कोड:",
        "run_tiger": "टाइगर चलाउनुहोस्",
        "output": "आउटपुट:"
    },
    "tab": {
        "title": "प्याट्रिटल्टिन",
        "description": "पूर्ण स्ट्याक सफ्टवेयर इन्जिनियर केन्द्रीय फ्लोरिडामा आधारित"
    },
    "social_media": {
        "github": "Github",
        "instagram": "इन्स्टाग्राम",
        "linkedin": "रेन्क्नाइनको काम",
        "tiktok": "Tiktok",
        "youtube": "युट्यूब",
        "text_strip": "मेरो अनुसरण गर्नुहोस"
    },
    "logotext": "प्याट्रिच"
}