{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Thuis",
        "about": "Over mij",
        "portfolio": "Portefeuille",
        "projects": "Websiteprojecten",
        "tiger": "Tijgertaal",
        "formatter": "Json & Yaml Formatter",
        "contact": "Neem contact met mij op"
    },
    "home": {
        "title": "Thuis",
        "animated": {
            "first": "Full Stack Software Engineer",
            "second": "Webontwikkelaar",
            "third": "Spelontwikkelaar",
            "fourth": "Content Creator"
        },
        "footer": "Website nu vertaald en in meer dan 100+ talen!",
        "descriptionA": "Ervaren full-stack software-ingenieur en webontwikkelaar met een aangetoonde geschiedenis van succesvol toonaangevende ontwikkelingsprojecten, van het creëren van Java-aanpassingen voor Minecraft tot het verbeteren van gebruikerservaring in React.js en het implementeren van veilige REST API's, terwijl consequent agile methodologieën en effectieve team samenwerking gebruiken.",
        "descriptionB": "Bovendien ben ik een maker van geografie -inhoud die de algoritmen van meerdere sociale mediaplatforms, waaronder Instagram, YouTube en Tiktok, met succes heeft benut om een ​​respectabele en boeiende volgers te krijgen.",
        "portfolio_button": "Mijn portfolio",
        "contact_button": "Neem contact met mij op",
        "about_button": "Over mij"
    },
    "about": {
        "title": "Over mij",
        "personal_summary": {
            "title": "Persoonlijke samenvatting",
            "text": "Als een ervaren volledige stack -softwareontwikkelaar gevestigd in Orlando, FL, heb ik expertise aangetoond in verschillende technologieën, van Java en C ++ tot React.js en Node.js. Met een trackrecord van speerprojecten, inclusief de ontwikkeling van een Java -modificatieprogramma voor Minecraft en een lonende website voor vrachtwagenchauffeurs, heb ik leiderschap en innovatie getoond. Mijn toewijding aan uitmuntendheid is duidelijk in mijn vermogen om projectmanagement te stroomlijnen, complexe problemen op te lossen en oplossingen van hoge kwaliteit te leveren die de gebruikerservaring verbeteren en organisatorisch succes stimuleren."
        },
        "professional_experience": {
            "title": "Professionele ervaring",
            "entries": [
                {
                    "jobtitle": "Junior Software Engineer",
                    "where": "Orion180 verzekering",
                    "date": "2024 - aanwezig"
                },
                {
                    "jobtitle": "Oprichter & Full Stack Software Developer",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Full Stack Software Engineer",
                    "where": "Versnellen leren",
                    "date": "2023"
                },
                {
                    "jobtitle": "Lead Web Developer (Student Program)",
                    "where": "Clemson University GDI -programma",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Bureau supervisor",
                    "where": "Clemson University",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Technische vaardigheden",
            "header1": "Programmeertalen",
            "header2": "Frameworks & bibliotheken",
            "header3": "Tools & Technologies"
        },
        "services": {
            "title": "Mijn diensten",
            "entries": [
                {
                    "title": "Volledige stack engineering",
                    "text": "Ik bied uitgebreide oplossingen voor zowel front-end als back-end ontwikkeling, waardoor naadloze integratie en functionaliteit wordt gezorgd in de hele softwarestapel."
                },
                {
                    "title": "Webontwikkeling",
                    "text": "Met expertise in HTML-, CSS- en JavaScript-frameworks zoals React.js, maak ik visueel aantrekkelijke en gebruiksvriendelijke websites op maat gemaakt om aan de specifieke behoeften en voorkeuren van klanten te voldoen."
                },
                {
                    "title": "Spelontwikkeling",
                    "text": "Leveraging -talen zoals Java en C ++, ik ben gespecialiseerd in het creëren van meeslepende gamingervaringen, van concept en ontwerp tot implementatie en optimalisatie, het zorgen voor boeiende gameplay en soepele prestaties."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portefeuille",
        "filter_by": "Filterportfolio door:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca JSON",
                "text": "Een Python -project dat taalvertalingen stroomlijnt. Staat het mogelijk dat mijn website -portfolio wordt vertaald in 70+ talen, waaronder Spaans, Frans, Chinees, Arabisch en vele anderen. Dit project wordt gebruikt om een ​​meertalige websiteportfolio te maken, die erg handig is voor het bereiken van een breder publiek. Met dit project kan meer dan 99% van de wereld mijn portfolio lezen in een vloeiende taal.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Verbind vier",
                "text": "Massieve familie van meer dan 50+ implementaties van de Connect Four -game. Dit project omvat implementaties in meer dan 30 verschillende programmeertalen, waaronder Java, C ++, Python, JavaScript en meer. Bovendien omvat het ook meer dan 20 verschillende frameworks of andere formaten, waaronder React.js, Ruby on Rails, ASP.NET en meer.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Interopproject",
                "text": "Een project dat interoperabiliteit documenteert tussen verschillende programmeertalen. Bevat momenteel 15 verschillende programmeertalen en 18 uitvoeringspatronen.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "JSON & YAML Auto Formatter",
                "text": "Een line & autoFormatter voor JSON & YAML -bestanden. Dit project wordt gebruikt om JSON & YAML -bestanden op te maken, wat erg handig is om de code schoon en georganiseerd te houden. Gebouwd met Go, samengesteld met WebAssembly, en ingebed in mijn portfolio als een websiteproject. Meer formaten die in de toekomst komen.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON -generator",
                "text": "Lichtgewicht JSON -generator gebouwd in Python voor Minecraft Resource & Data Packs. Dit project wordt gebruikt om JSON -bestanden te genereren voor Minecraft -mods, inclusief aangepaste items, blokken en entiteiten. Zeer handig om niet alleen aangepaste datapacks te maken, maar ook voor mods via de functie MOD Name Switching.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Mijn educatieve ervaring",
                "text": "Naast mijn persoonlijke projecten heb ik ook talloze vaardigheden opgedaan uit educatieve ervaring. Klik hier om mijn LinkedIn -profiel te bekijken voor meer informatie.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Mijn professionele ervaring",
                "text": "Naast mijn persoonlijke projecten heb ik ook talloze vaardigheden opgenomen uit professionele ervaring. Klik hier om mijn LinkedIn -profiel te bekijken voor meer informatie.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Goodwin Portfolio -website",
                "text": "Deze website is mijn persoonlijke portfolio -website, gebouwd met React.js. Dit project wordt gebruikt om mijn vaardigheden en projecten te presenteren, en om potentiële werkgevers een platform te bieden om contact met mij op te nemen. Dit project wordt gebruikt om een ​​professionele online aanwezigheid te creëren.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patrick's Lua Script Library",
                "text": "Een nuttige bibliotheek van Lua -scripts voor toekomstige referentie. Deze bibliotheek wordt gebruikt om taken in Lua-scripts te automatiseren, die handig kunnen zijn voor prestatiebestand, omdat Lua meestal een snellere scripttaal is dan zowel Python als Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrick's Microsoft Excel -spreadsheet scripts (VBA)",
                "text": "Een nuttige bibliotheek van VBA -scripts voor Microsoft Excel. Deze bibliotheek wordt gebruikt om taken in Excel -spreadsheets te automatiseren.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Patrick's Neovim Config",
                "text": "Mijn persoonlijke neovim -configuratie. Dit project wordt gebruikt om Neovim naar mijn zin te configureren, inclusief aangepaste keybindingen, thema's en plug -ins. Dit project wordt gebruikt om Neovim gebruiksvriendelijker en efficiënter te maken voor mijn persoonlijk gebruik.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patrick's kaartgenerator",
                "text": "Een MAP -generator van de Verenigde Staten en staatskaart, gebouwd met Python met behulp van de geopandas- en Matplotlib -bibliotheken. Dit project wordt gebruikt om kaarten van de Verenigde Staten te genereren, inclusief provinciale en staatskaarten. Dit project wordt gebruikt om aangepaste kaarten te maken voor datavisualisatie en analyse.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patrick's PowerShell Script Library",
                "text": "Een nuttige bibliotheek met PowerShell -scripts voor toekomstige referentie. Handig met de functie $ profiel script, vind ik dit enorm nuttig voor het automatiseren van taken van de Windows -terminal, omdat ik een frequente gebruiker ben van het Windows -besturingssysteem.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patrick's Ruby Script Library",
                "text": "Een nuttige bibliotheek van Ruby Scripts voor toekomstige referentie. Handig voor toekomstige Ruby on Rails Developmental Concepts.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF Skills Builder",
                "text": "Een aangepaste PDF -bouwer gebouwd met Python via de PDFKit- en Jinja2 -extensies, naast HTML en JSON -indeling. Dit project wordt gebruikt om PDF -bestanden te genereren uit een lijst met vaardigheden en projecten. Dit project kan worden gebruikt om een ​​aangepast PDF -cv te maken, wat erg handig is voor sollicitaties.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandel Encryption Project",
                "text": "Een familie van 10+ implementaties van het Rijandel -coderingsalgoritme in 128, 192 en 256 bits. Dit project wordt gebruikt om het Rijandel -coderingsalgoritme in verschillende programmeertalen aan te tonen. Dit project wordt gebruikt om een ​​familie van implementaties van het Rijandel -coderingsalgoritme te creëren.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc minecraft mod",
                "text": "Een Minecraft -mod die aangepaste tools, pantser, mobs, blokken, afmetingen en nog veel meer functies aan het spel toevoegt. Gebouwd met Java-versies 8-17 voor geselecteerde Minecraft-versies tussen 1.16 en 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tijgerprogrammeertaal",
                "text": "Aangepaste programmeertaal ingebouwd in zowel Go & Rust om te experimenteren met tolkontwerp en prestaties. Geïmplementeerd op de Portfolio -website met behulp van webassemblage.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger Tailgating Pros -website",
                "text": "Een website die ik in 2024 heb gebouwd voor Tiger Tailgating Pro's, een tailgatingbedrijf in Clemson, SC. Gebouwd met react.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing Machine Project",
                "text": "Familie van meer dan 30+ implementaties van de Turing -machine. Wordt gebruikt om Turing -volledigheid aan te tonen voor verschillende programmeertalen voor onderzoek, vooral voor de tijgerprogrammeertaal.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tijgerprogrammeertaal"
    },
    "contact": {
        "title": "Neem contact met mij op",
        "header": "Contactgegevens",
        "email": "Pattygsocials@gmail.com",
        "description": "Ik reageer op vragen vanuit e -mail, LinkedIn -berichten en Instagram -berichten. Ik zal ook bellen als mijn nummer wordt verstrekt via CV of anderszins, hoewel ik liever mijn telefoonnummer privé houd."
    },
    "formatter": {
        "title": "Json & Yaml Formatter",
        "description": "De JSON & YAML Formatter is een tool waarmee u JSON- en YAML -bestanden kunt opmaken. Het is gebouwd met Go en WebAssembly en het is ontworpen om snel en efficiënt te zijn. De formatter is ontworpen om eenvoudig te gebruiken te zijn, met een eenvoudige interface waarmee u uw JSON- of YAML -code kunt plakken en deze kunt opmaken met een klik op een knop.",
        "more_info1": "Raadpleeg de README in de README voor meer informatie",
        "more_info2": "JSON/YAML Formatter Repository.",
        "format_as": "Formaat als:",
        "auto_detect": "Automatisch detecteren",
        "format": "Formaat"
    },
    "tiger": {
        "title": "Tijgertaal",
        "description": "De tijgerprogrammeertaal is een aangepaste programmeertaal die in zowel Go & Rust is gebouwd om te experimenteren met interpreterontwerp en prestaties. Geïmplementeerd op de Portfolio -website met behulp van webassemblage. De tijgerprogrammeertaal is een aangepaste programmeertaal die in zowel Go & Rust is gebouwd om te experimenteren met interpreterontwerp en prestaties. Geïmplementeerd op de Portfolio -website met behulp van webassemblage.",
        "more_info1": "Raadpleeg de README in de README voor meer informatie",
        "more_info2": "Tijgerprogrammeertaal GitHub Repository.",
        "select_engine": "Selecteer motor:",
        "tiger_code": "Tijgercode:",
        "run_tiger": "Run Tiger",
        "output": "Uitvoer:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Full Stack Software Engineer gevestigd in Central Florida"
    },
    "copy": {
        "text": "Kopiëren",
        "copied": "Gekopieerd!"
    },
    "social_media": {
        "github": "Gitub",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Volg mij"
    },
    "logotext": "Patrick"
}