{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Hjem",
        "about": "Om meg",
        "portfolio": "Portefølje",
        "projects": "Nettstedsprosjekter",
        "tiger": "Tigerspråk",
        "formatter": "Json & Yaml Formatter",
        "cube_solver": "Rubix Cube Solver",
        "contact": "Kontakt meg"
    },
    "home": {
        "title": "Hjem",
        "animated": {
            "first": "Full Stack Software Engineer",
            "second": "Nettutvikler",
            "third": "Spillutvikler",
            "fourth": "Innholdsskaper"
        },
        "footer": "Nettstedet nå oversatt og tilgjengelig på 100+ språk!",
        "descriptionA": "Erfarne full-stack programvareingeniør og webutvikler med en demonstrert historie med vellykket ledende utviklingsprosjekter, fra å lage Java-modifikasjoner for Minecraft for å forbedre brukeropplevelsen i React.js og implementere Secure REST API-er, mens vi konsekvent bruker smidige metodologier og effektivt teamsamarbeid.",
        "descriptionB": "I tillegg er jeg en geografisk innholdsskaper som har utnyttet algoritmene til flere sosiale medieplattformer, inkludert Instagram, YouTube og Tiktok, for å få en respektabel og engasjerende tilhengerbase.",
        "portfolio_button": "Min portefølje",
        "contact_button": "Kontakt meg",
        "about_button": "Om meg"
    },
    "about": {
        "title": "Om meg",
        "personal_summary": {
            "title": "Personlig sammendrag",
            "text": "Som en erfaren utvikler av full stack -programvare med base i Orlando, FL, har jeg demonstrert kompetanse innen forskjellige teknologier, fra Java og C ++ for å reagere.js og Node.js. Med en merittliste over spisspissprosjekter, inkludert utvikling av et Java -modifiseringsprogram for Minecraft og et givende nettsted for lastebilsjåfører, har jeg vist frem ledelse og innovasjon. Min forpliktelse til dyktighet er tydelig i min evne til å effektivisere prosjektstyring, løse komplekse problemer og levere løsninger av høy kvalitet som forbedrer brukeropplevelsen og driver organisasjonssuksess."
        },
        "professional_experience": {
            "title": "Yrkeserfaring",
            "entries": [
                {
                    "jobtitle": "Junior programvareingeniør",
                    "where": "ORION180 FORSIKRING",
                    "date": "2024 - Til stede"
                },
                {
                    "jobtitle": "Grunnlegger og full stabelprogramvareutvikler",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Full Stack Software Engineer",
                    "where": "Akselerere læring",
                    "date": "2023"
                },
                {
                    "jobtitle": "Lead Web Developer (Studentprogram)",
                    "where": "Clemson University GDI -program",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Skrivebordsveileder",
                    "where": "Clemson University",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Skrivebordsveileder",
                    "where": "Clemson University",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Tekniske ferdigheter",
            "header1": "Programmeringsspråk",
            "header2": "Rammer og biblioteker",
            "header3": "Verktøy og teknologier"
        },
        "services": {
            "title": "Mine tjenester",
            "entries": [
                {
                    "title": "Full Stack Engineering",
                    "text": "Jeg tilbyr omfattende løsninger på tvers av både front-end og back-end utvikling, og sikrer sømløs integrasjon og funksjonalitet gjennom hele programvarestabelen."
                },
                {
                    "title": "Nettutvikling",
                    "text": "Med ekspertise innen HTML-, CSS- og JavaScript-rammer som React.js, lager jeg visuelt tiltalende og brukervennlige nettsteder skreddersydd for å imøtekomme kundenes spesifikke behov og preferanser."
                },
                {
                    "title": "Spillutvikling",
                    "text": "Ved å utnytte språk som Java og C ++, spesialiserer jeg meg på å lage oppslukende spillopplevelser, fra konsept og design til implementering og optimalisering, sikre engasjerende spill og jevn ytelse."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portefølje",
        "filter_by": "Filterportefølje av:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca Json",
                "text": "Et Python -prosjekt som effektiviserer språkoversettelser. Gjør det mulig å oversatte min nettstedsportefølje til 70+ språk, inkludert spansk, fransk, kinesisk, arabisk og mange andre. Dette prosjektet brukes til å lage en flerspråklig nettstedportefølje, som er veldig nyttig for å nå et bredere publikum. Med dette prosjektet kan over 99% av verden lese porteføljen min på et flytende språk.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Koble til fire",
                "text": "Massiv familie med over 50+ implementeringer av Connect Four -spillet. Dette prosjektet inkluderer implementeringer på over 30 forskjellige programmeringsspråk, inkludert Java, C ++, Python, JavaScript og mer. I tillegg inkluderer det også over 20+ forskjellige rammer eller andre formater, inkludert React.js, Ruby on Rails, ASP.NET og mer.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "Dagligvareapp",
                "text": "En komplett full-stack .NET 9 Blazor Server-applikasjon for å administrere dagligvareartikler. Applikasjonen følger kontrolleren/tjenesten/depotmønsteret med Entity Framework Core for utholdenhet og inkluderer en omfattende testsuite.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Interop -prosjekt",
                "text": "Et prosjekt som dokumenterer interoperabilitet mellom forskjellige programmeringsspråk. Inkluderer for tiden 15 forskjellige programmeringsspråk og 18 utførelsesmønstre.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Inventory Register",
                "text": "Et register med full stack Demo (POS) med Inventory Management System bygget med Angular 17+ og Node.js. Denne applikasjonen demonstrerer et POS-system for profesjonell kvalitet med brukerautentisering, rollebasert tilgangskontroll, lagersporing og hånlig betalingsbehandling.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "JSON & YAML Auto Formatter",
                "text": "En Linter & Autoformatter for JSON & YAML -filer. Dette prosjektet brukes til å formatere JSON & YAML -filer, noe som er veldig nyttig for å holde koden ren og organisert. Bygget med GO, satt sammen med webAssembly, og innebygd i porteføljen min som et nettstedsprosjekt. Flere formater som kommer i fremtiden.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON Generator",
                "text": "Lett JSON -generator innebygd Python for Minecraft Resource & Data Packs. Dette prosjektet brukes til å generere JSON -filer for Minecraft -mods, inkludert tilpassede elementer, blokker og enheter. Veldig nyttig for ikke bare å lage tilpassede Datapacks, men også for mods via MOD Name Switching -funksjonen.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Min pedagogiske opplevelse",
                "text": "Ved siden av mine personlige prosjekter har jeg også tilegnet meg mange ferdigheter fra pedagogisk erfaring. Klikk her for å se min LinkedIn -profil for mer informasjon.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Min yrkeserfaring",
                "text": "Ved siden av mine personlige prosjekter har jeg også tilegnet meg mange ferdigheter fra yrkeserfaring. Klikk her for å se min LinkedIn -profil for mer informasjon.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Goodwin Portfolio nettsted",
                "text": "Dette nettstedet er min personlige portefølje nettsted, bygget med react.js. Dette prosjektet brukes til å vise frem mine ferdigheter og prosjekter, samt for å gi en plattform for potensielle arbeidsgivere å kontakte meg. Dette prosjektet brukes til å skape en profesjonell tilstedeværelse på nettet.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patrick's Lua Script Library",
                "text": "Et nyttig bibliotek med LUA -skript for fremtidig referanse. Dette biblioteket brukes til å automatisere oppgaver i LUA-skript, som kan komme til nytte for ytelses-trengende oppgaver, ettersom Lua vanligvis er et raskere skriptspråk enn både Python og Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrick's Microsoft Excel regneark (VBA)",
                "text": "Et nyttig bibliotek med VBA -skript for Microsoft Excel. Dette biblioteket brukes til å automatisere oppgaver i Excel -regneark.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Patricks Neovim Config",
                "text": "Min personlige neovim -konfigurasjon. Dette prosjektet brukes til å konfigurere Neovim etter min smak, inkludert tilpassede keybindings, temaer og plugins. Dette prosjektet brukes til å gjøre Neovim mer brukervennlig og effektivt til personlig bruk.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patricks kartgenerator",
                "text": "En amerikansk fylkes- og statlig kartgenerator, bygget med Python ved bruk av Geopandas og Matplotlib -bibliotekene. Dette prosjektet brukes til å generere kart over USA, inkludert fylkes- og statskart. Dette prosjektet brukes til å lage tilpassede kart for datavisualisering og analyse.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patricks PowerShell Script Library",
                "text": "Et nyttig bibliotek med PowerShell -skript for fremtidig referanse. Nyttig med $ profilskriptfunksjonen, synes jeg dette er enormt nyttig for å automatisere oppgaver fra Windows -terminalen, da jeg er en hyppig bruker av Windows OS.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patricks Ruby Script Library",
                "text": "Et nyttig bibliotek med Ruby -skript for fremtidig referanse. Nyttig for fremtidige Ruby on Rails utviklingskonsepter.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF Skills Builder",
                "text": "En tilpasset PDF -byggherre bygget med Python via PDFKIT- og Jinja2 -utvidelsene, sammen med HTML og JSON -formatering. Dette prosjektet brukes til å generere PDF -filer fra en liste over ferdigheter og prosjekter. Dette prosjektet kan brukes til å lage en tilpasset PDF -CV, som er veldig nyttig for jobbapplikasjoner.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandel Encryption Project",
                "text": "En familie med 10+ implementeringer av Rijandel -krypteringsalgoritmen i 128, 192 og 256 biter. Dette prosjektet brukes til å demonstrere Rijandel -krypteringsalgoritmen på forskjellige programmeringsspråk. Dette prosjektet brukes til å opprette en familie av implementeringer av Rijandel -krypteringsalgoritmen.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod",
                "text": "En Minecraft -mod som legger til tilpassede verktøy, rustning, mobber, blokker, dimensjoner og mange flere funksjoner til spillet. Bygget med Java-versjoner 8-17 for utvalgte Minecraft-versjoner mellom 1.16 og 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tiger -programmeringsspråk",
                "text": "Tilpasset programmeringsspråk bygget i både Go & Rust for å eksperimentere med tolkdesign og ytelse. Implementert på porteføljens nettsted ved hjelp av webmontering.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger Tailgating Pros nettsted",
                "text": "Et nettsted jeg bygde i 2024 for Tiger Tailgating Pros, et skreddersydd selskap i Clemson, SC. Bygget med react.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing Machine Project",
                "text": "Familie med over 30+ implementeringer av Turing -maskinen. Brukes til å demonstrere Turing -fullstendighet for forskjellige programmeringsspråk for forskning, spesielt for tigerprogrammeringsspråket.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tiger -programmeringsspråk"
    },
    "contact": {
        "title": "Kontakt meg",
        "header": "Kontaktinformasjon",
        "email": "pattyGsocials@gmail.com",
        "description": "Jeg svarer på henvendelser fra e -post-, LinkedIn -meldinger og Instagram -meldinger. Jeg vil også ringe tilbake hvis nummeret mitt blir gitt via CV eller på annen måte, selv om jeg foretrekker å holde telefonnummeret mitt privat."
    },
    "formatter": {
        "title": "Json & Yaml Formatter",
        "description": "JSON & YAML Formatter er et verktøy som lar deg formatere JSON- og YAML -filer. Den er bygget med Go og WebAssembly, og den er designet for å være rask og effektiv. Formatteren er designet for å være enkelt å bruke, med et enkelt grensesnitt som lar deg lime inn JSON- eller YAML -koden og formatere den med et klikk på en knapp.",
        "more_info1": "For mer informasjon, se Readme i",
        "more_info2": "JSON/YAML Formatter Repository.",
        "format_as": "Format som:",
        "auto_detect": "Auto Detect",
        "format": "Format"
    },
    "cube_solver": {
        "title": "Rubix Cube Solver",
        "start": "Løse"
    },
    "tiger": {
        "title": "Tigerspråk",
        "description": "Tiger -programmeringsspråket er et tilpasset programmeringsspråk som er bygget i både Go & Rust for å eksperimentere med tolkdesign og ytelse. Implementert på porteføljens nettsted ved hjelp av webmontering. Tiger -programmeringsspråket er et tilpasset programmeringsspråk som er bygget i både Go & Rust for å eksperimentere med tolkdesign og ytelse. Implementert på porteføljens nettsted ved hjelp av webmontering.",
        "more_info1": "For mer informasjon, se Readme i",
        "more_info2": "Tiger -programmeringsspråk GitHub Repository.",
        "select_engine": "Velg motor:",
        "tiger_code": "Tigerkode:",
        "run_tiger": "Kjør Tiger",
        "output": "Produksjon:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Full Stack Software Engineer Basert i Central Florida"
    },
    "copy": {
        "text": "Kopiere",
        "copied": "Kopiert!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Følg meg"
    },
    "logotext": "Patrick"
}