{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Dom",
        "about": "O mnie",
        "portfolio": "Teczka",
        "tiger": "Język tygrysa",
        "contact": "Skontaktuj się ze mną"
    },
    "home": {
        "title": "Dom",
        "animated": {
            "first": "Inżynier oprogramowania pełnego stosu",
            "second": "Twórca stron internetowych",
            "third": "Twórca gier",
            "fourth": "Twórca treści"
        },
        "descriptionA": "Doświadczony inżynier oprogramowania z pełnym stosem oprogramowania i deweloper z wykazaną historią pomyślnie wiodących projektów programistycznych, od tworzenia modyfikacji Java dla Minecraft po zwiększenie doświadczenia użytkownika w React.js i wdrażanie bezpiecznych interfejsów API REST, jednocześnie konsekwentnie stosując zwinne metodologie i skuteczną współpracę zespołową.",
        "descriptionB": "Ponadto jestem twórcą treści geograficznych, który z powodzeniem wykorzystał algorytmy wielu platform mediów społecznościowych, w tym Instagram, YouTube i Tiktok, aby uzyskać godną szacunku i angażującą bazę obserwujących.",
        "portfolio_button": "Moje portfolio",
        "contact_button": "Skontaktuj się ze mną",
        "about_button": "O mnie"
    },
    "about": {
        "title": "O mnie",
        "personal_summary": {
            "title": "Osobiste podsumowanie",
            "text": "Jako doświadczony programista oprogramowania z pełnym stosem z siedzibą w Orlando, Floryda, wykazałem wiedzę specjalistyczną w zakresie różnych technologii, od Java i C ++ po React.js i Node.js. Dzięki osiągnięciom projektów prowadzących, w tym rozwoju programu modyfikacji Java dla Minecraft i satysfakcjonującej strony internetowej dla kierowców ciężarówek, zaprezentowałem przywództwo i innowacje. Moje zaangażowanie w doskonałość jest widoczne w mojej zdolności do usprawnienia zarządzania projektami, rozwiązywania złożonych problemów i dostarczania wysokiej jakości rozwiązań, które poprawiają wrażenia użytkownika i zwiększają sukces organizacyjny."
        },
        "professional_experience": {
            "title": "Doświadczenie zawodowe",
            "entries": [
                {
                    "jobtitle": "Junior Software Engineer",
                    "where": "Ubezpieczenie Orion180",
                    "date": "2024 - obecny"
                },
                {
                    "jobtitle": "Założyciel i program oprogramowania z pełnym stosem",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Inżynier oprogramowania pełnego stosu",
                    "where": "Przyspieszyć naukę",
                    "date": "2023"
                },
                {
                    "jobtitle": "Główny programista internetowy (program studencki)",
                    "where": "CLEMSON University GDI Program",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Kierownik biurka",
                    "where": "Clemson University",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Umiejętności techniczne",
            "header1": "Języki programowania",
            "header2": "Frameworks & Library",
            "header3": "Narzędzia i technologie"
        },
        "services": {
            "title": "Moje usługi",
            "entries": [
                {
                    "title": "Inżynieria pełnego stosu",
                    "text": "Oferuję kompleksowe rozwiązania zarówno w rozwoju front-end, jak i na zapleczu, zapewniając bezproblemową integrację i funkcjonalność na całym stosie oprogramowania."
                },
                {
                    "title": "Opracowywanie stron internetowych",
                    "text": "Dzięki wiedzy specjalistycznej w zakresie HTML, CSS i JavaScript Frameworks, takich jak React.js, tworzę atrakcyjne wizualnie i przyjazne dla użytkownika strony internetowe dostosowane do specyficznych potrzeb i preferencji klientów."
                },
                {
                    "title": "Rozwój gry",
                    "text": "Wykorzystując języki, takie jak Java i C ++, specjalizuję się w tworzeniu wciągających gier, od koncepcji i projektowania po implementację i optymalizację, zapewniając zaangażowanie rozgrywki i sprawną wydajność."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Teczka",
        "filter_by": "Portfolio filtrowania::",
        "entries": {
            "connect_four": {
                "title": "Połącz cztery",
                "text": "Ogromna rodzina ponad 50 wdrożeń gry Connect Four. Ten projekt obejmuje implementacje w ponad 30 różnych językach programowania, w tym Java, C ++, Python, JavaScript i wiele innych. Ponadto obejmuje również ponad 20 różnych formatów lub innych formatów, w tym React.js, Ruby on Rails, ASP.NET i wiele innych.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Projekt interop",
                "text": "Projekt, który dokumentuje interoperacyjność między różnymi językami programowania. Obecnie zawiera 15 różnych języków programowania i 18 wzorców wykonania.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "excel_scripts": {
                "title": "Skrypty arkusza kalkulacyjnego Microsoft Excel (VBA)",
                "text": "Przydatna biblioteka skryptów VBA dla Microsoft Excel. Ta biblioteka służy do automatyzacji zadań w arkuszach kalkulacyjnych Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "minecraft_json_generator": {
                "title": "Minecraft Json Generator",
                "text": "Lekki generator JSON wbudowany w Python dla Minecraft Resource & Data Pack. Ten projekt służy do generowania plików JSON dla modów Minecraft, w tym elementów niestandardowych, bloków i jednostek. Bardzo przydatny nie tylko do tworzenia niestandardowych struktur danych, ale także dla modów za pomocą funkcji przełączania nazwy modów.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Moje doświadczenie edukacyjne",
                "text": "Oprócz moich osobistych projektów zdobyłem także wiele umiejętności z doświadczenia edukacyjnego. Kliknij tutaj, aby wyświetlić mój profil LinkedIn, aby uzyskać więcej informacji.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Moje doświadczenie zawodowe",
                "text": "Oprócz moich osobistych projektów zdobyłem również wiele umiejętności z doświadczenia zawodowego. Kliknij tutaj, aby wyświetlić mój profil LinkedIn, aby uzyskać więcej informacji.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Witryna Patrick Goodwin Portfolio",
                "text": "Ta strona internetowa jest moją osobistą witryną portfolio, zbudowaną z React.js. Ten projekt służy do zaprezentowania moich umiejętności i projektów, a także do zapewnienia platformy potencjalnym pracodawcom do skontaktowania się ze mną. Ten projekt służy do stworzenia profesjonalnej obecności online.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Biblioteka skryptowa Patricka",
                "text": "Przydatna biblioteka skryptów Lua do przyszłego odniesienia. Ta biblioteka służy do automatyzacji zadań w skryptach Lua, które mogą przydać się do zadań potrzebnych do wydajności, ponieważ LUA jest zwykle szybszym językiem scenariuszy niż zarówno Python, jak i Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "neovim_config": {
                "title": "Patrick's Neovim Config",
                "text": "Moja osobista konfiguracja Neovim. Ten projekt służy do konfigurowania Neovima według moich upodobań, w tym niestandardowych kluczowych krajów, motywów i wtyczek. Ten projekt służy do uczynienia Neovim bardziej przyjaznym dla użytkownika i wydajnym do mojego użytku osobistego.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Generator map Patricka",
                "text": "Generator map hrabstwa i stanu Stanów Zjednoczonych, zbudowany z Python za pomocą bibliotek Geopandas i Matplotlib. Projekt ten służy do generowania map Stanów Zjednoczonych, w tym map hrabstwa i stanu. Ten projekt służy do tworzenia niestandardowych map do wizualizacji danych i analizy.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Biblioteka skryptowa Patricka",
                "text": "Przydatna biblioteka skryptów PowerShell do przyszłego odniesienia. Przydatne w funkcji skryptu $ Profile uważam, że jest to niezwykle pomocne w automatyzacji zadań z terminalu Windows, ponieważ jestem częstym użytkownikiem systemu operacyjnego systemu Windows.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Biblioteka skryptów Patricka",
                "text": "Przydatna biblioteka skryptów Ruby do przyszłego odniesienia. Przydatne w przyszłych pojęciach rozwojowych Ruby on Rails.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "Builder umiejętności PDF",
                "text": "Niestandardowy konstruktor PDF zbudowany z Python za pośrednictwem rozszerzeń PDFKIT i Jinja2, wraz z formatowaniem HTML i JSON. Ten projekt służy do generowania plików PDF z listy umiejętności i projektów. Ten projekt może być używany do stworzenia niestandardowego CV PDF, które jest bardzo przydatne w aplikacjach do pracy.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Projekt szyfrowania Rijandel",
                "text": "Rodzina ponad 10 wdrożeń algorytmu szyfrowania Rijandela w 128, 192 i 256 bitach. Ten projekt służy do zademonstrowania algorytmu szyfrowania Rijandel w różnych językach programowania. Ten projekt służy do stworzenia rodziny wdrożenia algorytmu szyfrowania Rijandel.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod",
                "text": "Mod Minecraft, który dodaje niestandardowe narzędzia, zbroję, moby, bloki, wymiary i wiele innych funkcji do gry. Zbudowany z wersjami Java 8-17 dla wybranych wersji Minecraft między 1,16 a 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Język programowania tygrysa",
                "text": "Niestandardowy język programowania zbudowany zarówno w Go, jak i Rust do eksperymentowania z projektowaniem i wydajnością interpreterów. Zaimplementowane na stronie internetowej portfolio za pomocą zespołu internetowego.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Witryna zawodowa Tiger Tailgating",
                "text": "Witryna, którą zbudowałem w 2024 r. Dla Tiger Tailgating Pro, firma tailgating w Clemson, SC. Zbudowany z React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Projekt maszyn Turinga",
                "text": "Rodzina ponad 30 wdrożeń maszyny Turinga. Służy do wykazania kompletności Turinga dla różnych języków programowania do badań, szczególnie dla języka programowania tygrysa.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Język programowania tygrysa"
    },
    "contact": {
        "title": "Skontaktuj się ze mną",
        "header": "Informacje kontaktowe",
        "email": "pattygsocials@gmail.com",
        "description": "Odpowiadam na zapytania z wiadomości e -mail, wiadomości LinkedIn i wiadomości na Instagramie. Oddzwonię również, jeśli mój numer jest dostarczany za pośrednictwem CV lub w inny sposób, chociaż wolę zachować prywatny numer telefonu."
    },
    "tiger": {
        "title": "Język tygrysa",
        "description": "Język programowania Tiger to niestandardowy język programowania zbudowany zarówno w Go, jak i Rust do eksperymentowania z projektowaniem i wydajnością interpretera. Zaimplementowane na stronie internetowej portfolio za pomocą zespołu internetowego. Język programowania Tiger to niestandardowy język programowania zbudowany zarówno w Go, jak i Rust do eksperymentowania z projektowaniem i wydajnością interpretera. Zaimplementowane na stronie internetowej portfolio za pomocą zespołu internetowego.",
        "more_info1": "Aby uzyskać więcej informacji, zapoznaj się z Readme w",
        "more_info2": "Tiger Programming Language Repozytorium Github.",
        "select_engine": "Wybierz silnik:",
        "tiger_code": "Kod tygrysa:",
        "run_tiger": "Uruchom Tygrys",
        "output": "Wyjście:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Inżynier oprogramowania pełnego stosu z siedzibą w środkowej Florydzie"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Podążaj za mną"
    },
    "logotext": "Patrick"
}