{
    "name": "پیټرک څاڅکي",
    "menu": {
        "home": "کور",
        "about": "زما په اړه",
        "portfolio": "پورټوفولیو",
        "projects": "د ویب پا Fe ې پروژې",
        "tiger": "پړانګ ژبه",
        "portfolio_translator": "پورټ فولیو ژباړونکی",
        "formatter": "د جسن او یامل ب format ه",
        "cube_solver": "د روبیکس کیوب حلال",
        "contact": "له ما سره اړیکه ونیسئ"
    },
    "home": {
        "title": "کور",
        "animated": {
            "first": "د ټیټ سټیک سافټویر انجینر",
            "second": "ویب پراختیا کونکی",
            "third": "د لوبې پراختیا کونکی",
            "fourth": "د مینځپانګې جوړونکی"
        },
        "footer": "ویب پا Nation ه اوس په 100+ ژبو کې ژباړل شوې او د اخطار وړ ده!",
        "descriptionA": "Experienced full-stack software engineer & web developer with a demonstrated history of successfully leading development projects, from creating Java modifications for Minecraft to enhancing user experience in React.js and implementing secure REST APIs, while consistently employing agile methodologies and effective team collaboration.",
        "descriptionB": "سربیره پردې، زه د جغرافیه پالنې مینځپانګې رامینځته کونکی یم چې په بریالیتوب سره د ډیری ټولنیزو رسنیو پلیټونو الګوریتم په بریالیتوب سره معلومات لري، په شمول د انسټاګرام، یوټیوب، او ټیکټک په ګډون، د درناوي او مزو لرونکي د تعقیب اساس ترلاسه کولو لپاره",
        "portfolio_button": "زما پورټ فولیو",
        "contact_button": "له ما سره اړیکه ونیسئ",
        "about_button": "زما په اړه"
    },
    "about": {
        "title": "زما په اړه",
        "personal_summary": {
            "title": "شخصي لنډیز",
            "text": "په اورلینډو کې د یوې تجربه لرونکي بشپړ سټیک سافټویر پراختیا کونکي په توګه، ما د جاوا او C ++ لپاره د ریډیکټ کولو لپاره په مختلف ټیکنالوژیو کې مهارت ښودلی دی. د مړي د عملیاتو پروژې تعقیب سره، د ماین چلوونکو لپاره د جاوا د بدلون پروګرام پراختیا او د لاریو چلوونکو لپاره د انعامنې ویب پا .ې د رهبري او بدعت ښودنه کوي. My commitment to excellence is evident in my ability to streamline project management, solve complex problems, and deliver high-quality solutions that enhance user experience and drive organizational success."
        },
        "professional_experience": {
            "title": "مسلکي تجربه",
            "entries": [
                {
                    "jobtitle": "د جونیویر انجنیر",
                    "where": "orion180 بیمه",
                    "date": "2024 - موجوده"
                },
                {
                    "jobtitle": "بنسټ ایښودونکی او بشپړ سټیک سافټویر پراختیا کونکي",
                    "where": "سویلیم",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "د ټیټ سټیک سافټویر انجینر",
                    "where": "ګړندی زده کړه",
                    "date": "2023"
                },
                {
                    "jobtitle": "د لیډ ویب پراختیا کونکي (د زده کونکي پروګرام)",
                    "where": "د کلیمسن پوهنتون GDI برنامه",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "د ډیسک سوپروایزر",
                    "where": "د کلیمسن پوهنتون",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "د ډیسک سوپروایزر",
                    "where": "د کلیمسن پوهنتون",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "تخنیکي مهارتونه",
            "header1": "د برنامې ژبې",
            "header2": "چوکاټونه او کتابتونونه",
            "header3": "وسیلې او ټیکنالوژي"
        },
        "services": {
            "title": "زما خدمتونه",
            "entries": [
                {
                    "title": "د بشپړ سټیک انجینري",
                    "text": "زه د مخ په پای او پای پای پراختیا کې هراړخیز حلونه وړاندې کوم، د ټول سافټویر سټیک په اوږدو کې د بې سیمه ادغام او فعالیت ډاډ ورکولو."
                },
                {
                    "title": "د ویب پرمختیا",
                    "text": "په HTML، CSS کې د مهارت سره، او جاواسکریپټ چوکاټونو سره ضمیمه کړئ."
                },
                {
                    "title": "د لوبې پرمختیا",
                    "text": "د ژبې په توګه لکه جاوا او c ++، زه د اختلال لوبو تجربو او ډیزاین کولو لپاره، د ښکیلۍ او مطلوب کولو لپاره، د ښکیلۍ او مطلوب تضمین کې تخصص رامینځته کولو کې تخصص لرم."
                }
            ]
        }
    },
    "portfolio": {
        "title": "پورټوفولیو",
        "filter_by": "د فلمټر پورټ فولیو:",
        "entries": {
            "biblioteca": {
                "title": "bibeliotca JSon",
                "text": "د یو عضن پروژه چې د ژبې ژباړې په لاره اچوي. زما د ویب پا page ې پورټ فولیو ته اجازه ورکوي چې په 70 عکس ژبو ژبو ژباړل شي، پشمول د هسپانوي، فرانسوي، چینایی، عربي، او ډیری نورو. دا پروژه د څو ژبې ویب پا Cont ې پورټ فولیو جوړولو لپاره کارول کیږي، کوم چې د پراخه لیدونکو ته رسیدو لپاره خورا ګټور دی. د دې پروژې سره، له نړۍ څخه 99٪ کولی شي په روانه ژبه کې زما پورټ فولیو لوستلی شي.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "څلور وصل کړئ",
                "text": "د 8+ څخه زیاتو کورنیو پراخه کورنۍ. پدې پروژه کې د 30 مختلف برنامو ژبو کې پليات شامل دي، پشمول جاوا، C + C + جاواسکریپټ، او نور ډیر څه شامل دي. سربیره پردې، پدې کې د 20+ مختلف چوکاټونو یا نورو ب patess ې هم شامل دي، په شمول د UNE تړون، په ریلونو، ASP.net کې، او نور ډیر څه شامل دي.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "د",
                "text": "د خوراکي توکو د مدیریت لپاره بشپړ بشپړ بشپړ سټیک کاریال د کنټرولر / خدمت / بار وړلو نمونه تعقیبوي چې د دوام لپاره کونج کې کونج پورې اړه لري او هراړخیز ازمیښت سویټ پکې شامل وي.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "د همغږۍ پروژه",
                "text": "یوه پروژه چې د بیلابیل برنامې کولو ژبو ترمینځ ناراحتۍ کوي. اوس مهال د برنامې 15 ټولنیزې ژبې او 18 د اعدام نمونې لري.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "د خبرتیا ثبت",
                "text": "د پلور بشپړ ډیمو نقطه (PAS) د ساحې مدیریت سیسټم سره راجستر کړئ دا غوښتنلیک د کاروونکي اعتبار، د رول پراساس لاسرسي کنټرول، د لاسرسي تعقیب، او ټکن تادیاتو پروسس کولو سره د مسلکي کچې سیسټم ښیې.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "د جسون او YAML آٹو ب formatter ه",
                "text": "د JSon & Yaml فایلونو لپاره یو اړخ او اتوماتیکشنټر. دا پروژه د JSSon او YAML فایلونو په باکس کولو کې کارول کیږي، کوم چې د کوډ پاکولو او منظم ساتلو لپاره خورا ګټور دی. د تګ سره جوړ شوی، د ویباسیوسم سره ترکیب شوی، او زما پورټ فولیو کې د ویب پا content ې پروژې په توګه ځای په ځای شوی. په راتلونکي کې نور شکلونه راځي.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "د ماین پاکۍ جسن جنریټر",
                "text": "د سپک وزن جسون جنسټر د ماین پاکۍ سرچینو او ډیټا باکونو لپاره په پاتون کې رامینځته شوی. دا پروژه د ماین پاکۍ کړنو لپاره د جیسن فایلونو رامینځته کولو لپاره کارول کیږي، پشمول د ګمرکي توکو، بلاکونه او شرکتونه. یوازې د ګمرکي معلوماتو د رامینځته کولو لپاره خورا ګټور، مګر د موډونو لپاره هم د دفاع وزارت نوم بدلول.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "زما تعلیمي تجربه",
                "text": "زما تر مینځ زما د شخصي پروژو سره، ما د تحصیلي تجربې بې شمیره مهارتونه هم ترلاسه کړې. د نورو معلوماتو لپاره زما لینکین پروفایل لیدلو لپاره دلته کلیک وکړئ.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "زما مسلکي تجربه",
                "text": "زما د شخصي پروژو سره یوځای، ما د مسلکي تجربو بې شمیره مهارتونه هم ترلاسه کړي. د نورو معلوماتو لپاره زما لینکین پروفایل لیدلو لپاره دلته کلیک وکړئ.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "پیټرک ګالین پورټ فولیو ویب پا .ه",
                "text": "دا ویب پا .ه زما شخصي پورټ فولیو ویب پا is ه ده، د عکس سره جوړ شوی. دا پروژه زما د مهارتونو او پروژو ښودلو لپاره کارول کیږي، او همدارنګه احتمالي کارګرانو لپاره پلیټ فارم چمتو کړي چې له ما سره اړیکه ونیسي. دا پروژه د مسلکي آنلاین شتون رامینځته کولو لپاره کارول کیږي.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "د پیټریک لیټا سکریپټ کتابتون",
                "text": "د راتلونکي حوالې لپاره د لیوا سکریپونو ګټور کتابتون. دا کتابتون د LUA سکریپټونو دندو اتومات کولو لپاره کارول کیږي، کوم چې کولی شي د فعالیت اړتیا لرونکو دندو لپاره راشي، لکه څنګه چې LUA دواړه د پخوا او روبي په پرتله د ګړندي سکریپټ ژبه ده.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "د پیټریک مایکروسافټ اکسیل سټسایټ سکریپټ سکریپټونه (VBA)",
                "text": "د مایکروسافټ ایکسل لپاره د VBA سکریپټونو ګټور کتابتون. دا کتابتون په ایکسلیل سپریځونو کې دندې اتومات لپاره کارول کیږي.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "د پیټریک نیووینم تشکیل",
                "text": "زما د شخصي نوار تشکیلات. دا پروژه زما د خوښیو په شمول د نیوووین په ترتیب کولو کې کارول کیږي، پشمول د ګمرکي کافي، موضوعات، موضوعات او فلګونه. دا پروژه زما د شخصي استعمال لپاره د Novoim نور کاروونکي دوستانه او موثر جوړولو لپاره کارول کیږي.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "د پیټریک نقشه جنریټر",
                "text": "د متحده ایالاتو کاونټي او د دولت نقشه جنریټر، د ګیپنډاس او مټ کمپیوټري کتابتونونو په کارولو سره جوړ شوی. دا پروژه د متحده ایالاتو نقشې د جوړولو لپاره، د کاؤنټ او دولتي نقشې په ګډون. دا پروژه د معلوماتو لید لید او تحلیل لپاره د ګمرکي نقشې رامینځته کولو لپاره کارول کیږي.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "د پیټریک د پورورسیل سکریپټ کتابتون",
                "text": "د راتلونکي حوالې لپاره د پاور هیل اندازت کتابتون. د IE پروفایل سکریپټ ب feature ې سره ګټور، زه دا د وینډوز ټرمینل څخه د کارونو لپاره په زړه پوری ګټوره ګ .م، ځکه چې زه د OS OS پر مکرر کاروبار یم.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "د پیټریک روبی سکریپټ کتابتون",
                "text": "د راتلونکي حوالې لپاره د روبي سکریپونو ګټور کتابتون. د روږو پرمختیا مفهومونو کې د راتلونکي روبی لپاره ګټور.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "د پی ډی اف مهارت جوړونکی",
                "text": "د دودیز پی ډی ایف اپر د پیټون او جینجا2 د غزولو سره، د HTML او JSON ب formating و سره جوړ شوی. دا پروژه د مهارتونو او پروژو له لیست څخه د پی ډی اف فایلونو رامینځته کولو لپاره کارول کیږي. دا پروژه د دودیز PDF بیا پیل کولو لپاره کارول کیدی شي، کوم چې د دندو غوښتنلیکونو لپاره خورا ګټور دی.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "د رویژندل کوډونې پروژه",
                "text": "د 10+ د RULDALE الګوریتم یوه کورنۍ په 12 12 بجو، 192، او 256 ټوټې. دا پروژه په مختلف ډول برنامې په انګلیسي ژبو کې د رجنډل کوډونې الګوریتم ښودلو لپاره کارول کیږي. دا پروژه د RIJandle کوډ کولو د الګوریتم د پلي کولو یوې کورنۍ رامینځته کولو لپاره کارول کیږي.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "د لیمیمس د کان کیندنې دفاع وزارت",
                "text": "د یو ماین پاکۍ شرکت چې ګمرکي وسیلې، زغره، موبونه، بلاکونه، بلاکونه، لوبې ته ډیری ب features ې لري. د 1 1.16 او 1.20 ترمینځ د ماین ساختماني نسخې غوره کولو لپاره د جاوا سیسټمونو سره جوړ شوی.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "د پړانګ برنامې ژبه",
                "text": "د ګمرکي برنامې ژبه په دواړو ځوانو او د ژباړونکي ډیزاین او کړنو سره تجربې کې رامینځته شوي. د ویب مجلس په کارولو سره د پورټ فولیو ویب پا on ه کې پلي کول.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "د پړانګ ټیلاسیټ پروپلیټ ویب پا .ه",
                "text": "یوه ویب پا .ه چې ما په 2024 کې د پړانګې تسمې تادیې لپاره جوړه کړې، په کلیمسن کې د ټیلګینګ شرکت. د تړون.s سره جوړ شوی.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "د روزنې ماشین پروژه",
                "text": "د زیاتو ماشین د ټکر کولو په 30+ پلي کول. د څیړنې لپاره د مختلف برنامې لرونکي ژبو لپاره بشپړتیا ښودلو لپاره کارول کیږي، په ځانګړي توګه د پړانګې برنامې ژبې لپاره.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "د پړانګ برنامې ژبه"
    },
    "contact": {
        "title": "له ما سره اړیکه ونیسئ",
        "header": "د اړیکې معلومات",
        "email": "د پیټيګسفوسفوس @ gmail.com",
        "description": "زه د بریښنالیک، لینک شوي پیغامونو، او انسټاګرام پیغامونو څخه پوښتنو ته ځواب ویلو. زه به بیرته زنګ ووهم که زما شمیره د بیا امتیاز کولو یا بل ډول ورکړل شي، که څه هم زه غوره ګ .م چې زما د تلیفون شمیره شخصي وساتئ."
    },
    "formatter": {
        "title": "د جسن او یامل ب format ه",
        "description": "د JSON & Yaml ب format ه یوه وسیله ده چې تاسو ته اجازه درکوي د جسسن او یامل فایلونو ب format ه کولو ته اجازه درکوي. دا د تګ او ویباسیوبلی په تیریدو سره جوړ شوی، او دا ګړندی او اغیزمنتوب ډیزاین شوی. ب format ه د کارولو لپاره اسانه ډیزاین شوې، د ساده انٹرفیس سره اسانه دي چې تاسو ته ستاسو د JSON یا YAML کوډ کې پیسیږي او د ت button ۍ په کلیک کولو کې یې پیسټ کړئ.",
        "more_info1": "د نورو معلوماتو لپاره، په کې د لومړي معلوماتو ته مراجعه وکړئ",
        "more_info2": "د JSon / Yaml ب formatter ه تنظیم کول.",
        "format_as": "ب format ه لکه څنګه چې:",
        "auto_detect": "آټو کشف",
        "format": "ب .ه"
    },
    "cube_solver": {
        "title": "د روبیکس کیوب حلال",
        "start": "حل کړه"
    },
    "tiger": {
        "title": "پړانګ ژبه",
        "description": "د مغز برنامې ژبه د ګمرکي برنامې ژبه ده چې په روان او د ژباړونکي ډیزاین او فعالیت سره تجربې کې تجربې کې رامینځته کیږي. د ویب مجلس په کارولو سره د پورټ فولیو ویب پا on ه کې پلي کول. د مغز برنامې ژبه د ګمرکي برنامې ژبه ده چې په روان او د ژباړونکي ډیزاین او فعالیت سره تجربې کې تجربې کې رامینځته کیږي. د ویب مجلس په کارولو سره د پورټ فولیو ویب پا on ه کې پلي کول.",
        "more_info1": "د نورو معلوماتو لپاره، په کې د لومړي معلوماتو ته مراجعه وکړئ",
        "more_info2": "د پړانګ برنامې ګیټوب ذخیره.",
        "select_engine": "انجن وټاکئ:",
        "tiger_code": "د ټاګر کوډ:",
        "run_tiger": "پړانګ ځغلي",
        "output": "محصول:"
    },
    "tab": {
        "title": "پیټرک څاڅکي",
        "description": "په مرکزي فلوریډا کې د سټیک سافټویر انجینر"
    },
    "copy": {
        "text": "کاپي",
        "copied": "کاپي!"
    },
    "social_media": {
        "github": "ګیتوب",
        "instagram": "انسټاګرام",
        "linkedin": "لینکولین",
        "tiktok": "ټیکټک",
        "youtube": "یوټیوب",
        "text_strip": "ما تعقیب کړئ"
    },
    "languages": {
        "title": "پورټ فولیو ژباړونکی",
        "description": "کشف کړئ چې څنګه زما پورټ فولیو د نړۍ څخه لیدونکو ته د لاسرسي وړ دی چې له 100 څخه ډیر ژبې ملاتړ کوي.",
        "global_accessibility": {
            "title": "نړیوال لاسرسي",
            "description": "زما پورټ فولیو د زده کونکو په اړه شتون لري، د نړۍ له ګوټ ګوټ څخه لیدونکو ته د لاسرسي وړ دي. پدې څو ژبو سره د سافټویر پراختیا کې په عایداتو او نړیوال رسۍ سره زموږ ژمنتیا څرګندوي.",
            "stats": {
                "languages_supported": "ملاتړ شوی ژبې",
                "countries_represented": "هغه هیوادونو نماینده ده",
                "continents_covered": "په پراخه کچه پوښ ​​شوي"
            }
        },
        "features": {
            "title": "ب Features ې",
            "items": [
                {
                    "title": "د ریښتیني وخت ژباړه:",
                    "description": "په فوري ډول د ژبې انتخاب کونکي سره."
                },
                {
                    "title": "د URL پر بنسټ ژبه:",
                    "description": "د ژبې غوره توبونه په URL کې ساتل شوي"
                },
                {
                    "title": "د فزیکي سکریپټ ملاتړ:",
                    "description": "د عربي، چینایی، هندي، او نور په څیر د سکریپونو مناسب وړاندیز کول"
                },
                {
                    "title": "کلتوري حساسیت:",
                    "description": "ژباړې کلتوري شرایط په پام کې ونیسئ، نه یوازې لفظي معنی"
                },
                {
                    "title": "سیو اصلاح شوی:",
                    "description": "هره ژبه د لټون انجنونو لپاره مطلوب دی"
                }
            ]
        },
        "world_map": {
            "title": "د متقابل نړۍ نقشه",
            "description": "د خپلې موافقې ژبې لیدو لپاره په نقشه کې هیوادونو باندې هور ځئ:",
            "languages_label": "ژبې",
            "legend": {
                "supported": "ملاتړ شوی ژبې",
                "not_supported": "د ژبې ملاتړ نه"
            },
            "zoom_controls": {
                "zoom_in": "زوم په",
                "zoom_out": "زوم بهر",
                "reset": "لیدنه"
            }
        },
        "supported_languages": {
            "title": "ملاتړ شوې ژبې"
        },
        "interactive_country_map": {
            "title": "د متقابل هیواد نقشه",
            "description": "د دوی ملاتړ شوي ژبې لیدو لپاره لاندې هیوادونو باندې هور ځئ:",
            "language_count": {
                "single": "ژبه",
                "multiple": "ژبې"
            }
        },
        "tooltips": {
            "no_language_support": "د ژبې ملاتړ نه"
        }
    },
    "logotext": "پیټریک"
}