{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Lar",
        "about": "Sobre mim",
        "portfolio": "Portfólio",
        "projects": "Projetos de sites",
        "tiger": "Idioma tigre",
        "portfolio_translator": "Tradutor de portfólio",
        "formatter": "JSON & YAML FORMATTER",
        "cube_solver": "Solver de cubo Rubix",
        "contact": "Entre em contato comigo"
    },
    "home": {
        "title": "Lar",
        "animated": {
            "first": "Engenheiro de software completo de pilha",
            "second": "Desenvolvedor da Web",
            "third": "Desenvolvedor de jogos",
            "fourth": "Criador de conteúdo"
        },
        "footer": "Site agora traduzido e disponível em mais de 100 idiomas!",
        "descriptionA": "O engenheiro de software e o desenvolvedor da Web experiente com uma história demonstrada de projetos de desenvolvimento com sucesso, desde a criação de modificações Java para o Minecraft até o aprimoramento da experiência do usuário no React.js e a implementação de APIs de descanso seguras, enquanto empregam metodologias ágeis consistentemente e a colaboração eficaz da equipe.",
        "descriptionB": "Além disso, sou um criador de conteúdo de geografia que alavancou com sucesso os algoritmos de várias plataformas de mídia social, incluindo Instagram, YouTube e Tiktok, para obter uma base de seguidores respeitável e envolvente.",
        "portfolio_button": "Meu portfólio",
        "contact_button": "Entre em contato comigo",
        "about_button": "Sobre mim"
    },
    "about": {
        "title": "Sobre mim",
        "personal_summary": {
            "title": "Resumo pessoal",
            "text": "Como um desenvolvedor experiente de software de pilha completa com sede em Orlando, FL, demonstrei experiência em várias tecnologias, de Java e C ++ a React.js e Node.js. Com um histórico de projetos de lança, incluindo o desenvolvimento de um programa de modificação Java para Minecraft e um site gratificante para motoristas de caminhão, mostrei liderança e inovação. Meu compromisso com a excelência é evidente em minha capacidade de otimizar o gerenciamento de projetos, resolver problemas complexos e fornecer soluções de alta qualidade que aprimoram a experiência do usuário e impulsionam o sucesso organizacional."
        },
        "professional_experience": {
            "title": "Experiência profissional",
            "entries": [
                {
                    "jobtitle": "Engenheiro de software júnior",
                    "where": "Seguro Orion180",
                    "date": "2024 - presente"
                },
                {
                    "jobtitle": "Fundador e desenvolvedor de software de pilha completa",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Engenheiro de software completo de pilha",
                    "where": "Acelerar o aprendizado",
                    "date": "2023"
                },
                {
                    "jobtitle": "Desenvolvedor líder da Web (Programa de Estudantes)",
                    "where": "Programa de GDI da Universidade Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Supervisor de mesa",
                    "where": "Universidade Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Supervisor de mesa",
                    "where": "Universidade Clemson",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Habilidades técnicas",
            "header1": "Linguagens de programação",
            "header2": "Estruturas e bibliotecas",
            "header3": "Ferramentas e tecnologias"
        },
        "services": {
            "title": "Meus serviços",
            "entries": [
                {
                    "title": "Engenharia de pilha completa",
                    "text": "Ofereço soluções abrangentes no desenvolvimento front-end e back-end, garantindo integração e funcionalidade perfeitas em toda a pilha de software."
                },
                {
                    "title": "Desenvolvimento da Web",
                    "text": "Com a experiência em estruturas HTML, CSS e JavaScript como React.js, criei sites visualmente atraentes e amigáveis, adaptados para atender às necessidades e preferências específicas dos clientes."
                },
                {
                    "title": "Desenvolvimento de jogos",
                    "text": "Aproveitando idiomas como Java e C ++, especializo -me na criação de experiências imersivas de jogos, do conceito e design à implementação e otimização, garantindo a jogabilidade envolvente e o desempenho suave."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfólio",
        "filter_by": "Portfólio de filtro por:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca JSON",
                "text": "Um projeto Python que simplifica as traduções de idiomas. Permite que meu portfólio de sites seja traduzido em mais de 70 idiomas, incluindo espanhol, francês, chinês, árabe e muitos outros. Este projeto é usado para criar um portfólio multilíngue de sites, que é muito útil para alcançar um público mais amplo. Com este projeto, mais de 99% do mundo pode ler meu portfólio em uma linguagem fluente.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Conecte quatro",
                "text": "Família maciça de mais de 50 implementações do jogo Connect Four. Este projeto inclui implementações em mais de 30 linguagens de programação diferentes, incluindo Java, C ++, Python, JavaScript e muito mais. Além disso, também inclui mais de 20 estruturas diferentes ou outros formatos, incluindo react.js, rubi nos trilhos, asp.net e muito mais.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "Aplicativo de supermercado",
                "text": "Um aplicativo completo de servidor Blazor de pilha completa .NET 9 para gerenciar itens de supermercado. O aplicativo segue o padrão controlador/serviço/repositório com o núcleo da estrutura da entidade para persistência e inclui um conjunto de testes abrangente.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Projeto Interop",
                "text": "Um projeto que documenta a interoperabilidade entre diferentes linguagens de programação. Atualmente, inclui 15 linguagens de programação diferentes e 18 padrões de execução.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Registro de inventário",
                "text": "Um registro de ponto de venda de Demo de Ponto de Pilha Fulosa (POS) no Sistema de Gerenciamento de Inventário construído com o Angular 17+ e Node.JS. Este aplicativo demonstra um sistema POS de nível profissional com autenticação de usuário, controle de acesso baseado em funções, rastreamento de inventário e processamento de pagamentos simulados.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "JSON & YAML Auto Formatter",
                "text": "Um Linter & Autoformatter para arquivos JSON e YAML. Este projeto é usado para formatar arquivos JSON e YAML, que é muito útil para manter o código limpo e organizado. Construído com GO, compilado com o WebAssembly e incorporado ao meu portfólio como um projeto de site. Mais formatos para vir no futuro.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON Generator",
                "text": "Gerador JSON leve construído em Python para minecraft Recursos e pacotes de dados. Este projeto é usado para gerar arquivos JSON para mods Minecraft, incluindo itens, blocos e entidades personalizados. Muito útil não apenas para criar dados de dados personalizados, mas também para mods através do recurso de comutação de nome do mod.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Minha experiência educacional",
                "text": "Juntamente com meus projetos pessoais, também adquiri inúmeras habilidades da experiência educacional. Clique aqui para ver meu perfil do LinkedIn para obter mais informações.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Minha experiência profissional",
                "text": "Juntamente com meus projetos pessoais, também adquiri inúmeras habilidades da experiência profissional. Clique aqui para ver meu perfil do LinkedIn para obter mais informações.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Site do portfólio Patrick Goodwin",
                "text": "Este site é o meu site de portfólio pessoal, construído com react.js. Este projeto é usado para mostrar minhas habilidades e projetos, além de fornecer uma plataforma para que os empregadores em potencial entrem em contato comigo. Este projeto é usado para criar uma presença profissional online.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Biblioteca de Scripts Lua de Patrick",
                "text": "Uma biblioteca útil de scripts Lua para referência futura. Esta biblioteca é usada para automatizar tarefas nos scripts da Lua, que podem ser úteis para tarefas necessárias para desempenho, pois Lua geralmente é uma linguagem de script mais rápida do que o Python e o Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Scripts de planilha do Microsoft Excel de Patrick (VBA)",
                "text": "Uma biblioteca útil de scripts VBA para o Microsoft Excel. Esta biblioteca é usada para automatizar tarefas nas planilhas do Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Config Neovim de Patrick",
                "text": "Minha configuração pessoal de neovim. Este projeto é usado para configurar o Neovim ao meu gosto, incluindo pedidos de chave personalizados, temas e plugins. Este projeto é usado para tornar o Neovim mais amigável e eficiente para o meu uso pessoal.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Gerador de mapa de Patrick",
                "text": "Um gerador de mapas do Condado e Estado dos Estados Unidos, construído com Python usando as bibliotecas Geopandas e Matplotlib. Este projeto é usado para gerar mapas dos Estados Unidos, incluindo mapas do condado e do estado. Este projeto é usado para criar mapas personalizados para visualização e análise de dados.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Biblioteca de Scripts PowerShell de Patrick",
                "text": "Uma biblioteca útil de scripts do PowerShell para referência futura. Útil com o recurso de script $ perfil, acho isso imensamente útil para automatizar tarefas do terminal do Windows, pois sou um usuário frequente do sistema operacional Windows.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Biblioteca de Scripts Ruby de Patrick",
                "text": "Uma biblioteca útil de scripts de rubi para referência futura. Útil para futuros conceitos de desenvolvimento do Ruby on Rails.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "Construtor de habilidades em PDF",
                "text": "Um construtor PDF personalizado construído com Python através das extensões PDFKit e Jinja2, ao lado da formatação HTML e JSON. Este projeto é usado para gerar arquivos PDF a partir de uma lista de habilidades e projetos. Este projeto pode ser usado para criar um currículo de PDF personalizado, que é muito útil para aplicativos de emprego.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Projeto de criptografia Rijandel",
                "text": "Uma família de mais de 10 implementações do algoritmo de criptografia Rijandel em 128, 192 e 256 bits. Este projeto é usado para demonstrar o algoritmo de criptografia Rijandel em diferentes linguagens de programação. Este projeto é usado para criar uma família de implementações do algoritmo de criptografia Rijandel.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod",
                "text": "Um mod do Minecraft que adiciona ferramentas personalizadas, armaduras, mobs, blocos, dimensões e muitos outros recursos ao jogo. Construído com as versões Java 8-17 para selecionar versões Minecraft entre 1,16 e 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Linguagem de programação do tigre",
                "text": "Linguagem de programação personalizada incorporada em Go & Rust para experimentar o design e o desempenho do intérprete. Implementado no site do portfólio usando a Web Assembly.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Site Tiger Fatiating Pros",
                "text": "Um site que eu construí em 2024 para a Tiger Tailgating Pros, uma empresa de utilização não autorizada em Clemson, SC. Construído com react.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Projeto Turing Machine",
                "text": "Família de mais de 30 implementações da máquina de Turing. Usado para demonstrar integridade de Turing para diferentes linguagens de programação para pesquisa, especialmente para a linguagem de programação do Tiger.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Linguagem de programação do tigre"
    },
    "contact": {
        "title": "Entre em contato comigo",
        "header": "Informações de contato",
        "email": "pattygsocials@gmail.com",
        "description": "Eu respondo a perguntas de email, mensagens do LinkedIn e mensagens do Instagram. Também ligarei de volta se meu número for fornecido via currículo ou não, embora eu prefira manter meu número de telefone privado."
    },
    "formatter": {
        "title": "JSON & YAML FORMATTER",
        "description": "O formatador JSON & YAML é uma ferramenta que permite formatar arquivos JSON e YAML. Ele é construído com Go e WebAssembly, e foi projetado para ser rápido e eficiente. O formatador foi projetado para ser fácil de usar, com uma interface simples que permite colar em seu código JSON ou YAML e formatá -lo com o clique de um botão.",
        "more_info1": "Para mais informações, consulte o readme no",
        "more_info2": "Repositório de formatação JSON/YAML.",
        "format_as": "Formato como:",
        "auto_detect": "Detecção automática",
        "format": "Formatar"
    },
    "cube_solver": {
        "title": "Solver de cubo Rubix",
        "start": "Resolver"
    },
    "tiger": {
        "title": "Idioma tigre",
        "description": "A linguagem de programação do Tiger é uma linguagem de programação personalizada construída em Go & Rust para experimentar o design e o desempenho do intérprete. Implementado no site do portfólio usando a Web Assembly. A linguagem de programação do Tiger é uma linguagem de programação personalizada construída em Go & Rust para experimentar o design e o desempenho do intérprete. Implementado no site do portfólio usando a Web Assembly.",
        "more_info1": "Para mais informações, consulte o readme no",
        "more_info2": "Linguagem de programação do tigre Repositório GitHub.",
        "select_engine": "Selecione o motor:",
        "tiger_code": "Código do tigre:",
        "run_tiger": "Execute o tigre",
        "output": "Saída:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Engenheiro de software de pilha completa com sede na Flórida Central"
    },
    "copy": {
        "text": "Cópia",
        "copied": "Copiado!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Me siga"
    },
    "languages": {
        "title": "Tradutor de portfólio",
        "description": "Descubra como meu portfólio é acessível a visitantes de todo o mundo, com apoio para mais de 100 idiomas.",
        "global_accessibility": {
            "title": "Acessibilidade global",
            "description": "Meu portfólio está disponível em mais de {count} idiomas, tornando -o acessível para visitantes de todo o mundo. Essa abordagem multilíngue demonstra meu compromisso com a inclusão e o alcance global no desenvolvimento de software.",
            "stats": {
                "languages_supported": "Idiomas suportados",
                "countries_represented": "Países representados",
                "continents_covered": "Continentes cobertos"
            }
        },
        "features": {
            "title": "Características",
            "items": [
                {
                    "title": "Tradução em tempo real:",
                    "description": "Alterne as linguagens instantaneamente com o seletor de idiomas"
                },
                {
                    "title": "Idioma baseado em URL:",
                    "description": "As preferências de idiomas são preservadas no URL"
                },
                {
                    "title": "Suporte ao script nativo:",
                    "description": "Renderização adequada de scripts como árabe, chinês, hindi e mais"
                },
                {
                    "title": "Sensibilidade cultural:",
                    "description": "As traduções consideram o contexto cultural, não apenas significados literais"
                },
                {
                    "title": "SEO otimizado:",
                    "description": "Cada variante de idioma é otimizada para mecanismos de pesquisa"
                }
            ]
        },
        "world_map": {
            "title": "Mapa do mundo interativo",
            "description": "Passe o mouse sobre os países no mapa para ver seus idiomas suportados:",
            "languages_label": "Idiomas",
            "legend": {
                "supported": "Idiomas suportados",
                "not_supported": "Sem suporte ao idioma"
            },
            "zoom_controls": {
                "zoom_in": "Zoom entre",
                "zoom_out": "Amplie o zoom",
                "reset": "Redefinir visualização"
            }
        },
        "supported_languages": {
            "title": "Idiomas suportados"
        },
        "interactive_country_map": {
            "title": "Mapa interativo do país",
            "description": "Passe o mouse sobre países abaixo para ver seus idiomas apoiados:",
            "language_count": {
                "single": "linguagem",
                "multiple": "idiomas"
            }
        },
        "tooltips": {
            "no_language_support": "Sem suporte ao idioma"
        }
    },
    "logotext": "Patrick"
}