{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Início",
        "about": "Sobre Mim",
        "portfolio": "Portfólio",
        "tiger": "Linguagem Tiger",
        "contact": "Contato"
    },
    "home": {
        "title": "Início",
        "animated": {
            "first": "Engenheiro de Software Full Stack",
            "second": "Desenvolvedor Web",
            "third": "Desenvolvedor de Jogos",
            "fourth": "Criador de Conteúdo"
        },
        "descriptionA": "Engenheiro de software full-stack e desenvolvedor web experiente, com histórico comprovado de liderança bem-sucedida em projetos de desenvolvimento, desde a criação de modificações em Java para Minecraft até a melhoria da experiência do usuário com React.js e a implementação de APIs REST seguras, sempre utilizando metodologias ágeis e uma colaboração eficaz em equipe.",
        "descriptionB": "Além disso, sou criador de conteúdo de geografia e consegui aproveitar os algoritmos de várias plataformas sociais, como Instagram, YouTube e TikTok, para conquistar uma base de seguidores respeitável e engajada.",
        "portfolio_button": "Meu Portfólio",
        "contact_button": "Entre em Contato",
        "about_button": "Sobre Mim"
    },
    "about": {
        "title": "Sobre Mim",
        "personal_summary": {
            "title": "Resumo Pessoal",
            "text": "Como Desenvolvedor Full Stack experiente com sede em Orlando, FL, demonstrei conhecimento em várias tecnologias, de Java e C++ a React.js e Node.js. Com histórico comprovado de liderança em projetos, incluindo o desenvolvimento de uma modificação em Java para Minecraft e um site voltado para caminhoneiros, demonstro liderança e inovação. Meu compromisso com a excelência é evidente na minha capacidade de otimizar a gestão de projetos, resolver problemas complexos e entregar soluções de alta qualidade que melhoram a experiência do usuário e impulsionam o sucesso organizacional."
        },
        "professional_experience": {
            "title": "Experiência Profissional",
            "entries": [
                {
                    "jobtitle": "Engenheiro de Software Júnior",
                    "where": "Orion180 Insurance",
                    "date": "2024 - Presente"
                },
                {
                    "jobtitle": "Fundador e Desenvolvedor Full Stack",
                    "where": "SupremeMC",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Engenheiro de Software Full Stack",
                    "where": "Accelerate Learning",
                    "date": "2023"
                },
                {
                    "jobtitle": "Desenvolvedor Web Líder (Programa Estudantil)",
                    "where": "Programa GDI da Universidade Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Supervisor de Recepção",
                    "where": "Universidade Clemson",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Habilidades Técnicas",
            "header1": "Linguagens de Programação",
            "header2": "Frameworks e Bibliotecas",
            "header3": "Ferramentas e Tecnologias"
        },
        "services": {
            "title": "Meus Serviços",
            "entries": [
                {
                    "title": "Desenvolvimento Full Stack",
                    "text": "Ofereço soluções completas tanto para front-end quanto para back-end, garantindo integração perfeita e funcionalidade em toda a pilha tecnológica."
                },
                {
                    "title": "Desenvolvimento Web",
                    "text": "Com experiência em HTML, CSS e frameworks JavaScript como React.js, crio sites visualmente atraentes e fáceis de usar, adaptados às necessidades específicas dos clientes."
                },
                {
                    "title": "Desenvolvimento de Jogos",
                    "text": "Utilizando linguagens como Java e C++, sou especializado na criação de experiências de jogo imersivas — do conceito ao design, implementação e otimização, garantindo jogabilidade envolvente e desempenho fluido."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfólio",
        "filter_by": "Filtrar Portfólio por:",
        "entries": {
            "connect_four": {
                "title": "Jogo da Velha (Connect Four)",
                "text": "Grande família com mais de 50 implementações do jogo Connect Four. O projeto inclui versões em mais de 30 linguagens de programação como Java, C++, Python, JavaScript e outras. Também inclui mais de 20 frameworks ou formatos como React.js, Ruby on Rails, ASP.NET e mais.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Projeto de Interoperabilidade",
                "text": "Projeto que documenta a interoperabilidade entre diferentes linguagens de programação. Atualmente contém 15 linguagens e 18 padrões de execução.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "excel_scripts": {
                "title": "Scripts VBA para Microsoft Excel",
                "text": "Uma biblioteca útil de scripts VBA para o Microsoft Excel. Essa biblioteca é usada para automatizar tarefas em planilhas.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "minecraft_json_generator": {
                "title": "Gerador de JSON para Minecraft",
                "text": "Gerador de JSON leve feito em Python para pacotes de dados e recursos do Minecraft. Usado para criar arquivos JSON para mods com itens, blocos e entidades personalizados. Muito útil para datapacks personalizados e para mods com recurso de troca de nome.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Minha Experiência Educacional",
                "text": "Além dos meus projetos pessoais, também adquiri diversas habilidades por meio da educação formal. Clique aqui para ver meu perfil no LinkedIn.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Minha Experiência Profissional",
                "text": "Além dos meus projetos pessoais, também adquiri diversas habilidades por meio de experiências profissionais. Clique aqui para ver meu perfil no LinkedIn.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Site de Portfólio de Patrick Goodwin",
                "text": "Este é o meu site pessoal de portfólio, construído com React.js. Ele serve para mostrar minhas habilidades e projetos, além de fornecer um canal para recrutadores entrarem em contato. É minha presença profissional online.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Biblioteca de Scripts Lua de Patrick",
                "text": "Uma biblioteca útil de scripts em Lua para referência futura. Usada para automatizar tarefas que requerem alta performance, já que Lua geralmente é mais rápida que Python e Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "neovim_config": {
                "title": "Configuração do Neovim de Patrick",
                "text": "Minha configuração pessoal do Neovim, com atalhos personalizados, temas e plugins. Feita para tornar o uso mais eficiente e produtivo.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Gerador de Mapas de Patrick",
                "text": "Gerador de mapas dos condados e estados dos EUA, criado em Python usando Geopandas e Matplotlib. Útil para visualizações e análises de dados geográficos.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Biblioteca PowerShell de Patrick",
                "text": "Uma biblioteca útil de scripts PowerShell para uso futuro. Muito prática com o recurso `$profile`, para automatizar tarefas no terminal do Windows.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Biblioteca Ruby de Patrick",
                "text": "Uma biblioteca útil de scripts Ruby para referência futura. Útil para conceitos futuros de desenvolvimento com Ruby on Rails.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "Gerador de PDF de Habilidades",
                "text": "Um gerador de PDFs personalizado, feito com Python, usando Pdfkit e Jinja2, além de HTML e JSON. Usado para gerar currículos personalizados com habilidades e projetos.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Projeto de Criptografia Rijandel",
                "text": "Família com mais de 10 implementações do algoritmo Rijandel com 128, 192 e 256 bits. Serve para demonstrar o algoritmo em várias linguagens.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Mod Minecraft SupremeMC",
                "text": "Mod para Minecraft que adiciona ferramentas, armaduras, mobs, blocos, dimensões e muitos outros recursos. Compatível com Java 8-17 e Minecraft 1.16 a 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Linguagem de Programação Tiger",
                "text": "Linguagem de programação personalizada feita em Go e Rust para experimentar design de interpretador e desempenho. Integrada no site via WebAssembly.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Site da Tiger Tailgating Pros",
                "text": "Site criado em 2024 para a Tiger Tailgating Pros, empresa de eventos em Clemson, SC. Desenvolvido com React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Projeto Máquina de Turing",
                "text": "Família com mais de 30 implementações da Máquina de Turing. Usado para demonstrar completude de Turing em várias linguagens, inclusive para pesquisa na Tiger Language.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Linguagem de Programação Tiger"
    },
    "contact": {
        "title": "Contato",
        "header": "Informações de Contato",
        "email": "pattygsocials@gmail.com",
        "description": "Respondo a mensagens por email, LinkedIn e Instagram. Também retorno ligações se meu número for compartilhado via currículo ou outro meio, embora eu prefira manter o telefone privado."
    },
    "tiger": {
        "title": "Linguagem Tiger",
        "description": "A linguagem Tiger é uma linguagem personalizada feita em Go e Rust para testar design e desempenho de interpretadores. Está integrada no site de portfólio via WebAssembly. A linguagem Tiger é uma linguagem personalizada feita em Go e Rust para testar design e desempenho de interpretadores. Está integrada no site de portfólio via WebAssembly.",
        "more_info1": "Para mais informações, consulte o README no ",
        "more_info2": "repositório GitHub da Linguagem Tiger.",
        "select_engine": "Selecione o mecanismo:",
        "tiger_code": "Código Tiger:",
        "run_tiger": "Executar Tiger",
        "output": "Saída:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Engenheiro de Software Full Stack com sede na Flórida Central"
    },
    "social_media": {
        "github": "GitHub",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "TikTok",
        "youtube": "YouTube",
        "text_strip": "Siga-me"
    },
    "logotext": "PATRICK"
}