{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Acasă",
        "about": "Despre mine",
        "portfolio": "Portofoliu",
        "projects": "Proiecte de site -uri web",
        "tiger": "Limba tigrului",
        "formatter": "Formatter JSON & YAML",
        "cube_solver": "Rubix Cube Solver",
        "contact": "Contactați -mă"
    },
    "home": {
        "title": "Acasă",
        "animated": {
            "first": "Inginer software cu stivă completă",
            "second": "Dezvoltator web",
            "third": "Dezvoltator de jocuri",
            "fourth": "Creator de conținut"
        },
        "footer": "Site -ul web acum tradus și avalat în peste 100 de limbi!",
        "descriptionA": "Inginer software cu experiență completă și dezvoltator web, cu o istorie demonstrată a proiectelor de dezvoltare cu succes, de la crearea modificărilor Java pentru Minecraft până la îmbunătățirea experienței utilizatorului în React.js și implementarea API-urilor REST sigure, utilizând constant metodologii agile și colaborare eficientă a echipei.",
        "descriptionB": "În plus, sunt un creator de conținut de geografie, care a susținut cu succes algoritmii mai multor platforme de socializare, inclusiv Instagram, YouTube și Tiktok, pentru a obține o bază de urmărire respectabilă și antrenantă.",
        "portfolio_button": "Portofoliul meu",
        "contact_button": "Contactați -mă",
        "about_button": "Despre mine"
    },
    "about": {
        "title": "Despre mine",
        "personal_summary": {
            "title": "Rezumat personal",
            "text": "În calitate de dezvoltator de software cu experiență completă cu sediul în Orlando, FL, am demonstrat expertiză în diverse tehnologii, de la Java și C ++ până la React.js și Node.js. Cu un palmares al proiectelor de lance, inclusiv dezvoltarea unui program de modificare Java pentru Minecraft și un site web plin de satisfacții pentru șoferii de camioane, am prezentat leadership și inovație. Angajamentul meu față de excelență este evident în capacitatea mea de a eficientiza managementul de proiect, de a rezolva probleme complexe și de a oferi soluții de înaltă calitate care îmbunătățesc experiența utilizatorului și determină succesul organizațional."
        },
        "professional_experience": {
            "title": "Experiență profesională",
            "entries": [
                {
                    "jobtitle": "Inginer software junior",
                    "where": "Asigurare Orion180",
                    "date": "2024 - prezent"
                },
                {
                    "jobtitle": "Fondator și dezvoltator de software Full Stack",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Inginer software cu stivă completă",
                    "where": "Accelerează învățarea",
                    "date": "2023"
                },
                {
                    "jobtitle": "Dezvoltator Web Lead (Programul studentului)",
                    "where": "Programul GDI al Universității Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Supraveghetor de birou",
                    "where": "Universitatea Clemson",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Abilități tehnice",
            "header1": "Limbi de programare",
            "header2": "Frame și biblioteci",
            "header3": "Instrumente și tehnologii"
        },
        "services": {
            "title": "Serviciile mele",
            "entries": [
                {
                    "title": "Inginerie completă de stivă",
                    "text": "Ofer soluții cuprinzătoare atât în ​​dezvoltarea front-end, cât și în partea din spate, asigurând integrarea și funcționalitatea perfectă pe întreaga stivă de software."
                },
                {
                    "title": "Dezvoltare web",
                    "text": "Cu expertiză în cadre HTML, CSS și JavaScript precum React.js, I Craft vizual atrăgătoare și site-uri web ușor de utilizat, adaptate pentru a răspunde nevoilor și preferințelor specifice ale clienților."
                },
                {
                    "title": "Dezvoltarea jocului",
                    "text": "Utilizând limbi precum Java și C ++, sunt specializat în crearea de experiențe de joc imersive, de la concept și design la implementare și optimizare, asigurând implicarea jocului și performanțe lină."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portofoliu",
        "filter_by": "Portofoliu de filtrare de:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca JSON",
                "text": "Un proiect Python care eficientizează traducerile de limbă. Permite traducerea portofoliului meu de site -uri web în peste 70 de limbi, inclusiv spaniolă, franceză, chineză, arabă și multe altele. Acest proiect este utilizat pentru a crea un portofoliu de site -uri multilingve, care este foarte util pentru a ajunge la un public mai larg. Cu acest proiect, peste 99% din lume îmi pot citi portofoliul într -un limbaj fluentă.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Conectați patru",
                "text": "Familia masivă de peste 50 de implementări ale jocului Connect Four. Acest proiect include implementări în peste 30 de limbaje de programare diferite, inclusiv Java, C ++, Python, JavaScript și multe altele. În plus, include, de asemenea, peste 20 de cadre diferite sau alte formate, inclusiv React.js, Ruby on Rails, ASP.NET și multe altele.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Proiect interop",
                "text": "Un proiect care documentează interoperabilitatea între diferite limbaje de programare. În prezent, include 15 limbaje de programare diferite și 18 modele de execuție.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "JSON & YAML AUTO Formatter",
                "text": "Un linter și autoformatter pentru fișierele JSON și YAML. Acest proiect este utilizat pentru a formata fișierele JSON și YAML, ceea ce este foarte util pentru menținerea codului curat și organizat. Construit cu GO, compilat cu WebAssembly și încorporat în portofoliul meu ca proiect de site. Mai multe formate care vor veni în viitor.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Generator JSON Minecraft",
                "text": "Generator JSON ușor construit în Python pentru pachete de resurse și date Minecraft. Acest proiect este utilizat pentru a genera fișiere JSON pentru moduri Minecraft, inclusiv articole personalizate, blocuri și entități. Foarte util pentru crearea nu numai a datelor de date personalizate, ci și pentru mod -uri prin intermediul funcției de comutare a numelor Mod.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Experiența mea educațională",
                "text": "Alături de proiectele mele personale, am dobândit numeroase abilități din experiența educațională. Faceți clic aici pentru a vizualiza profilul meu LinkedIn pentru mai multe informații.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Experiența mea profesională",
                "text": "Alături de proiectele mele personale, am dobândit numeroase abilități din experiența profesională. Faceți clic aici pentru a vizualiza profilul meu LinkedIn pentru mai multe informații.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Site -ul portofoliului Patrick Goodwin",
                "text": "Acest site web este site -ul meu de portofoliu personal, construit cu React.js. Acest proiect este utilizat pentru a -mi prezenta abilitățile și proiectele, precum și pentru a oferi o platformă pentru ca potențialii angajatori să mă contacteze. Acest proiect este utilizat pentru a crea o prezență online profesională.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patrick's Lua Script Bibliotecă",
                "text": "O bibliotecă utilă de scripturi Lua pentru referințe viitoare. Această bibliotecă este folosită pentru a automatiza sarcinile în scripturile Lua, care pot fi la îndemână pentru sarcini cu necesitate performantă, deoarece Lua este de obicei un limbaj de script mai rapid decât Python și Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Scripturile de foi de calcul Microsoft Excel Patrick (VBA)",
                "text": "O bibliotecă utilă de scripturi VBA pentru Microsoft Excel. Această bibliotecă este utilizată pentru a automatiza sarcinile în foile de calcul Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Configurarea neovim a lui Patrick",
                "text": "Configurația mea personală neovim. Acest proiect este utilizat pentru a configura Neovim pe placul meu, incluzând legături de cheie personalizate, teme și pluginuri. Acest proiect este utilizat pentru a face Neovim mai ușor de utilizat și mai eficient pentru uz personal.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Generatorul de hartă al lui Patrick",
                "text": "Un generator de hartă a județului și statului din Statele Unite, construit cu Python folosind bibliotecile Geopandas și Matplotlib. Acest proiect este utilizat pentru a genera hărți ale Statelor Unite, inclusiv hărți județene și de stat. Acest proiect este utilizat pentru a crea hărți personalizate pentru vizualizarea și analiza datelor.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Biblioteca de scripturi PowerShell a lui Patrick",
                "text": "O bibliotecă utilă a scripturilor PowerShell pentru referințe viitoare. Util cu funcția de script $ profil, consider că este foarte util pentru automatizarea sarcinilor de la terminalul Windows, deoarece sunt un utilizator frecvent al sistemului de operare Windows.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Biblioteca Ruby Script a lui Patrick",
                "text": "O bibliotecă utilă de scripturi Ruby pentru referințe viitoare. Util pentru viitoarele concepte de dezvoltare Ruby on Rails.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "Constructor de abilități PDF",
                "text": "Un constructor PDF personalizat construit cu Python prin extensiile PDFKIT și Jinja2, alături de formatarea HTML și JSON. Acest proiect este utilizat pentru a genera fișiere PDF dintr -o listă de abilități și proiecte. Acest proiect poate fi utilizat pentru a crea un CV PDF personalizat, care este foarte util pentru aplicațiile de locuri de muncă.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Proiect de criptare Rijandel",
                "text": "O familie de 10+ implementări ale algoritmului de criptare Rijandel în 128, 192 și 256 de biți. Acest proiect este utilizat pentru a demonstra algoritmul de criptare Rijandel în diferite limbaje de programare. Acest proiect este utilizat pentru a crea o familie de implementări ale algoritmului de criptare Rijandel.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "SupremeMC Minecraft Mod",
                "text": "Un mod Minecraft care adaugă instrumente personalizate, armuri, mafii, blocuri, dimensiuni și multe alte caracteristici la joc. Construit cu versiuni Java 8-17 pentru versiuni selectate Minecraft între 1.16 și 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Limbaj de programare tigru",
                "text": "Limbaj de programare personalizat încorporat atât în ​​Go și Rust, pentru a experimenta cu proiectarea și performanța interpretului. Implementat pe site -ul portofoliului folosind asamblare web.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Site -ul Tiger Tailgating Pros",
                "text": "Un site web pe care l -am construit în 2024 pentru Tiger Tailgating Pros, o companie de hayon din Clemson, SC. Construit cu React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Proiectul Turing Machine",
                "text": "Familie de peste 30 de implementări ale mașinii Turing. Folosit pentru a demonstra completitudinea Turing pentru diferite limbaje de programare pentru cercetare, în special pentru limbajul de programare a tigrului.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Limbaj de programare tigru"
    },
    "contact": {
        "title": "Contactați -mă",
        "header": "Informații de contact",
        "email": "Pattygsocials@gmail.com",
        "description": "Răspund la întrebări de la e -mail, mesaje LinkedIn și mesaje Instagram. De asemenea, voi suna înapoi dacă numărul meu este furnizat prin CV sau altfel, deși prefer să -mi păstrez numărul de telefon privat."
    },
    "formatter": {
        "title": "Formatter JSON & YAML",
        "description": "Formatterul JSON & YAML este un instrument care vă permite să formatați fișierele JSON și YAML. Este construit cu GO și WebAssembly și este conceput pentru a fi rapid și eficient. Formatterul este proiectat pentru a fi ușor de utilizat, cu o interfață simplă care vă permite să lipiți în codul JSON sau YAML și să o formatați cu un clic al unui buton.",
        "more_info1": "Pentru mai multe informații, consultați readme -ul din",
        "more_info2": "Depozitul de format JSON/YAML.",
        "format_as": "Format ca:",
        "auto_detect": "Detectare automată",
        "format": "Format"
    },
    "cube_solver": {
        "title": "Rubix Cube Solver",
        "solve": "Rezolva"
    },
    "tiger": {
        "title": "Limba tigrului",
        "description": "Limbajul de programare Tiger este un limbaj de programare personalizat construit atât în ​​Go și Rust, pentru a experimenta cu proiectarea și performanța interpretului. Implementat pe site -ul portofoliului folosind asamblare web. Limbajul de programare Tiger este un limbaj de programare personalizat construit atât în ​​Go și Rust, pentru a experimenta cu proiectarea și performanța interpretului. Implementat pe site -ul portofoliului folosind asamblare web.",
        "more_info1": "Pentru mai multe informații, consultați readme -ul din",
        "more_info2": "Tiger Programming Language Github Depozit.",
        "select_engine": "Selectați motorul:",
        "tiger_code": "Cod tigru:",
        "run_tiger": "Alerga tigru",
        "output": "Ieșire:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Inginer software complet de stivă cu sediul în Florida Centrală"
    },
    "copy": {
        "text": "Copie",
        "copied": "S -A copiat!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Urmați-mă"
    },
    "logotext": "Patrick"
}