{
    "name": "Патрик Гудвин",
    "menu": {
        "home": "Дом",
        "about": "Обо мне",
        "portfolio": "Портфель",
        "tiger": "Тигровый язык",
        "contact": "Свяжитесь со мной"
    },
    "home": {
        "title": "Дом",
        "animated": {
            "first": "Инженер программного обеспечения с полным стеком",
            "second": "Веб -разработчик",
            "third": "Разработчик игры",
            "fourth": "Создатель контента"
        },
        "descriptionA": "Опытный инженер программного обеспечения с полным стеком и веб-разработчик с продемонстрированной историей успешных ведущих проектов разработки, от создания модификаций Java для Minecraft до повышения опыта пользователя в React.js и реализации API безопасных REST, в то же время последовательно используя гибкие методологии и эффективное сотрудничество в команде.",
        "descriptionB": "Кроме того, я создатель географического контента, который успешно использовал алгоритмы нескольких платформ социальных сетей, включая Instagram, YouTube и Tiktok, чтобы получить респектабельную и привлекательную базу последователей.",
        "portfolio_button": "Мое портфолио",
        "contact_button": "Свяжитесь со мной",
        "about_button": "Обо мне"
    },
    "about": {
        "title": "Обо мне",
        "personal_summary": {
            "title": "Личное резюме",
            "text": "Как опытный разработчик программного обеспечения с полным стеком, базирующийся в Орландо, штат Флорида, я продемонстрировал опыт в различных технологиях, от Java и C ++ до React.js и Node.js. Благодаря послужным спискам проектов, включающих в себя разработку программы модификации Java для Minecraft и полезный веб -сайт для водителей грузовиков, я продемонстрировал лидерство и инновации. Моя приверженность совершенству очевидна в моей способности оптимизировать управление проектами, решать сложные проблемы и предоставлять высококачественные решения, которые улучшают пользовательский опыт и способствуют успеху организации."
        },
        "professional_experience": {
            "title": "Профессиональный опыт",
            "entries": [
                {
                    "jobtitle": "Младший инженер программного обеспечения",
                    "where": "Orion180 страховка",
                    "date": "2024 - Присутствует"
                },
                {
                    "jobtitle": "Основатель и разработчик программного обеспечения Full Stack",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Инженер программного обеспечения с полным стеком",
                    "where": "Ускорить обучение",
                    "date": "2023"
                },
                {
                    "jobtitle": "Ведущий веб -разработчик (студенческая программа)",
                    "where": "Клемсонский университет GDI Программа",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Настольный руководитель",
                    "where": "Клемсонский университет",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Технические навыки",
            "header1": "Языки программирования",
            "header2": "Фреймворки и библиотеки",
            "header3": "Инструменты и технологии"
        },
        "services": {
            "title": "Мои услуги",
            "entries": [
                {
                    "title": "Полный стек -инжиниринг",
                    "text": "Я предлагаю всеобъемлющие решения как в фронтальной, так и в направлении развития, обеспечивая бесшовную интеграцию и функциональность во всем программном стеке."
                },
                {
                    "title": "Веб -разработка",
                    "text": "Имея опыт работы в HTML, CSS и JavaScript, таких как React.js, я создаю визуально привлекательные и удобные веб-сайты, адаптированные для удовлетворения конкретных потребностей и предпочтений клиентов."
                },
                {
                    "title": "Разработка игры",
                    "text": "Используя такие языки, как Java и C ++, я специализируюсь на создании иммерсивных игровых впечатлений, от концепции и дизайна до реализации и оптимизации, обеспечивающего привлекательность игрового процесса и плавную производительность."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Портфель",
        "filter_by": "Портфолио фильтров по:",
        "entries": {
            "connect_four": {
                "title": "Подключить четыре",
                "text": "Массовая семья из более чем более 50 реализаций игры Connect Four. Этот проект включает в себя реализации на более чем 30 различных языках программирования, включая Java, C ++, Python, JavaScript и многое другое. Кроме того, он также включает в себя более 20 различных рамок или других форматов, включая React.js, Ruby on Rails, ASP.NET и многое другое.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Interop Project",
                "text": "Проект, который документирует совместимость между различными языками программирования. В настоящее время включает 15 различных языков программирования и 18 шаблонов выполнения.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "excel_scripts": {
                "title": "Scripts Microsoft Excel Scripts (VBA)",
                "text": "Полезная библиотека сценариев VBA для Microsoft Excel. Эта библиотека используется для автоматизации задач в электронных таблицах Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "minecraft_json_generator": {
                "title": "Minecraft Json Generator",
                "text": "Легкий генератор JSON встроенный Python для пакетов ресурсов и данных Minecraft. Этот проект используется для создания файлов JSON для модов Minecraft, включая пользовательские элементы, блоки и объекты. Очень полезен не только для создания пользовательских данных, но и для модов с помощью функции переключения имени мода.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Мой образовательный опыт",
                "text": "Наряду с моими личными проектами, я также приобрел многочисленные навыки из образовательного опыта. Нажмите здесь, чтобы просмотреть мой профиль LinkedIn для получения дополнительной информации.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Мой профессиональный опыт",
                "text": "Наряду с моими личными проектами я также приобрел многочисленные навыки от профессионального опыта. Нажмите здесь, чтобы просмотреть мой профиль LinkedIn для получения дополнительной информации.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Сайт портфеля Patrick Goodwin",
                "text": "Этот веб -сайт - мой личный веб -сайт портфеля, построенный с React.js. Этот проект используется для демонстрации моих навыков и проектов, а также для предоставления платформы для потенциальных работодателей, чтобы связаться со мной. Этот проект используется для создания профессионального присутствия в Интернете.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Библиотека сценариев Патрика Луа",
                "text": "Полезная библиотека сценариев Lua для будущей ссылки. Эта библиотека используется для автоматизации задач в сценариях Lua, которые могут пригодиться для задач, не требующих эффективности, поскольку Lua обычно является более быстрым языком сценариев, чем Python и Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "neovim_config": {
                "title": "Патрик Neovim Config",
                "text": "Моя личная конфигурация NEOVIM. Этот проект используется для настройки NEOVIM по моему мнению, включая пользовательские связывания ключей, темы и плагины. Этот проект используется для того, чтобы сделать Neovim более удобным для пользователя и эффективным для моего личного использования.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Генератор карт Патрика",
                "text": "Генератор карт округа США и штата, построенный из Python с использованием библиотек Geopandas и Matplotlib. Этот проект используется для создания карт Соединенных Штатов, включая карты округа и штата. Этот проект используется для создания пользовательских карт для визуализации и анализа данных.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Библиотека сценариев Patershell's PowerShell",
                "text": "Полезная библиотека сценариев PowerShell для будущей ссылки. Полезно с помощью функции скрипта профиля $, я считаю это очень полезным для автоматизации задач из терминала Windows, поскольку я частый пользователь ОС Windows.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Библиотека сценариев патрика патрика",
                "text": "Полезная библиотека сценариев Ruby для будущей ссылки. Полезно для будущих концепций Ruby on Rails.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF -навыки Строитель",
                "text": "Пользовательский строитель PDF, построенный с Python через расширения PDFKIT и Jinja2, наряду с форматированием HTML и JSON. Этот проект используется для создания файлов PDF из списка навыков и проектов. Этот проект может быть использован для создания пользовательского резюме PDF, которое очень полезно для приложений для работы.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Проект шифрования Rijandel",
                "text": "Семейство из 10+ реализаций алгоритма шифрования Rijandel в 128, 192 и 256 битах. Этот проект используется для демонстрации алгоритма шифрования Rijandel на разных языках программирования. Этот проект используется для создания семейства внедрения алгоритма шифрования Rijandel.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod",
                "text": "Мод Minecraft, который добавляет индивидуальные инструменты, броню, моб, блоки, размеры и многие другие функции в игру. Построенный из версий Java 8-17 для избранных версий Minecraft между 1,16 и 1,20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Язык программирования тигра",
                "text": "Пользовательский язык программирования, встроенный как в Go, так и в Rust, чтобы экспериментировать с дизайном и производительностью интерпретатора. Реализовано на веб -сайте Portfolio с использованием веб -сборки.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Веб -сайт Tiger Tailgaring Pros",
                "text": "Веб -сайт, который я построил в 2024 году для Pros Tiger Tailgaring Pros, компанией с задней дверью в Клемсоне, Южная Каролина. Построен с React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Тьюринговая машина проект",
                "text": "Семья из более чем 30 реализаций машины Тьюринга. Используется для демонстрации полноты Тьюринга для различных языков программирования для исследований, особенно для языка программирования тигра.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Язык программирования тигра"
    },
    "contact": {
        "title": "Свяжитесь со мной",
        "header": "Контактная информация",
        "email": "pattygsocials@gmail.com",
        "description": "Я отвечаю на запросы по электронной почте, сообщениям LinkedIn и сообщениям Instagram. Я также перезвоню, если мой номер будет предоставлен через резюме или иным образом, хотя я предпочитаю сохранить свой номер телефона."
    },
    "tiger": {
        "title": "Тигровый язык",
        "description": "Язык программирования Tiger - это индивидуальный язык программирования, встроенный как в Go, так и Rust, чтобы экспериментировать с дизайном и производительностью интерпретатора. Реализовано на веб -сайте Portfolio с использованием веб -сборки. Язык программирования Tiger - это индивидуальный язык программирования, встроенный как в Go, так и Rust, чтобы экспериментировать с дизайном и производительностью интерпретатора. Реализовано на веб -сайте Portfolio с использованием веб -сборки.",
        "more_info1": "Для получения дополнительной информации обратитесь к Readme в",
        "more_info2": "Репозиторий языка программирования тигра.",
        "select_engine": "Выберите двигатель:",
        "tiger_code": "Код тигра:",
        "run_tiger": "Запустить тигр",
        "output": "Выход:"
    },
    "tab": {
        "title": "Патрик Гудвин",
        "description": "Инженер программного обеспечения с полным стеком, базирующийся в Центральной Флориде"
    },
    "social_media": {
        "github": "GitHub",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Тикток",
        "youtube": "YouTube",
        "text_strip": "Подписывайтесь на меня"
    },
    "logotext": "ПАТРИК"
}