{
    "name": "පැට්රික් ගුඩ්වින්",
    "menu": {
        "home": "මුල් පිටුව",
        "about": "මා ගැන",
        "portfolio": "කළඹ",
        "projects": "වෙබ් අඩවි ව්යාපෘති",
        "tiger": "කොටි භාෂාව",
        "formatter": "JSON සහ YAML ආකෘතිය",
        "cube_solver": "රුබික්ස් කියුබ් විසඳුම්කරු",
        "contact": "මාව සම්බන්ධ කරගන්න"
    },
    "home": {
        "title": "මුල් පිටුව",
        "animated": {
            "first": "සම්පූර්ණ තොග මෘදුකාංග ඉංජිනේරු",
            "second": "වෙබ් සංවර්ධකයා",
            "third": "ක්රීඩා සංවර්ධකයා",
            "fourth": "අන්තර්ගත මැවුම්කරු"
        },
        "footer": "වෙබ් අඩවිය දැන් භාෂා 100+ හි පරිවර්තනය කර ඇත!",
        "descriptionA": "Actived සම්පූර්ණ තොග මෘදුකාංග ඉංජිනේරුවරයා සහ වෙබ් සංවර්ධක, සාර්ථකව ප්රමුඛ පෙළේ සංවර්ධන ව්යාපෘතිවල පෙන්නුම් කළ ඉතිහාසය, ප්රතික්රියා කරන්න.",
        "descriptionB": "ඊට අමතරව, මම භූගෝලීය අන්තර්ගත නිර්මාතෘවරයෙක් වන අතර, ගෞරවනීය හා අනුගාමිකයින්ගේ කඳවුරක් ලබා ගැනීම සඳහා ඉන්ස්ටග්රෑම්, යූ ටියුබ් සහ ටික්ටොක් ඇතුළු බහු සමාජ මාධ්ය වේදිකා අල්ගොයිත්රණයන් සාර්ථකව උත්තේජනය කර ඇත.",
        "portfolio_button": "මගේ කළඹ",
        "contact_button": "මාව සම්බන්ධ කරගන්න",
        "about_button": "මා ගැන"
    },
    "about": {
        "title": "මා ගැන",
        "personal_summary": {
            "title": "පුද්ගලික සාරාංශය",
            "text": "ඕර්ලන්ඩෝ හි පදනම් වූ පළපුරුදු සම්පූර්ණ තොග මෘදුකාංග සංවර්ධකයක් ලෙස, මම ජාවා සහ සී ++ ප්රතික්රියා කිරීමට විවිධ තාක්ෂණයන් පිළිබඳ විශේෂ expert තාව දැක්වා. JSS සහ Node.js.js. චැට් මාත්රාව සහ ට්රක් රථ රියදුරන් සඳහා ත්යාග ප්රදානය කිරීමේ මාර්ගයක් සංවර්ධනය කිරීම ඇතුළුව පෙරමුණේ ව්යාපෘති පිළිබඳ වාර්තාවක් සමඟ, මම නායකත්වය සහ නවෝත්පාදනයන් ප්රදර්ශනය කර ඇත්තෙමි. විශිෂ්ටත්වය සඳහා මගේ කැපවීම පැහැදිලිවම, ව්යාපෘති කළමනාකරණය විධිමත් කිරීමේ හැකියාව, සංකීර්ණ ගැටළු විසඳීම සහ පරිශීලක අත්දැකීම් වැඩි දියුණු කරන සහ ආයතනික සාර්ථකත්වය වැඩි දියුණු කරන උසස් තත්ත්වයේ විසඳුම් ලබා දීම."
        },
        "professional_experience": {
            "title": "වෘත්තීය පළපුරුද්ද",
            "entries": [
                {
                    "jobtitle": "කනිෂ් Society මෘදුකාංග ඉංජිනේරු",
                    "where": "Orion180 රක්ෂණය",
                    "date": "2024 - වර්තමානය"
                },
                {
                    "jobtitle": "නිර්මාතෘ සහ සම්පූර්ණ තොග මෘදුකාංග සංවර්ධක",
                    "where": "උත්තරීතර",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "සම්පූර්ණ තොග මෘදුකාංග ඉංජිනේරු",
                    "where": "ඉගෙනීම වේගවත් කරන්න",
                    "date": "2023"
                },
                {
                    "jobtitle": "ඊයම් වෙබ් සංවර්ධක (ශිෂ්ය වැඩසටහන)",
                    "where": "ක්ලෙම්සන් විශ්ව විද්යාලය GDI වැඩසටහන",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "මේස අධීක්ෂක",
                    "where": "ක්ලෙම්සන් විශ්ව විද්යාලය",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "තාක්ෂණික කුසලතා",
            "header1": "ක්රමලේඛන භාෂා",
            "header2": "රාමු සහ පුස්තකාල",
            "header3": "මෙවලම් සහ තාක්ෂණයන්"
        },
        "services": {
            "title": "මගේ සේවා",
            "entries": [
                {
                    "title": "සම්පූර්ණ තොග ඉංජිනේරු",
                    "text": "මුළු මෘදුකාංග තොගය පුරාම බාධාවකින් තොරව ඒකාබද්ධ කිරීම හා ක්රියාකාරීත්වය සහතික කරමින් පෙරමුණේ සහ පසුපස සංවර්ධනය යන දෙකම හරහා මම සවිස්තරාත්මක විසඳුම් ලබා දෙන්නෙමි."
                },
                {
                    "title": "වෙබ් සංවර්ධනය",
                    "text": "ප්රතික්රියා කරන්න වැනි HTML, CSS සහ ජාවාස්ක්රිප්ට් රාමු වල විශේෂ ise තාව සමඟ සේවාදායකයින්ගේ විශේෂිත අවශ්යතා සහ මනාපයන් හමුවීමට ගැලපෙන පරිදි දෘශ්යමය වශයෙන් ආකර්ෂණීය හා පරිශීලක-හිතකාමී වෙබ් අඩවි."
                },
                {
                    "title": "ක්රීඩා සංවර්ධනය",
                    "text": "ජාවා සහ සී ++ වැනි උත්තේජක භාෂා, සංකල්පයේ සිට ක්රියාත්මක කිරීම සහ ප්රශස්තිකරණය කිරීම, ක්රියාත්මක කිරීම සහ ප්රශස්තිකරණය කිරීම, ක්රියාත්මක කිරීම සහ ප්රශස්තිකරණය කිරීම, ක්රියාත්මක කිරීම සහ ප්රශස්තිකරණය කිරීම, ක්රියාත්මක කිරීම සහ ප්රශස්තිකරණයන් වැනි භාෂා පිළිබඳ උත්තේජක විශේෂ ize ය."
                }
            ]
        }
    },
    "portfolio": {
        "title": "කළඹ",
        "filter_by": "පෙරහන් කළඹෙන්:",
        "entries": {
            "biblioteca": {
                "title": "බිබ්ලියෝටෙකා ජසන්ොන්",
                "text": "භාෂා පරිවර්තන විධිමත් කරන පයිතන් ව්යාපෘතියක්. ස්පා Spanish ් ,, ප්රංශ, චීන, අරාබි සහ තවත් බොහෝ අය ඇතුළුව මගේ වෙබ් අඩවි කළඹ භාෂා 70+ කට පරිවර්තනය කිරීමට ඉඩ සලසයි. බහුභාෂා වෙබ් අඩවි කළඹක් නිර්මාණය කිරීම සඳහා මෙම ව්යාපෘතිය භාවිතා කරයි, එය පුළුල් ප්රේක්ෂක පිරිසකට ළඟා වීමට ඉතා ප්රයෝජනවත් වේ. මෙම ව්යාපෘතිය සමඟ, ලෝකයෙන් 99% කට වඩා වැඩි ප්රමාණයක් චතුර භාෂාවකින් මගේ කළඹ කියවිය හැකිය.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "හතරක් සම්බන්ධ කරන්න",
                "text": "50+ කට අධික පිරිසකගේ දැවැන්ත පවුලක් සම්බන්ධක තරගය ක්රියාත්මක කිරීම. මෙම ව්යාපෘතියට ජාවා, සී ++, පයිතන්, ජාවාස්ක්රිප්ට් සහ තවත් බොහෝ ක්රමලේඛන භාෂා 30 කට අධික සංඛ්යාවක ක්රියාත්මක කිරීම් ඇතුළත් වේ. මීට අමතරව, ප්රතික්රියා කරන්න. ජේඑස්එස්, රූබි, ASP.NET සහ තවත් බොහෝ දේ ඇතුළුව විවිධ රාමු හෝ වෙනත් ආකෘති 20+ කට අධික ප්රමාණයක් ද ඇතුළත් වේ.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "අන්තර් අපද්රව්ය ව්යාපෘතිය",
                "text": "විවිධ ක්රමලේඛන භාෂා අතර අන්තර් ක්රියාකාරීත්වය ලේඛනගත කරන ව්යාපෘතියක්. දැනට විවිධ ක්රමලේඛන භාෂා 15 ක් සහ ක්රියාත්මක කිරීමේ රටාවන් 18 ක් ඇතුළත් වේ.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "JSON & YAML AUTOSDERDER",
                "text": "JSON සහ YAML ගොනු සඳහා ලින්ටර් සහ ඔටෝෆෝටරයක්. මෙම ව්යාපෘතිය JSON සහ YAML ගොනු සංයුති කිරීම සඳහා යොදා ගන්නා අතර එය කේත පිරිසිදුව තබාගෙන සංවිධානාත්මකව තබා ගැනීම සඳහා ඉතා ප්රයෝජනවත් වේ. වෙබ් අඩවි ව්යාපෘතියක් ලෙස වෙබ්ස්සම්බි සමඟ සම්පාදනය කර ඇති අතර, වෙබ්ස්මය සමඟ සම්පාදනය කර මගේ කළඹට කාවැදී ඇත. අනාගතයේදී තවත් ආකෘති පැමිණේ.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON උත්පාදක යන්ත්රය",
                "text": "මයික්රැෆ්ට් සම්පත් හා දත්ත ඇසුරුම් සඳහා පයිතන් හි සැහැල්ලු ජෛන උත්පාදක යන්ත්රය. අභිරුචි භාණ්ඩ, කුට්ටි සහ ආයතන ඇතුළුව Minecraft MODS සඳහා JSON ගොනු ජනනය කිරීම සඳහා මෙම ව්යාපෘතිය භාවිතා කරයි. අභිරුචි ඩේටා කපැනි ලෙස පමණක් නිර්මාණය කිරීම පමණක් නොව, MOD නාම මාරු කිරීමේ විශේෂාංගය හරහා මෝඩ්ස් සඳහා ද ප්රයෝජනවත් වේ.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "මගේ අධ්යාපන අත්දැකීම",
                "text": "මගේ පෞද්ගලික ව්යාපෘති සමඟ, මම අධ්යාපන අත්දැකීම් වලින් නිපුණතා රාශියක් අත්පත් කර ගෙන ඇත්තෙමි. වැඩි විස්තර සඳහා මගේ LinkedIn පැතිකඩ බැලීමට මෙතන ක්ලික් කරන්න.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "මගේ වෘත්තීය පළපුරුද්ද",
                "text": "මගේ පෞද්ගලික ව්යාපෘති සමඟ, වෘත්තීය පළපුරුද්දෙන් මම කුසලතා රාශියක් අත්පත් කර ගෙන ඇත්තෙමි. වැඩි විස්තර සඳහා මගේ LinkedIn පැතිකඩ බැලීමට මෙතන ක්ලික් කරන්න.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "පැට්රික් ගුඩ්වින් කළඹ වෙබ් අඩවිය",
                "text": "මෙම වෙබ් අඩවිය මගේ පුද්ගලික කළඹේ වෙබ් අඩවිය වන අතර එය ප්රතික්රියා කරන්න. මගේ කුසලතා හා ව්යාපෘති ප්රදර්ශනය කිරීමට මෙන්ම අනාගත සේවා යෝජකයින්ට මා සම්බන්ධ කර ගැනීමට වේදිකාවක් සැපයීම සඳහා මෙම ව්යාපෘතිය භාවිතා කරයි. මෙම ව්යාපෘතිය වෘත්තීය ඔන්ලයින් පැවැත්මක් නිර්මාණය කිරීම සඳහා යොදා ගනී.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "පැට්රික්ගේ ලුක් ස්ක්රිප්ට් පුස්තකාලය",
                "text": "අනාගත යොමු කිරීම සඳහා LUA ස්ක්රිප්ට් වල ප්රයෝජනවත් පුස්තකාලයක්. මෙම පුස්තකාලයේ Lua ස්ක්රිප්ට් වල කාර්යයන් ස්වයංක්රීය කිරීම සඳහා භාවිතා කරන අතර, ප්රේමයේ අවශ්යතා-අවශ්යතා සඳහා කාර්යයන් සඳහා ප්රයෝජනවත් වේ.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "පැට්රික්ගේ මයික්රොසොෆ්ට් එක්සෙල් පැතුරුම්පත් ස්ක්රිප්ට් (VBA)",
                "text": "මයික්රොසොෆ්ට් එක්සෙල් සඳහා VBA ස්ක්රිප්ට් වල ප්රයෝජනවත් පුස්තකාලයක්. එක්සෙල් පැතුරුම්පත් වල කාර්යයන් ස්වයංක්රීය කිරීම සඳහා මෙම පුස්තකාලය භාවිතා කරයි.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "පැට්රික්ගේ නියෝවීම් වින්යාසය",
                "text": "මගේ පුද්ගලික නියෝවීම් වින්යාසය. අභිරුචි යතුරුපුවරු, තේමාවන් සහ ප්ලගීන ඇතුළු මගේ රුචිකත්වයට අනුව නියෝවීම් වින්යාස කිරීමට මෙම ව්යාපෘතිය භාවිතා කරයි. මගේ පුද්ගලික භාවිතය සඳහා නියෝවීම් වඩාත් පරිශීලක-හිතකාමී හා කාර්යක්ෂම කිරීමට මෙම ව්යාපෘතිය භාවිතා කරයි.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "පැට්රික්ගේ සිතියම් උත්පාදක යන්ත්රය",
                "text": "ජෝපාන්ඩාස් සහ මැට්ල්පොලිබ් පුස්තකාල භාවිතා කරමින් පයිතන් සමඟ ඉදිකරන ලද එක්සත් ජනපද ප්රාන්ත සහ රාජ්ය සිතියම් උත්පාදක යන්ත්රයකි. මෙම ව්යාපෘතිය කවුන්ටි සහ රාජ්ය සිතියම් ඇතුළු එක්සත් ජනපදයේ සිතියම් ජනනය කිරීම සඳහා යොදා ගනී. දත්ත දෘශ්යකරණය සහ විශ්ලේෂණය සඳහා අභිරුචි සිතියම් නිර්මාණය කිරීම සඳහා මෙම ව්යාපෘතිය භාවිතා කරයි.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "පැට්රික්ගේ ෆෝම්බල් ස්ක්රිප්ට් පුස්තකාලය",
                "text": "අනාගත යොමු කිරීම සඳහා ෆෝචෙල් ස්ක්රිප්ට් වල ප්රයෝජනවත් පුස්තකාලයක්. $ පැතිකඩ ස්ක්රිප්ට් විශේෂාංගය සමඟ ප්රයෝජනවත් වන විට, වින්ඩෝස් ඕඑස් හි නිතර පරිශීලකයෙකු වන බැවින් වින්ඩෝස් පර්යන්තයේ කාර්යයන් ස්වයංක්රීය කාර්යයන් සඳහා මෙය මට ප්රයෝජනවත් වේ.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "පැට්රික්ගේ රූබි ස්ක්රිප්ට් පුස්තකාලය",
                "text": "අනාගත යොමු කිරීම සඳහා රූබි ස්ක්රිප්ට් වල ප්රයෝජනවත් පුස්තකාලයකි. වැටලීම් සංකල්ප මත අනාගත රූබි සඳහා ප්රයෝජනවත් වේ.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF නිපුණතා සාදන්නා",
                "text": "පීඩීඑෆ්කේඅයිට් සහ ජින්ජා 2 දිගු, එච්.ටී.එම්.එල්. කුසලතා හා ව්යාපෘති ලැයිස්තුවකින් PDF ගොනු ජනනය කිරීම සඳහා මෙම ව්යාපෘතිය භාවිතා කරයි. අභිරුචි PDF නැවත ආරම්භ කිරීම සඳහා මෙම ව්යාපෘතිය භාවිතා කළ හැකි අතර එය රැකියා අයදුම්පත් සඳහා ඉතා ප්රයෝජනවත් වේ.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "රිජන්ඩල් ගුප්තකේතන ව්යාපෘතිය",
                "text": "128, 192 සහ බිටු 256 ක් සහ බිටු 256 ක් වන රිජන්ඩෙල් සංකේතාංකන ඇල්ගොරිතම 10+ ක පවුලකි. විවිධ ක්රමලේඛන භාෂාවල රිජන්ඩල් සංකේතාංකන ඇල්ගොරිතම නිරූපණය කිරීම සඳහා මෙම ව්යාපෘතිය භාවිතා කරයි. මෙම ව්යාපෘතිය රිජන්ඩල් සංකේතාංකය ඇල්ගොරිතම ක්රියාත්මක කිරීමේ පවුලක් නිර්මාණය කිරීම සඳහා යොදා ගනී.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "උත්තරීම් මීනීෆ්ට් මොඩ්",
                "text": "අභිරුචි මෙවලම්, සන්නාහ, මැරයන්, කුට්ටි, මානයන් සහ තවත් බොහෝ විශේෂාංග එක් කරන Minecraft MOTHION A BHINE. 1.16 සහ 1.20 අතර Minecraft අනුවාදයන් තෝරා ගැනීම සඳහා 8-17 ජාවා අනුවාදයන් සමඟ ඉදිකර ඇත.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "කොටි ක්රමලේඛන භාෂාව",
                "text": "දෙකෙහිම සාදන ලද අභිරුචි ක්රමලේඛන භාෂාව ගෙන්වා, අන්තර් ආකෘතිය හා ක්රියාකාරිත්වය සමඟ අත්හදා බැලීම. වෙබ් එක්රැස්වීම භාවිතා කරමින් කළඹ වෙබ් අඩවිය පිළිබඳ ක්රියාත්මක කරන ලදි.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "ටයිගර් වලිගයේ වාසි වෙබ් අඩවිය",
                "text": "2024 දී කොටින්ගේ ටේල්ගේට් වාසි සඳහා වූ 2024 දී මා විසින් සාදන ලද වෙබ් අඩවියක් වන එස්.සී. හි ක්ලෙම්සන්හි වලිගය කැටයම් කර ඇත. ප්රතික්රියා කරන්න.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "ටියුරින් මැෂින් ව්යාපෘතිය",
                "text": "30+ කට අධික පවුලක පවුල කාලානුරූපී යන්ත්රය ක්රියාත්මක කිරීම. පර්යේෂණ සඳහා විවිධ ක්රමලේඛන භාෂා සඳහා ටීම් සම්පූර්ණත්වය නිරූපණය කිරීම සඳහා, විශේෂයෙන් කොටි ක්රමලේඛන භාෂාව සඳහා.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "කොටි ක්රමලේඛන භාෂාව"
    },
    "contact": {
        "title": "මාව සම්බන්ධ කරගන්න",
        "header": "සබඳතා තොරතුරු",
        "email": "pattygsocirs@gmail.com",
        "description": "ඊමේල්, LinkedIn පණිවිඩ සහ Instagram පණිවිඩගෙන් විමසීම් වලට මම ප්රතිචාර දක්මි. මගේ දුරකථන අංකය පුද්ගලිකව තබා ගැනීමට මම කැමති වුවද, මගේ අංකය නැවත ආරම්භ කිරීම හෝ වෙනත් ආකාරයකින් ලබා දෙන්නේ නම් මම නැවත අමතන්නෙමි."
    },
    "formatter": {
        "title": "JSON සහ YAML ආකෘතිය",
        "description": "JSON සහ YAML ආකෘතිය යනු ඔබට JSON සහ YAML ගොනු සංයුති කිරීමට ඉඩ සලසන මෙවලමකි. එය ගිහියෙන් හා වෙබ්ස්ජීව සමඟ ගොඩනගා ඇති අතර එය සැලසුම් කර ඇත්තේ වේගවත් හා කාර්යක්ෂම වීමට ය. ආකෘතිය සැලසුම් කිරීම පහසුය, එමඟින් සරල අතුරු මුහුණතක්, ඔබේ JSON හෝ YAML කේතයේ ඇලවීමට ඉඩ සලසන සහ බොත්තමක් ක්ලික් කිරීමකින් එය සංයුති කරන්න.",
        "more_info1": "වැඩි විස්තර සඳහා, මාර්ගෝපදේශය වෙත යොමු වන්න",
        "more_info2": "JSON / YAML Forder Reporical.",
        "format_as": "ආකෘතිය:",
        "auto_detect": "ස්වයංක්රීය හඳුනාගැනීම",
        "format": "ආකෘතිය"
    },
    "cube_solver": {
        "title": "රුබික්ස් කියුබ් විසඳුම්කරු",
        "solve": "විසඳන්න"
    },
    "tiger": {
        "title": "කොටි භාෂාව",
        "description": "කොටි ක්රමලේඛන භාෂාව යනු ගිහින් සාදන ලද අභිරුචි ක්රමලේඛන භාෂාවකි. වෙබ් එක්රැස්වීම භාවිතා කරමින් කළඹ වෙබ් අඩවිය පිළිබඳ ක්රියාත්මක කරන ලදි. කොටි ක්රමලේඛන භාෂාව යනු ගිහින් සාදන ලද අභිරුචි ක්රමලේඛන භාෂාවකි. වෙබ් එක්රැස්වීම භාවිතා කරමින් කළඹ වෙබ් අඩවිය පිළිබඳ ක්රියාත්මක කරන ලදි.",
        "more_info1": "වැඩි විස්තර සඳහා, මාර්ගෝපදේශය වෙත යොමු වන්න",
        "more_info2": "කොටි ක්රමලේඛන භාෂාව GitHub නිධිය.",
        "select_engine": "එන්ජිම තෝරන්න:",
        "tiger_code": "කොටි කේතය:",
        "run_tiger": "කොටියා ධාවනය කරන්න",
        "output": "ප්රතිදානය:"
    },
    "tab": {
        "title": "පැට්රික් ගුඩ්වින්",
        "description": "මධ්යම ෆ්ලොරිඩාවේ පදනම් වූ සම්පූර්ණ තොග මෘදුකාංග ඉංජිනේරු"
    },
    "copy": {
        "text": "පිටපත",
        "copied": "පිටපත් කළා!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "ටික්ටොක්",
        "youtube": "යූ ටියුබ්",
        "text_strip": "මාව අනුගමනය කරන්න"
    },
    "logotext": "පැට්රික්"
}