{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Doma",
        "about": "O meni",
        "portfolio": "Portfelj",
        "projects": "Projekti spletnih strani",
        "tiger": "Jezik tigra",
        "formatter": "JSON & YAML FORMATTER",
        "cube_solver": "RUBIX CUBE SOLVER",
        "contact": "Kontaktirajte me"
    },
    "home": {
        "title": "Doma",
        "animated": {
            "first": "Inženir programske opreme za celoten sklad",
            "second": "Spletni razvijalec",
            "third": "Razvijalec iger",
            "fourth": "Ustvarjalec vsebine"
        },
        "footer": "Spletno mesto je zdaj prevedeno in na voljo v 100+ jezikih!",
        "descriptionA": "Izkušeni inženir programske opreme in spletnega razvijalca s polnim stanjem z dokazano zgodovino uspešno vodilnih razvojnih projektov, od ustvarjanja sprememb Java za Minecraft do izboljšanja uporabniške izkušnje v React.js in izvajanju varnih API-jev REST, hkrati pa dosledno uporablja agile metodologije in učinkovito skupinsko sodelovanje.",
        "descriptionB": "Poleg tega sem ustvarjalec vsebine geografije, ki je uspešno izkoristil algoritme več platform za družbene medije, vključno z Instagramom, YouTubom in Tiktokom, da bi pridobil ugledno in privlačno bazo sledilcev.",
        "portfolio_button": "Moj portfelj",
        "contact_button": "Kontaktirajte me",
        "about_button": "O meni"
    },
    "about": {
        "title": "O meni",
        "personal_summary": {
            "title": "Osebni povzetek",
            "text": "Kot izkušeni razvijalec programske opreme s polnim skladom s sedežem v Orlandu, FL, sem pokazal strokovno znanje v različnih tehnologijah, od Java in C ++ do React.js in Node.js. S uspešnostjo projektov voditeljev, vključno z razvojem programa spreminjanja Java za Minecraft in nagrajevalnim spletnim mestom za voznike tovornjakov, sem predstavil vodstvo in inovacije. Moja zavezanost odličnosti je očitna v moji sposobnosti racionalizacije upravljanja projektov, reševanja zapletenih težav in zagotavljanja kakovostnih rešitev, ki izboljšujejo uporabniško izkušnjo in spodbujajo organizacijski uspeh."
        },
        "professional_experience": {
            "title": "Strokovna izkušnja",
            "entries": [
                {
                    "jobtitle": "Mlajši inženir programske opreme",
                    "where": "Orion180 zavarovanje",
                    "date": "2024 - prisotno"
                },
                {
                    "jobtitle": "Ustanovitelj in razvijalec programske opreme Full Stack",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Inženir programske opreme za celoten sklad",
                    "where": "Pospešiti učenje",
                    "date": "2023"
                },
                {
                    "jobtitle": "Vodilni spletni razvijalec (študentski program)",
                    "where": "Clemson University GDI program",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Nadzornik mize",
                    "where": "Univerza Clemson",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Tehnične spretnosti",
            "header1": "Programski jeziki",
            "header2": "Okviri in knjižnice",
            "header3": "Orodja in tehnologije"
        },
        "services": {
            "title": "Moje storitve",
            "entries": [
                {
                    "title": "Celoten inženiring",
                    "text": "Ponujam celovite rešitve v razvoju spredaj in zadaj, ki zagotavljajo brezhibno integracijo in funkcionalnost v celotnem skladu programske opreme."
                },
                {
                    "title": "Spletni razvoj",
                    "text": "S strokovnim znanjem v okvirih HTML, CSS in JavaScript, kot je React.js, izdelam vizualno privlačna in uporabniku prijazna spletna mesta, prilagojena posebnim potrebam in željam strank."
                },
                {
                    "title": "Razvoj iger",
                    "text": "S pomočjo jezikov, kot sta Java in C ++, sem specializiran za ustvarjanje potopnih igralnih izkušenj, od koncepta in oblikovanja do izvajanja in optimizacije ter zagotavljanje vključevanja igranja in nemotenih zmogljivosti."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfelj",
        "filter_by": "Portfelj filtriranja z:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca JSON",
                "text": "Python projekt, ki poenostavi jezikovne prevode. Omogoča, da se portfelj mojega spletnega mesta prevede v 70+ jezikov, vključno s španščino, francoščino, kitajščino, arabščino in številnimi drugimi. Ta projekt se uporablja za ustvarjanje večjezičnega portfelja spletnih strani, ki je zelo koristen za doseganje širšega občinstva. S tem projektom lahko več kot 99% sveta prebere moj portfelj v tekočem jeziku.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Povezati štiri",
                "text": "Množična družina več kot 50+ izvedb igre Connect Four. Ta projekt vključuje izvedbe v več kot 30 različnih programskih jezikih, vključno z Java, C ++, Python, JavaScript in še več. Poleg tega vključuje tudi več kot 20+ različnih okvirov ali drugih formatov, vključno z React.js, Ruby On Rails, ASP.NET in še več.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Projekt Interop",
                "text": "Projekt, ki dokumentira interoperabilnost med različnimi programskimi jeziki. Trenutno vključuje 15 različnih programskih jezikov in 18 vzorcev izvedbe.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "JSON & YAML AUTO FORMATTER",
                "text": "Linter & Autoformatter za datoteke JSON & YAML. Ta projekt se uporablja za oblikovanje datotek JSON & YAML, kar je zelo koristno za ohranjanje čiste in organizirane kode. Zgrajena z GO, sestavljena z WebAssembly in vgrajena v moj portfelj kot projekt spletnega mesta. V prihodnosti bo prišlo več formatov.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON generator",
                "text": "Lahek JSON Generator je vgrajen v Python za Minecraft Resource Resource & Data Packs. Ta projekt se uporablja za ustvarjanje datotek JSON za mode Minecraft, vključno z elementi po meri, bloki in subjekti. Zelo koristno za ne samo ustvarjanje podatkovnih podatkov po meri, ampak tudi za mode prek funkcije preklopa mode.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Moje izobraževalne izkušnje",
                "text": "Poleg osebnih projektov sem pridobil tudi številne veščine iz izobraževalnih izkušenj. Kliknite tukaj, če si želite ogledati moj profil LinkedIn za več informacij.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Moje poklicne izkušnje",
                "text": "Poleg osebnih projektov sem pridobil tudi številne spretnosti iz profesionalnih izkušenj. Kliknite tukaj, če si želite ogledati moj profil LinkedIn za več informacij.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Spletna stran portfelja Patrick Goodwin",
                "text": "To spletno mesto je moje osebno spletno mesto portfelja, zgrajeno z React.js. Ta projekt se uporablja za prikaz mojih spretnosti in projektov, pa tudi za zagotavljanje platforme za potencialne delodajalce, ki me kontaktirajo. Ta projekt se uporablja za ustvarjanje profesionalne spletne prisotnosti.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patrickova knjižnica scenarijev Lua",
                "text": "Uporabna knjižnica skript Lua za prihodnjo referenco. Ta knjižnica se uporablja za avtomatizacijo nalog v skriptih Lua, ki so lahko koristne za naloge, ki jih je mogoče izvesti, saj je Lua ponavadi hitrejši skriptni jezik kot Python in Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrick's Microsoft Excel Screadheet Scripts (VBA)",
                "text": "Uporabna knjižnica skript VBA za Microsoft Excel. Ta knjižnica se uporablja za avtomatizacijo nalog v Excelovih preglednicah.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Patrick's Neovim Config",
                "text": "Moja osebna konfiguracija Neovima. Ta projekt se uporablja za konfiguriranje Neovima po mojih željah, vključno s ključmi, temami in vtičniki po meri. Ta projekt se uporablja za to, da je Neovim bolj uporabniku prijazen in učinkovit za mojo osebno uporabo.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patrickov generator zemljevidov",
                "text": "Generator okrožij in državnih zemljevidov Združenih držav Amerike, zgrajen s Pythonom z uporabo knjižnic Geopandas in Matplotlib. Ta projekt se uporablja za ustvarjanje zemljevidov Združenih držav Amerike, vključno z okrožnimi in državnimi zemljevidi. Ta projekt se uporablja za ustvarjanje zemljevidov po meri za vizualizacijo in analizo podatkov.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patrick's PowerShell Script Library",
                "text": "Uporabna knjižnica scenarijev PowerShell za prihodnje reference. Koristno s funkcijo skripta $ profila se mi zdi to neizmerno koristno za avtomatizacijo nalog iz terminala Windows, saj sem pogost uporabnik sistema Windows OS.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patrickova knjižnica scenarijev Ruby",
                "text": "Uporabna knjižnica scenarijev Ruby za nadaljnjo referenco. Uporabno za prihodnje Ruby on Rails Development Concepts.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF Graditelj spretnosti",
                "text": "Po meri PDF graditelj, zgrajen s Pythonom, prek razširitve PDFKIT in Jinja2, poleg oblikovanja HTML in JSON. Ta projekt se uporablja za ustvarjanje datotek PDF s seznama spretnosti in projektov. Ta projekt lahko uporabite za ustvarjanje življenjepisa PDF po meri, ki je zelo koristen za aplikacije za zaposlitev.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Projekt šifriranja Rijandel",
                "text": "Družina 10+ izvedb algoritma za šifriranje Rijandel v 128, 192 in 256 bitov. Ta projekt se uporablja za prikaz algoritma za šifriranje Rijandel v različnih programskih jezikih. Ta projekt se uporablja za ustvarjanje družine izvajanja algoritma za šifriranje Rijandel.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod",
                "text": "Mod Minecraft, ki v igro doda orodja po meri, oklep, mafije, bloke, dimenzije in številne druge funkcije. Zgrajena z različicami Java 8-17 za izbrane različice Minecraft med 1.16 in 1,20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tiger programski jezik",
                "text": "Jezik programiranja po meri, vgrajen tako v Go & Rust, da bi eksperimentiral z oblikovanjem in zmogljivostjo tolmača. Izvedeno na spletnem mestu Portfelio s pomočjo spletne montaže.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Spletno mesto Pros Tiger Tailgating",
                "text": "Spletno mesto, ki sem ga zgradil leta 2024 za Tiger Tailgating Pros, podjetje za zatiranje v Clemsonu, SC. Zgrajena z react.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Projekt Turing Machine",
                "text": "Družina več kot 30+ izvedb Turingovega stroja. Uporablja se za prikaz Turingovega popotovanja za različne programske jezike za raziskave, zlasti za programski program Tiger.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tiger programski jezik"
    },
    "contact": {
        "title": "Kontaktirajte me",
        "header": "Kontaktni podatki",
        "email": "pattygsocials@gmail.com",
        "description": "Odzivam na poizvedbe iz e -pošte, sporočil LinkedIn in Instagram sporočil. Poklical bom tudi nazaj, če je moja številka na voljo prek življenjepisa ali kako drugače, čeprav raje ohranjam svojo telefonsko številko zasebno."
    },
    "formatter": {
        "title": "JSON & YAML FORMATTER",
        "description": "Oblika JSON & YAML je orodje, ki omogoča oblikovanje datotek JSON in YAML. Zgrajena je z GO in WebAsSembly, zasnovana pa je tako, da je hitra in učinkovita. Formatter je zasnovan tako, da je enostaven za uporabo, s preprostim vmesnikom, ki omogoča prilepanje v svojo kodo JSON ali YAML in ga oblikuje s klikom na gumb.",
        "more_info1": "Če želite več informacij, glejte readme v",
        "more_info2": "JSON/YAML FORMATTER ROPLATILO.",
        "format_as": "Format kot:",
        "auto_detect": "Samodejno zaznavanje",
        "format": "Format"
    },
    "cube_solver": {
        "title": "RUBIX CUBE SOLVER",
        "solve": "Rešiti"
    },
    "tiger": {
        "title": "Jezik tigra",
        "description": "Tiger programski jezik je programski jezik po meri, vgrajen tako v Go & Rust, da bi eksperimentiral z oblikovanjem in zmogljivostjo tolmača. Izvedeno na spletnem mestu Portfelio s pomočjo spletne montaže. Tiger programski jezik je programski jezik po meri, vgrajen tako v Go & Rust, da bi eksperimentiral z oblikovanjem in zmogljivostjo tolmača. Izvedeno na spletnem mestu Portfelio s pomočjo spletne montaže.",
        "more_info1": "Če želite več informacij, glejte readme v",
        "more_info2": "Tiger programski jezik GitHub Repository.",
        "select_engine": "Izberite motor:",
        "tiger_code": "Tiger koda:",
        "run_tiger": "Run Tiger",
        "output": "Izhod:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Celoten programski inženir s sedežem v osrednji Floridi"
    },
    "copy": {
        "text": "Kopijo",
        "copied": "Kopirano!"
    },
    "social_media": {
        "github": "GitHub",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Sledite mi"
    },
    "logotext": "Patrick"
}