{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Aiga",
        "about": "Faatatau ia a'u",
        "portfolio": "Portfolio",
        "tiger": "TIGER Gagana",
        "contact": "Faʻafesoʻotaʻi mai aʻu"
    },
    "home": {
        "title": "Aiga",
        "animated": {
            "first": "Atoa Polokalama Polokalama Engineer",
            "second": "Upega Tafaʻilagi",
            "third": "Taaloga Tagata Auai",
            "fourth": "Mea e maua"
        },
        "descriptionA": "Aafiaga atoa-Stack Polokalama Engineer ma le Upega Tafaʻilagi ma se Talaʻaga o Aʻoaʻoga Faʻamaoniga, mai le fausiaina o le Juvad Seambogies.",
        "descriptionB": "Additionally, I am a geography content creator who has successfully leveraged the algorithms of multiple social media platforms, including Instagram, YouTube, and TikTok, to gain a respectable and engaging follower base.",
        "portfolio_button": "O loʻu ata",
        "contact_button": "Faʻafesoʻotaʻi mai aʻu",
        "about_button": "Faatatau ia a'u"
    },
    "about": {
        "title": "Faatatau ia a'u",
        "personal_summary": {
            "title": "Aotelega Faatasi",
            "text": "A o le poto masani na matua faʻatulagaina polokalame o tagata atiaʻeina i Andlando, FL, na ou faʻaalia tomai i le tele o tekinolosi, mai ia Java ma le BED.JS. Faatasi ai ma se faʻasologa o galuega faʻaseʻe, e aofia ai le atinaʻeina o le Java Forwasication Program mo se upega tafailagi ma se upega tafailagi mo loli avetaavale, o aʻu o le au taʻavale ma fou. O laʻu tautinoga i le lelei tele, e iloa i loʻu mafai ona maua ai ni faʻafitauli o le poloketi, ia maua ai le manuia o le tagata faʻaaogaina."
        },
        "professional_experience": {
            "title": "Aafiaga Faapolofesa",
            "entries": [
                {
                    "jobtitle": "Tausaga a tamaiti vaalele",
                    "where": "Orion180 inisiua",
                    "date": "2024 - TAIMI"
                },
                {
                    "jobtitle": "O loʻo faʻavaeina ma le atoatoa",
                    "where": "Sili atu le maualuga",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Atoa Polokalama Polokalama Engineer",
                    "where": "Faatelevave le aoaoina",
                    "date": "2023"
                },
                {
                    "jobtitle": "Taʻitaʻi Upega Tafaʻilagi (polokalame a tamaiti aʻoga)",
                    "where": "Clemson University GDI polokalame",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Desk supavaisa",
                    "where": "Clemson University",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Tomai Faʻapitoa",
            "header1": "Laupepa gagana",
            "header2": "Faʻavaʻa & faletusi",
            "header3": "Meafaigaluega & tekinolosi"
        },
        "services": {
            "title": "Laʻu Auaunaga",
            "entries": [
                {
                    "title": "Tumu i inisinia inisinia",
                    "text": "Ou te ofoina atu ni faʻamatalaga lelei i luga o le lua o le pito i luma ma tua-pito i tua atinaʻe, faʻamautinoaina le le mafai ona tuʻufaʻatasia ma galuega atoa i le atoa polokalama polokalama."
                },
                {
                    "title": "Upega Tafaʻilagi",
                    "text": "Faatasi ai ma tomai i HTML, CSS, ma Javascript Compuppers e pei o tali .Js, ou te faia le fiafia o le aufaʻatasi o le tagata faʻatau."
                },
                {
                    "title": "Taaloga Atinaʻe",
                    "text": "Faʻaleleia o gagana pei o Java ma C ++, ou te faʻapitoa ai i lona fatuina siama poto masani poto masani poto masani masani, faʻamautinoaina o le faia o taʻaloga o le taʻaloga."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfolio",
        "filter_by": "Faamama porterfolio e:",
        "entries": {
            "connect_four": {
                "title": "Fesootai fa",
                "text": "Ole tele o aiga o le sili atu i le 50+ faagaioiga o le fesoʻotaʻiga e fa taʻaloga. O lenei poloketi e aofia ai le faʻatinoina i luga o le 30 eseese o gagana gagana, e aofia ai Java, C ++, Python, JavaSon, ma isi mea. E le gata i lea, e aofia ai foi le 20+ eseʻese faʻavaʻa poʻo isi ituaiga, e aofia ai tali .Js, ruby ​​i luga o nofoaafi, asp.net, ma sili atu.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Soifua Maloloina",
                "text": "O se poloketi o pepa o loʻo faʻateleina i le va o gagana eseese. I lo o aofia ai ma le 15 eseese polokalame lautele ma 18 mamanuina o mamanu.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "excel_scripts": {
                "title": "Microsoft Excel Spredsheet Quets (vba)",
                "text": "O se tusi aoga a vba tusitusiga mo Microsoft Excel. O lenei faletusi ua faʻaaogaina i galuega otometi i Excel Scientshests.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "minecraft_json_generator": {
                "title": "Minecraft Jsson Generator",
                "text": "O le moli moli JSON Bon Geontorator fausia i Python mo Minecraft Propment & Data afifi. O lenei poloketi e faʻaaogaina e gaosia ai ni faila JSON mo Misuraft Vs, e aofia ai mea masani, poloka, ma faʻalapotopotoga. Aoga tele mo le le gata i le faia o ni mea masani ai faʻamatalaga, ae mo mods o loʻo lelei e ala i le mola o loʻo ki ai foliga.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "O laʻu aʻoaʻoga",
                "text": "Ona o aʻu lava poloketi lava ia lava, ua ou mauaina foi le tele o tomai mai aʻoaʻoga. Kiliki ii e vaʻai i laʻu linkIn faʻamatalaga mo nisi faʻamatalaga.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Laʻu tomai faʻapolofesa",
                "text": "Faatasi ai ma aʻu lava galuega lava, ua ou mauaina foi le tele o tomai mai aʻoaʻoga poto. Kiliki ii e vaʻai i laʻu linkIn faʻamatalaga mo nisi faʻamatalaga.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Worwin Portfolio Upega Tafaʻilagi",
                "text": "O lenei 'upega tafaʻilagi o laʻu lava tuʻuga o laʻu tagata' upega tafaʻilagi, fausia ma tali .Js. O lenei poloketi e faʻaoga e faʻaalia ai oʻu tomai ma poloketi, faʻapea foi ma le tuʻuina atu o se tulaga mo tagata faigaluega e mafai ona faʻafesoʻotaʻi mai aʻu. O lenei poloketi e faʻaaoga e fausia ai se tagata tomai faʻapitoa i luga ole laiga.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patrick o le Loatrick Regic Library",
                "text": "O se tusi lesona aoga a Lua Tusitusiga mo le lumanaʻi. O lenei faletusi e faʻaaogaina i galuega a le au taʻavale i Lua, lea e mafai ona maua mai mo galuega faʻapitoa-faʻatamala, pei o Lua e masani lava o loʻo vave tele ai le gagana.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "neovim_config": {
                "title": "Patrick's Neovim Conneg",
                "text": "O laʻu lava neovim o le faʻatulagaina. O lenei poloketi e faʻaoga e faʻatulaga ai Neovim e fiafia i ai, e aofia ai Key Coindbindings, autu, ma le pipi. O lenei poloketi e faʻaoga e fai ai Neovim sili atu tagata faʻaaoga-faauo ma lelei mo laʻu lava faʻaaogaina.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patrick's Faafanua Generator",
                "text": "O le Iunaite Setete o Country County & State Demeve Breenrator, fausia ma Python faʻaaogaina le KaupandAs ma MaltPutlolib Faletusi. O lenei poloketi e faʻaoga e faʻatupu ai ni faʻafanua o le Iunaite Setete, e aofia ai Faʻafanua o le Setete ma le Malo. O lenei poloketi e faʻaaoga e faʻatupu ai ni faʻafanua a le suʻega mo le faʻailoaina o le ata ma le auiliiliga.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patrick's Manbelshll FOLAFOLAGA FOLAFOLAGA",
                "text": "O se tusi aoga o tusitusiga o le mana o le mana mo le lumanaʻi. Aoga ma le $ talaaga faʻamatalaga tusitusiga, ou te mauaina lenei mea e aoga tele mo le otometi galuega mai le Windows Triends o le Windows OS.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patrick's ruby ​​melatusi resitala faletusi",
                "text": "O se tusi lesona aoga o Ruby tusitusiga mo le lumanaʻi. Aoga mo le lumanaʻi o ruby ​​i luga o le mamafa o le atinaʻeina o manatu.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF tomai galue",
                "text": "O se tagata masani PDF BDF na fausia ma Python e ala ile PDFKAIT ma Jinja2 faaopoopoga, faatasi ai ma HTTML ma JSON Pulea. O lenei poloketi e faʻaoga e maua ai faila PDF mai se lisi o tomai ma poloketi. O lenei poloketi e mafai ona faʻaogaina e fausia ai se masani PDF toe amata, e aoga tele mo galuega talosaga.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandel Nurcryption poloketi",
                "text": "O se aiga o 10+ Faʻatinoga o le Rijandel Nucryption Algorithm i le 128, 192, ma le 256 pepa. O lenei poloketi e faʻaaogaina e faʻaalia ai le Rijandel Nurcryption Algorithm i le tele o polokalame faʻapitoa. O lenei poloketi e faʻaaoga e fai ai se aiga o le faʻatinoina o le Rijandel Nucryption Algorithm.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Silisilimc Mycraft Mod",
                "text": "A minecraft Mod e faʻaopopo mea fai pisinisi, ofutau, tagata ese, poloka, itu, ma tele isi foliga i le taʻaloga. Fausia ma Java Fualaau 8-15 mo le filifilia o Minecraft Faʻafeagaiga i le va o le 1.16 ma 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "GIGER Actimeng gagana",
                "text": "Custic Stage Groupment gagana fausia i mea uma e lua o le AM ​​& sasaina e faʻataʻitaʻi ma le faʻauigaina mamanuina ma faʻatinoga. Faia i luga o le upega tafailagi o le Portfoolio Faaaoga Upega Tafaʻilagi.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger Tailgting Protemen website",
                "text": "O le 'upega tafaʻilagi na ou fausia i le 2024 mo le Tiger Tiling Pros, o se kamupani taʻavale i Clemson, SC. Fausia ma tali .Js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Tagi masini masini",
                "text": "Aiga o le silia ma le 30+ gaioiga o masini pili. Faaaogaina e faʻaalia ai le faʻaleleia o le atoatoa mo polokalame faʻapitoa mo suʻesuʻega, aemaise mo le gagana tuʻufaʻatasi gagana.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "GIGER Actimeng gagana"
    },
    "contact": {
        "title": "Faʻafesoʻotaʻi mai aʻu",
        "header": "Fesootai Faamatalaga",
        "email": "PattyGsocials@gmail.com",
        "description": "Ou te tali atu i le fesili mai le imeli, LinkedIn feau, ma Instagram savali. O le a ou toe valaʻau mai pe a fai o laʻu numera o loʻo tuʻuina atu e ala i le toe maua pe leai foi, e ui lava ou te manaʻo e teu laʻu numera telefoni."
    },
    "tiger": {
        "title": "TIGER Gagana",
        "description": "O le gagana o Tiger O le gagana lea o se gagana faʻapitoa o loʻo fausia uma i le taimi uma Faia i luga o le upega tafailagi o le Portfoolio Faaaoga Upega Tafaʻilagi. O le gagana o Tiger O le gagana lea o se gagana faʻapitoa o loʻo fausia uma i le taimi uma Faia i luga o le upega tafailagi o le Portfoolio Faaaoga Upega Tafaʻilagi.",
        "more_info1": "Mo nisi faʻamatalaga, faʻasino i le tagata faitau i le",
        "more_info2": "Tiger polokalama polokalama Gitthub fale teu oloa.",
        "select_engine": "Filifili afi:",
        "tiger_code": "Tiger code:",
        "run_tiger": "Tamoe Tiger",
        "output": "Galuega Faatino:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Atoa Polokalame Polokalama Engineter e faavae i le ogatotonu Florida"
    },
    "social_media": {
        "github": "Gub",
        "instagram": "Instagram",
        "linkedin": "Lipine",
        "tiktok": "Tiktok",
        "youtube": "Youtube",
        "text_strip": "Mulimuli mai"
    },
    "logotext": "Pamu"
}