{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Guri",
        "about": "Ku saabsan aniga",
        "portfolio": "Boorsofolio",
        "projects": "Mashaariicda websaydhka",
        "tiger": "Luqadda Tiger",
        "portfolio_translator": "Turjubaanka Foormada",
        "formatter": "Jlan & yaml qaab dhismeedka",
        "cube_solver": "RubIx Cube Solver",
        "contact": "Ila soo xiriir"
    },
    "home": {
        "title": "Guri",
        "animated": {
            "first": "Injineerka software buuxa",
            "second": "Sawirka shabakadda",
            "third": "Soosaarayaasha ciyaarta",
            "fourth": "Waxyaabaha uu ka kooban yahay"
        },
        "footer": "Websaydhka ayaa hada tarjumay & lagu dami karo 100+ luqadood!",
        "descriptionA": "Khilaafaadka softiweerka buuxa ee software-ka & soo-saareyaasha websaydhka leh oo leh taariikh ah oo si guul leh u horseeddaya mashaariicda horumarineed ee loogu talagalay in lagu xoojiyo khibradaha isticmaalaha ee dib-u-soo-nooleynta falcelinta.",
        "descriptionB": "Intaa waxaa sii dheer, waxaan ahay mid ka mid ah abuurka juqraafiyeed ee ku guuleysta algorithms ee aaladaha warbaahinta bulshada ee badan, oo ay ku jiraan Instagram, oo ay ku jiraan Instagram, youtube, iyo tiktok, si ay u helaan saldhiga raacsan oo ku lug leh",
        "portfolio_button": "My Portfolio",
        "contact_button": "Ila soo xiriir",
        "about_button": "Ku saabsan aniga"
    },
    "about": {
        "title": "Ku saabsan aniga",
        "personal_summary": {
            "title": "Soo Koobid Shakhsi ah",
            "text": "Iyada oo ah soosaaraha software-ka oo dhan ee ku saleysan Orlando, Fl, waxaan khibrad u muujiyay tikniyoolajiyad kala duwan, Java iyo C ++ si dib loogu celiyo.js iyo node.js. Iyada oo leh rikoor waddo ah oo ah mashaariicda dhexdhexaadka ah, oo ay ku jiraan horumarinta barnaamijka wax-ka-beddelka Java ee loogu talagalay Minecraft iyo websaydh abaal marin ah oo loogu talagalay darawalada xamuulka ah, waxaan muujiyey hogaaminta iyo hal-abuurka. Balanqaadka aan u leeyahay heer sare ayaa ah awooddeyda maareynta mashruuca, xalliyaan dhibaatooyinka adag, oo aan keeno xalal tayo sare leh oo kor u qaadaya khibradda adeegsadaha oo aan wado guusha abaabul."
        },
        "professional_experience": {
            "title": "Khibrad xirfadeed",
            "entries": [
                {
                    "jobtitle": "Injineer Software-ka Junior",
                    "where": "Caymiska Orion180",
                    "date": "2024 - Jooji"
                },
                {
                    "jobtitle": "Aasaasiyadda & Soo-Saarka Software ee Buuxa",
                    "where": "Sarsareremc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Injineerka software buuxa",
                    "where": "Dardar-gelinta barashada",
                    "date": "2023"
                },
                {
                    "jobtitle": "Horumarinta websaydhka (barnaamijka ardayda)",
                    "where": "Barnaamijka Jaamacadda Clemson GDI",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Kormeeraha Miiska",
                    "where": "Jaamacadda Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Kormeeraha Miiska",
                    "where": "Jaamacadda Clemson",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Xirfadaha farsamada",
            "header1": "Luuqadaha barnaamijka",
            "header2": "Qaab-dhismeedka & Maktabadaha",
            "header3": "Qalabka & teknolojiyada"
        },
        "services": {
            "title": "Adeegyadayga",
            "entries": [
                {
                    "title": "Injineerka gubashada oo buuxa",
                    "text": "Waxaan bixiyaa xalka dhameystiran ee ku yaal hordhaca hore iyo gadaal-gadaasha, oo hubinaya is-dhexgalka aan kala go 'lahayn iyo waxqabadka oo dhan oo dhan oo dhan."
                },
                {
                    "title": "Horumarinta Websaydhka",
                    "text": "Khabiir ku ah HTML, CSS, iyo qaab-dhismeedka Javascript sida falcelinta oo kale, waxaan qalinka ku garaacayaa muuqaal muuqaal ah iyo websaydhyo ku habboon isticmaaleyaasha ah si ay ula kulmaan baahiyaha gaarka ah ee macaamiisha iyo doorbidyada."
                },
                {
                    "title": "Horumarinta ciyaarta",
                    "text": "Luuqadaha kacsan sida Java iyo C ++, waxaan ku takhasusay abuurista khibradaha ciyaaraha soo-galka, oo ah fikradda iyo naqshadeynta hirgelinta iyo kobcinta, hubinta in lagu mashquuliyo ciyaarta ciyaarta iyo waxqabadka jilicsan."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Boorsofolio",
        "filter_by": "Faahfaahin faylfooban by:",
        "entries": {
            "biblioteca": {
                "title": "Bilibroeca json",
                "text": "Mashruuc Python ah oo ku qulqulaya tarjumaadaha luqadda. Waxay u oggolaaneysaa websaydhka websaydhka ah in loo tarjumo 70+ luqadood, oo ay ku jiraan Isbaanish, Faransiis, Shiinaha, Carabi, iyo kuwa kale oo badan. Mashruucan waxaa loo isticmaalaa in lagu abuuro boorsooyin websidelo-luqado badan ku hadla, oo aad waxtar ugu leh gaarista dhagaysi ballaaran. Mashruucan, in ka badan 99% adduunka ayaa ku aqrin kara faylalka faylalka ku jira luqad sifiican u hadlaya.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Isku xidho afar",
                "text": "Qoys aad u weyn oo ka badan 50+ hirgelinta ah ee isku xidhka afarta ciyaar ee ciyaarta. Mashruucan waxaa ka mid ah hirgelinta in ka badan 30 luqadood oo kala duwan oo barnaamij ah, oo ay ku jiraan Java, c ++, python, javascript, iyo ka badan. Intaa waxaa sii dheer, sidoo kale waxaa ka mid ah in ka badan 20+ qaab dhismeedka kala duwan ama qaabab kale, oo ay ku jiraan falcelinta ka falcelinta, Ruby, Ruby, iyo inbadan.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "Barnaamijka raashinka",
                "text": "Gundhig buuxda oo dhammaystiran Codsigu wuxuu raacaa xamuulka kontoroolka / adeegga / kaydka kaydka qaab dhismeedka qaybta ee loo yaqaan 'Export' ee ku adkaysiga ku-adkaysi waxaana ku jira sumcad guud oo tijaabo ah.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Mashruuca Dhexgalka",
                "text": "Mashruuc dukumiinti dukumiintiyeedka dhexgalka luqadaha barnaamijyada kala duwan. Xilligan waxaa ku jira 15 luqadood oo barnaamij oo kala duwan iyo 18 qaab oo fulin ah.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Diiwaanka alaabada",
                "text": "Diiwaanka Demo-daada oo buuxa oo ah Iibiyaha Saldhigga Codsigan wuxuu muujiyaa nidaam xirfadeed-fasalka ah oo leh xaqiijinta u adeegsiga, xakameynta doorka ee ku saleysan, raadraaca alaabada, iyo howsha bixinta muranka.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "JSON & Yaml outo platter?",
                "text": "Linte & Autoformter-ka feylasha JSOML & Yaml. Mashruucan waxaa loo isticmaalaa in lagu sameeyo faylasha JSON & Yaml, kaasoo aad waxtar ugu leh haynta nambarka nadiifinta iyo abaabulka. Waxaa lagu dhisay go ', oo lagu soo ururiyo iyada oo sax ah, oo lagu dhejiyay faylalkayga oo ah mashruuc websaydh ah. Qaabab badan oo soo socda mustaqbalka.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft json matoor",
                "text": "Guryaha fudud ee JSONT ee Jody wuxuu dhisay Python ee Kheyraadka Kheyraadka & Xogta Xogta. Mashruucan waxaa loo isticmaalaa in lagu soo saaro faylasha JSON ee Mods Moodhyada Minecraftatka, oo ay ku jiraan alaabada caadiga ah, baloogyada, iyo hay'adaha. Aad ayey waxtar ugu tahay inaadan abuurin kaliya Datapacks caado ah, laakiin mods sidoo kale iyada oo loo marayo muujinta magaca wareejinta mod.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Khibradeyda waxbarasho",
                "text": "Iyadoo ay weheliso mashaariicda shaqsiyeed, sidoo kale waxaan ka qaatay xirfado badan oo ka imanaya khibrada waxbarashada. Halkan guji si aad u aragto astaantayga LinkedIn si aad u hesho macluumaad dheeraad ah.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Khibradeyda xirfadeed",
                "text": "Iyadoo ay weheliso mashaariicda shaqsiyeed, sidoo kale waxaan ka qaatay xirfado badan oo khibrad leh. Halkan guji si aad u aragto astaantayga LinkedIn si aad u hesho macluumaad dheeraad ah.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Bogrick Goodwin PortFolio",
                "text": "Websaydhkan ayaa ah websaydhkayga gaarka ah ee xafiisyadayda gaarka ah, oo lagu dhisay jawaab celin.Js. Mashruucan waxaa loo isticmaalaa in lagu muujiyo xirfadahayga iyo mashaariicdayda, iyo sidoo kale in la bixiyo meel loogu talagalay loo shaqeeyeyaasha suurtagalka ah si ay ila soo xiriiraan. Mashruucan waxaa loo isticmaalaa in lagu abuuro jiritaanka qadka dhexe ee khadka tooska ah.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Maktabadda Patrick ee Patrick ee Lua Script",
                "text": "Maktabad waxtar leh oo ku saabsan qoraallada Lua ee tixraaca mustaqbalka. Maktabaddan waxaa loo isticmaalaa in lagu qabto howlaha ka jira qoraallada Lua, kaasoo u imaan kara wax ku habboon howlaha waxqabadka u baahan, sida Luua badanaa uu yahay luqadda qoraalka si dhaqso leh iyo Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrick's Micrick Microsoft Excel Scrept qoraallada (VBA)",
                "text": "Maktabad waxtar leh oo qoraallada VBA loogu talagalay Microsoft Excel. Maktabaddan waxaa loo isticmaalaa in lagu qabto howlaha ay ku shaqeeyaan xaashiyaha Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Patrick's neovim config",
                "text": "Qaab-dhismeedkayga gaarka ah ee neovim. Mashruucan waxaa loo isticmaalaa in lagu habeeyo neovim ee aad jeceshahay, oo ay ku jiraan furaha caadiga ah, mowduucyada, iyo pluffs. Mashruucan waxaa loo isticmaalaa in lagu sameeyo neovim-ka-u-habboon oo saaxiibtinimo iyo wax ku ool ah isticmaalkeyga shaqsiyeed.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Getrick's Map",
                "text": "General Medication County & Membelka Gobolka oo lagu dhisay Python iyadoo la adeegsanayo maktabadaha Geopankas iyo Matplotlib. Mashruucan waxaa loo isticmaalaa in lagu soo saaro khariidado ka mid ah Mareykanka, oo ay ku jiraan gobolka iyo khariidadaha gobolka. Mashruucan waxaa loo isticmaalaa in lagu abuuro khariidado caadada ah oo loogu talagalay muuqaalka macluumaadka iyo falanqaynta.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Maktabadda PATIR CARRUURTA",
                "text": "Maktabad waxtar leh oo ku saabsan qoraallada budada ah ee loo yaqaan 'Powerhell' ee tixraaca mustaqbalka. Faa'iido badan",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Maktabadda qoraalka ee Patrick",
                "text": "Maktabad waxtar leh oo ku saabsan qoraallada Ruby ee tixraaca mustaqbalka. Waxtar u leh Ruby mustaqbalka ee Fikradaha Kobcinta Rails.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "Xirfadaha PDF ee dhista",
                "text": "PDF dhise caadada ah oo lagu dhisay python iyada oo loo marayo kordhinta PDFKIT iyo Jinja2, oo ay weheliso HTML iyo qaab-joson. Mashruucan waxaa loo isticmaalaa in lagu abuuro faylasha PDF liistada xirfadaha iyo mashaariicda. Mashruucan waxaa loo isticmaali karaa in lagu abuuro resumeyga PDF ee caadada ah, kaasoo aad waxtar ugu leh codsiyada shaqada.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Mashruuca Encendel Encrylption",
                "text": "Qoys ka kooban 10+ hirgelinta ee algorithm-ka Rijandel encrichithm ee 128, 192, iyo 256 xabbadood. Mashruucan waxaa loo isticmaalaa in lagu muujiyo algorithm-ka rijandel encriantm ee luqadaha barnaamijyada kala duwan. Mashruucan waxaa loo isticmaalaa in lagu abuuro qoys hirgelin leh oo ka mid ah algorithm-ka rijandel.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Supremempm Minecraft mod",
                "text": "Mod Minecraftat-ka oo ku daraya aalado caado ah, hubka, waxyaabo, baloogyo, cabbir, iyo astaamo badan oo ka badan ciyaarta. Lagu dhisay noocyada Java 8-17 ee xulashada noocyada Minecrtt ee u dhexeeya 1.16 iyo 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Luqadda barnaamijyada Tiger",
                "text": "Luqadda barnaamijyada caadiga ah ee lagu dhisay labada god & miridhkuba si ay u tijaabiyaan qaabeynta turjubaanka iyo waxqabadka. Waxaa lagu hirgaliyay websaydhka boortafooliyada iyadoo la adeegsanayo golaha websaydhka.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger Trag Websaydhka",
                "text": "Websaydh waxaan ka dhisay 2024 oo loogu talagalay Tiger Tragerogs, oo ah shirkad dabacsan oo ku taal Clemson, SC. Lagu dhisay falcelinta .j.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Mashruuca Mashiinka Mashiinka Mashiinka",
                "text": "Qoyska ka weyn 30+ hirgelinta mashiinka qashinka. Waxaa loo isticmaalaa in lagu muujiyo dhameystirka shaashadda ee luqadaha barnaamijyada kala duwan ee cilmi baarista, gaar ahaan luqadda barnaamijyada Tiger.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Luqadda barnaamijyada Tiger"
    },
    "contact": {
        "title": "Ila soo xiriir",
        "header": "Macluumaadka xiriirka",
        "email": "Pattygsocials@gmail.com",
        "description": "Waxaan ka jawaabayaa weydiimaha e-maylka, farriimaha iskuxiran, iyo farriimaha Instagram. Sidoo kale waan soo wici doonaa haddii nambarkayga lagu bixiyo resume ama haddii kale, in kastoo aan doorbidayo inaan lambarkeyga taleefankeyga ku haysto."
    },
    "formatter": {
        "title": "Jlan & yaml qaab dhismeedka",
        "description": "Shirkadda JSON & Yaml waa aalad kuu oggolaanaya inaad qaabeyso faylasha JSON iyo Yaml. Waxaa lagu dhisay oo la dhisay oo haboon yahay, oo waxaa loogu talagalay in lagu sooco oo wax ku ool ah. Feejignaanta waxaa loogu talagalay in ay fududaato in la isticmaalo, iyadoo loo adeegsanayo interface sahlan oo kuu oggolaanaya inaad ku dhejiso koodhkaaga JCS ama Yaml oo ku qaabeedda dhagsii badhanka.",
        "more_info1": "Macluumaad dheeri ah, tixraac Readmem-ka ee",
        "more_info2": "JSOS / Yaml Positsitor-ka.",
        "format_as": "Qaab sida:",
        "auto_detect": "Auto garan",
        "format": "Khiddad"
    },
    "cube_solver": {
        "title": "RubIx Cube Solver",
        "start": "Xallin"
    },
    "tiger": {
        "title": "Luqadda Tiger",
        "description": "Luqadda barnaamijyada Tiger waa luqadda barnaamijyada caadiga ah ee lagu dhisay labada god & miridhkuba si ay u tijaabiyaan qaabeynta turjubaanka iyo waxqabadka. Waxaa lagu hirgaliyay websaydhka boortafooliyada iyadoo la adeegsanayo golaha websaydhka. Luqadda barnaamijyada Tiger waa luqadda barnaamijyada caadiga ah ee lagu dhisay labada god & miridhkuba si ay u tijaabiyaan qaabeynta turjubaanka iyo waxqabadka. Waxaa lagu hirgaliyay websaydhka boortafooliyada iyadoo la adeegsanayo golaha websaydhka.",
        "more_info1": "Macluumaad dheeri ah, tixraac Readmem-ka ee",
        "more_info2": "Barnaamijyada Tiger Barnaamijka Barnaamijka Gitthif ee Gitthif.",
        "select_engine": "Xulo Mashiinka:",
        "tiger_code": "Nambarka Tiger:",
        "run_tiger": "Orod shabeel",
        "output": "Wax soo saar:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Injineerka software ee buuxa ee ku saleysan bartamaha Florida"
    },
    "copy": {
        "text": "Koobbi ka sameyn",
        "copied": "La soo guuriyey!"
    },
    "social_media": {
        "github": "GitHub",
        "instagram": "Instagram",
        "linkedin": "Xiriir lagu yeero",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "I soo raac"
    },
    "languages": {
        "title": "Turjubaanka Foormada",
        "description": "Soo ogow sida ay fayl-gacmeedyadu u heli karaan booqdayaasha adduunka oo dhan oo taageero ka badan 100 luqadood.",
        "global_accessibility": {
            "title": "Helitaanka Caalamka",
            "description": "Boorsadayda waxaa lagu heli karaa in ka badan {tirin} luqadaha, taasoo ka dhigeysa inay u soo bandhigto booqdayaasha adduunka oo dhan. Habkan luqadaha badan lagu hadlayo ayaa muujinaya sida ay uga go'an tahay ka-qaybgalka iyo gaarista caalamiga ah ee horumarka software-ka.",
            "stats": {
                "languages_supported": "Luuqadaha la taageeray",
                "countries_represented": "Wadamada matalaya",
                "continents_covered": "Qaaradaha ayaa daboolay"
            }
        },
        "features": {
            "title": "Astaamaha",
            "items": [
                {
                    "title": "Tarjumaadda waqtiga-dhabta ah:",
                    "description": "Luuqadaha u wareeji isla markiiba leh luuqadda xulashada"
                },
                {
                    "title": "Luqadda ku saleysan URL:",
                    "description": "Xulashooyinka luqadda ayaa lagu keydiyey URL"
                },
                {
                    "title": "Taageero Qoraal Qoraal ah:",
                    "description": "Ku habboon oo ku habboon qoraallada sida Carabiga, Shiinaha, Hindi, iyo inbadan"
                },
                {
                    "title": "Dareenka dhaqameed:",
                    "description": "Tarjumaadaha ayaa tixgalinaya xaalada dhaqameed, maahan micno macquul ah"
                },
                {
                    "title": "SEO wuu fiicnaaday:",
                    "description": "Kala duwanaansho kasta oo luqadeed ayaa lagu hagaajiyaa makiinadaha raadinta"
                }
            ]
        },
        "world_map": {
            "title": "Is dhexgalka Khariidadda Adduunka",
            "description": "Ka wareeji waddamada khariidada si ay u arkaan luqadooda taageera:",
            "languages_label": "Luuqadaha",
            "legend": {
                "supported": "Luuqadaha la taageeray",
                "not_supported": "Ma jiro taageero luqadeed"
            },
            "zoom_controls": {
                "zoom_in": "Soo dhaweyn gudaha",
                "zoom_out": "Soo bax",
                "reset": "Aragtida dib-u-dejinta"
            }
        },
        "supported_languages": {
            "title": "Luuqadaha la taageeray"
        },
        "interactive_country_map": {
            "title": "Khariidadda wadanka is dhexgalka",
            "description": "Ka sarreynta wadamada hoose si aad u aragto luqadooda taageera:",
            "language_count": {
                "single": "af",
                "multiple": "Luuqadaha"
            }
        },
        "tooltips": {
            "no_language_support": "Ma jiro taageero luqadeed"
        }
    },
    "logotext": "Keniisadduunu"
}