{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Shtëpi",
        "about": "Për mua",
        "portfolio": "Portofol",
        "projects": "Projekte në internet",
        "tiger": "Gjuhë tigri",
        "formatter": "Json & yaml formatter",
        "contact": "Më kontakto"
    },
    "home": {
        "title": "Shtëpi",
        "animated": {
            "first": "Inxhinier i plotë i softuerit Stack",
            "second": "Zhvillues i internetit",
            "third": "Zhvilluesi i lojërave",
            "fourth": "Krijues i përmbajtjes"
        },
        "descriptionA": "Inxhinier i softuerit me përvojë të plotë dhe zhvillues i uebit me një histori të demonstruar të projekteve të zhvillimit me sukses, nga krijimi i modifikimeve Java për Minecraft deri në përmirësimin e përvojës së përdoruesit në React.js dhe zbatimin e API-ve të sigurta REST, duke përdorur vazhdimisht metodologji të shkathëta dhe bashkëpunim efektiv të ekipit.",
        "descriptionB": "Për më tepër, unë jam një krijues i përmbajtjes së gjeografisë që ka nxitur me sukses algoritmet e platformave të shumta të mediave sociale, duke përfshirë Instagram, YouTube dhe Tiktok, për të fituar një bazë të respektueshme dhe tërheqëse të ndjekësve.",
        "portfolio_button": "Portofoli im",
        "contact_button": "Më kontakto",
        "about_button": "Për mua"
    },
    "about": {
        "title": "Për mua",
        "personal_summary": {
            "title": "Përmbledhje personale",
            "text": "Si një zhvillues i plotë i softuerit me përvojë të plotë me qendër në Orlando, FL, unë kam demonstruar ekspertizë në teknologji të ndryshme, nga Java dhe C ++ te React.js dhe Node.js. Me një rekord të projekteve të drejtimit të drejtimit, duke përfshirë zhvillimin e një programi të modifikimit Java për Minecraft dhe një uebfaqe të dobishme për shoferët e kamionëve, unë kam shfaqur udhëheqjen dhe inovacionin. Angazhimi im për përsosmëri është i dukshëm në aftësinë time për të thjeshtuar menaxhimin e projektit, për të zgjidhur probleme komplekse dhe për të ofruar zgjidhje me cilësi të lartë që përmirësojnë përvojën e përdoruesit dhe drejtojnë suksesin organizativ."
        },
        "professional_experience": {
            "title": "Përvojë profesionale",
            "entries": [
                {
                    "jobtitle": "Inxhinier i ri i softuerit",
                    "where": "Sigurimi Orion180",
                    "date": "2024 - E pranishme"
                },
                {
                    "jobtitle": "Themeluesi dhe Zhvilluesi i Full Stack Software",
                    "where": "Supremem",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Inxhinier i plotë i softuerit Stack",
                    "where": "Përshpejtoni mësimin",
                    "date": "2023"
                },
                {
                    "jobtitle": "Zhvilluesi i Uebit (Programi Studentor)",
                    "where": "Programi GDI i Universitetit Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Mbikëqyrës",
                    "where": "Universiteti Clemson",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Aftësi teknike",
            "header1": "Gjuhë programimi",
            "header2": "Kornizat dhe Bibliotekat",
            "header3": "Mjetet dhe Teknologjitë"
        },
        "services": {
            "title": "Shërbimet e mia",
            "entries": [
                {
                    "title": "Inxhinieri e plotë e pirgut",
                    "text": "Unë ofroj zgjidhje gjithëpërfshirëse në zhvillimin e përparme dhe të prapme, duke siguruar integrim dhe funksionalitet të qetë në të gjithë pirgun e softuerit."
                },
                {
                    "title": "Zhvillim në internet",
                    "text": "Me ekspertizë në kornizat HTML, CSS dhe JavaScript si React.js, unë krijoj uebfaqe vizuale tërheqëse dhe miqësore për përdoruesit, të përshtatura për të përmbushur nevojat dhe preferencat specifike të klientëve."
                },
                {
                    "title": "Zhvillimi i lojës",
                    "text": "Gjuhët e përdorimit të gjuhëve të tilla si Java dhe C ++, unë specializohem në krijimin e përvojave të lojrave gjithëpërfshirëse, nga koncepti dhe dizajni deri tek zbatimi dhe optimizimi, duke siguruar një lojë të angazhuar dhe performancë të qetë."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portofol",
        "filter_by": "Portofoli i filtrit nga:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca JSON",
                "text": "Një projekt Python që rregullon përkthimet në gjuhë. Lejon që portofoli im i internetit të përkthehet në 70+ gjuhë, duke përfshirë spanjisht, frëngjisht, kinez, arabisht dhe shumë të tjerë. Ky projekt përdoret për të krijuar një portofol shumëgjuhësh të faqes në internet, i cili është shumë i dobishëm për të arritur një audiencë më të gjerë. Me këtë projekt, mbi 99% e botës mund të lexojnë portofolin tim në një gjuhë të rrjedhshme.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Lidhu katër",
                "text": "Familje masive me mbi 50+ zbatime të lojës Connect Four. Ky projekt përfshin zbatime në mbi 30 gjuhë të ndryshme programimi, përfshirë Java, C ++, Python, JavaScript, dhe më shumë. Për më tepër, ai gjithashtu përfshin mbi 20+ korniza të ndryshme ose formate të tjera, duke përfshirë React.js, Ruby në shina, ASP.NET, dhe më shumë.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Projekt ndërhyrje",
                "text": "Një projekt që dokumenton ndërveprimin midis gjuhëve të ndryshme të programimit. Aktualisht përfshin 15 gjuhë të ndryshme programimi dhe 18 modele ekzekutimi.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "JSON & YAML AUTO Formatter",
                "text": "Një Linter & Autoformatter për skedarët JSON & YAML. Ky projekt përdoret për të formatuar skedarët JSON & YAML, i cili është shumë i dobishëm për mbajtjen e kodit të pastër dhe të organizuar. E ndërtuar me Go, e përpiluar me WebAsSembly, dhe e ngulitur në portofolin tim si një projekt në internet. Më shumë formate për të ardhur në të ardhmen.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Gjeneratori i Minecraft JSON",
                "text": "Gjenerator i lehtë JSON i ndërtuar në Python për Minecraft Resource & Paketat e të Dhënave. Ky projekt përdoret për të gjeneruar skedarë JSON për modat Minecraft, duke përfshirë artikujt me porosi, blloqe dhe entitetet. Shumë e dobishme jo vetëm për krijimin e të dhënave me porosi, por edhe për mods, si dhe përmes veçorisë së ndërrimit të emrit mod.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Përvoja ime arsimore",
                "text": "Krahas projekteve të mia personale, unë gjithashtu kam fituar aftësi të shumta nga përvoja arsimore. Klikoni këtu për të parë profilin tim të LinkedIn për më shumë informacion.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Përvoja ime profesionale",
                "text": "Krahas projekteve të mia personale, unë gjithashtu kam fituar aftësi të shumta nga përvoja profesionale. Klikoni këtu për të parë profilin tim të LinkedIn për më shumë informacion.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Uebfaqja e Portofolit Patrick Goodwin",
                "text": "Kjo faqe në internet është uebfaqja ime personale e portofolit, e ndërtuar me React.js. Ky projekt përdoret për të shfaqur aftësitë dhe projektet e mia, si dhe për të siguruar një platformë që punëdhënësit e mundshëm të më kontaktojnë. Ky projekt përdoret për të krijuar një prani profesionale në internet.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Biblioteka e Script Lua Patrick",
                "text": "Një bibliotekë e dobishme e skripteteve LUA për referencë në të ardhmen. Kjo bibliotekë përdoret për të automatizuar detyrat në skriptet e LUA, të cilat mund të vijnë në dispozicion për detyrat e kualifikimit të performancës, pasi Lua është zakonisht një gjuhë më e shpejtë shkrimi sesa Python dhe Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Skriptet e spreadsheet të Microsoft Excel të Patrick (VBA)",
                "text": "Një bibliotekë e dobishme e skripteteve VBA për Microsoft Excel. Kjo bibliotekë përdoret për të automatizuar detyrat në spreadsheets Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Konfigurimi i Neovim i Patrick",
                "text": "Konfigurimi im personal Neovim. Ky projekt përdoret për të konfiguruar Neovim sipas dëshirës time, duke përfshirë çelësat me porosi, temat dhe shtojcat. Ky projekt përdoret për ta bërë Neovim më miqësor dhe efikas për përdorimin tim personal.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Gjeneratori i Hartës së Patrikut",
                "text": "Një gjenerator i Qarkut dhe Shtetit të Shteteve të Bashkuara, i ndërtuar me Python duke përdorur bibliotekat Geopandas dhe Matplotlib. Ky projekt përdoret për të gjeneruar hartat e Shteteve të Bashkuara, përfshirë hartat e qarkut dhe shtetit. Ky projekt përdoret për të krijuar harta me porosi për vizualizimin dhe analizën e të dhënave.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Biblioteka e Skriptit PowerShell Patrick",
                "text": "Një bibliotekë e dobishme e skripteteve të PowerShell për referencë në të ardhmen. E dobishme me veçorinë e Skriptit të Profilit $, unë e shoh këtë jashtëzakonisht të dobishme për automatizimin e detyrave nga terminali i Windows, pasi unë jam një përdorues i shpeshtë i Windows OS.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Biblioteka Ruby Script e Patrick",
                "text": "Një bibliotekë e dobishme e skripteteve Ruby për referencë në të ardhmen. E dobishme për konceptet e zhvillimit të Ruby -it të ardhshëm në shinat.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "Ndërtues i aftësive PDF",
                "text": "Një ndërtues me porosi PDF i ndërtuar me Python përmes Extensions PDFKit dhe Jinja2, së bashku me formatimin HTML dhe JSON. Ky projekt përdoret për të gjeneruar skedarë PDF nga një listë e aftësive dhe projekteve. Ky projekt mund të përdoret për të krijuar një rezyme të personalizuar PDF, i cili është shumë i dobishëm për aplikimet për punë.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Projekti i kriptimit të Rijandel",
                "text": "Një familje me 10+ zbatime të algoritmit të kriptimit Rijandel në 128, 192 dhe 256 bit. Ky projekt përdoret për të demonstruar algoritmin e kriptimit Rijandel në gjuhë të ndryshme programimi. Ky projekt përdoret për të krijuar një familje zbatimi të algoritmit të kriptimit Rijandel.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod",
                "text": "Një mod Minecraft që shton mjete me porosi, forca të blinduara, turma, blloqe, dimensione dhe shumë më shumë veçori në lojë. Ndërtuar me versione Java 8-17 për versionet e zgjedhura Minecraft midis 1.16 dhe 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Gjuha e programimit të tigrit",
                "text": "Gjuha e programimit me porosi të ndërtuar në të dy Go & Rust për të eksperimentuar me hartimin dhe performancën e përkthyesit. Zbatuar në faqen e internetit të portofolit duke përdorur asamblenë në internet.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Uebfaqja e Pro Tiger Tailgating Pro",
                "text": "Një uebfaqe që ndërtova në vitin 2024 për Tiger Tailgating Pro, një kompani e pasme në Clemson, SC. Ndërtuar me React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Projekti i makinës Turing",
                "text": "Familja e mbi 30+ implementimeve të makinës Turing. Përdoret për të demonstruar plotësinë e Turing për gjuhë të ndryshme programimi për kërkime, veçanërisht për gjuhën e programimit Tiger.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Gjuha e programimit të tigrit"
    },
    "contact": {
        "title": "Më kontakto",
        "header": "Informacioni i Kontaktit",
        "email": "pattygsocials@gmail.com",
        "description": "Unë i përgjigjem pyetjeve nga posta elektronike, mesazhet e lidhura dhe mesazhet në Instagram. Unë gjithashtu do të telefonoj përsëri nëse numri im sigurohet përmes rezyme ose ndryshe, megjithëse preferoj ta mbaj numrin tim të telefonit privat."
    },
    "formatter": {
        "title": "JSON & YAML Formatter",
        "description": "JSON & YAML Formatter është një mjet që ju lejon të formatoni skedarët JSON dhe YAML. Isshtë ndërtuar me Go dhe WebAssembly, dhe është krijuar për të qenë i shpejtë dhe efikas. Formatter është krijuar për të qenë i lehtë për t’u përdorur, me një ndërfaqe të thjeshtë që ju lejon të ngjitni në kodin tuaj JSON ose YAML dhe ta formatoni atë me klikimin e një butoni.",
        "more_info1": "Për më shumë informacion, referojuni leximit në",
        "more_info2": "Repositori JSON/YAML Formatter.",
        "format_as": "Formati si:",
        "auto_detect": "Zbuloj automatikisht",
        "format": "Format"
    },
    "tiger": {
        "title": "Gjuhë tigri",
        "description": "Gjuha e programimit Tiger është një gjuhë programimi me porosi e ndërtuar në të dyja dhe ndryshk për të eksperimentuar me hartimin dhe performancën e përkthyesit. Zbatuar në faqen e internetit të portofolit duke përdorur asamblenë në internet. Gjuha e programimit Tiger është një gjuhë programimi me porosi e ndërtuar në të dyja dhe ndryshk për të eksperimentuar me hartimin dhe performancën e përkthyesit. Zbatuar në faqen e internetit të portofolit duke përdorur asamblenë në internet.",
        "more_info1": "Për më shumë informacion, referojuni leximit në",
        "more_info2": "Gjuha e programimit Tiger Repository GitHub.",
        "select_engine": "Zgjidhni Motorin:",
        "tiger_code": "Kodi Tiger:",
        "run_tiger": "Vraponi Tigerin",
        "output": "Prodhimi:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Inxhinier i plotë i softuerit Stack me qendër në Florida Qendrore"
    },
    "copy": {
        "text": "Kopjoj",
        "copied": "Kopjuar!"
    },
    "social_media": {
        "github": "Getull",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Më ndiq"
    },
    "logotext": "Patrik"
}