{
    "name": "Патрицк Гоодвин",
    "menu": {
        "home": "Дом",
        "about": "О мени",
        "portfolio": "Портфељ",
        "projects": "Пројекти веб страница",
        "tiger": "Језик тигра",
        "formatter": "Јсон & иамл форматтер",
        "cube_solver": "Рубик Цубе Солвер",
        "contact": "Контактирајте ме"
    },
    "home": {
        "title": "Дом",
        "animated": {
            "first": "Комплетан софтверски инжењер софтвера",
            "second": "Веб програмер",
            "third": "Девелопер",
            "fourth": "Створитељ садржаја"
        },
        "footer": "Веб страница је сада преведена и доступна на 100+ језика!",
        "descriptionA": "Доживели су потпуни инжењер софтвера и веб програмера са демонстрованом историјом успешних водећих развојних пројеката, од стварања Јава модификација за Минецрафт ради унапређења корисничког искуства у реактуре.ЈС и спроводећи сигурни одмори АПИ, док је у складу са безбедним АПИ-ом и ефикасном тимом.",
        "descriptionB": "Поред тога, ја сам Створитељ садржаја географије који је успешно искористио алгоритме вишеструких социјалних медија платформи, укључујући Инстаграм, ИоуТубе и Тикток, да би стекли угледни и ангажовали базу за следбело",
        "portfolio_button": "Мој портфељ",
        "contact_button": "Контактирајте ме",
        "about_button": "О мени"
    },
    "about": {
        "title": "О мени",
        "personal_summary": {
            "title": "Лични резиме",
            "text": "Као искусни целокупни програм софтвера за слагање са седиштем у Орландо, ФЛ, показао сам стручност у разним технологијама, од Јава и Ц ++ да реагују.јс и чвор.јс. Списак записа пројеката који се налазе на пројектима, укључујући развој програма модификације Јава за Минецрафт и награђену веб страницу за управљачке програме за камионе, приказао сам лидерство и иновације. Моја посвећеност изврсности видљива је у мојој способности да се поједностави управљање пројектима, реши сложене проблеме и пружају висококвалитетна решења која побољшавају корисничко искуство и успјех успјелих."
        },
        "professional_experience": {
            "title": "Професионално искуство",
            "entries": [
                {
                    "jobtitle": "Јуниор софтверски инжењер",
                    "where": "ОРИОН180 ОСИГУРАЊЕ",
                    "date": "2024 - садашњост"
                },
                {
                    "jobtitle": "Оснивач и цео стацк софтверски програмер",
                    "where": "Супремемц",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Комплетан софтверски инжењер софтвера",
                    "where": "Убрзати учење",
                    "date": "2023"
                },
                {
                    "jobtitle": "Оловни веб програмер (студентски програм)",
                    "where": "Цлемсон Университи ГДИ програм",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Надзорник стола",
                    "where": "Цлемсон Университи",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Надзорник стола",
                    "where": "Цлемсон Университи",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Техничке вештине",
            "header1": "Програмирање језика",
            "header2": "Оквири и библиотеке",
            "header3": "Алати и технологије"
        },
        "services": {
            "title": "Моје услуге",
            "entries": [
                {
                    "title": "Потпуно складиштење",
                    "text": "Пружам свеобухватна решења преко и предњег и повратног развоја, обезбеђујући бешавну интеграцију и функционалност у целом софтверском снопу."
                },
                {
                    "title": "Веб развој",
                    "text": "Са експертизом у ХТМЛ-у, ЦСС и ЈаваСцрипт оквирима попут Реацт.ЈС-а, забраним визуелно привлачне и корисничке веб странице прилагођене специфичним потребама и подешавањима клијената."
                },
                {
                    "title": "Развој игре",
                    "text": "Користећи језике као што су Јава и Ц ++, специјализовали сам се за стварање Иммерсиве Игреинг искуства, од концепта и дизајна до имплементације и оптимизације, обезбеђујући ангажовање играња и глатких перформанси."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Портфељ",
        "filter_by": "Портфолио филтера Аутор:",
        "entries": {
            "biblioteca": {
                "title": "Библиотеца ЈСОН",
                "text": "Пројекат Питхон који поједностављује језичке преводе. Омогућава да се мој портфељ веб локације превести на 70+ језика, укључујући шпански, француски, кинески, арапски и многи други. Овај пројекат се користи за креирање вишејезичног портфеља веб локација, који је веома користан за достизање шире публике. Овим пројектом преко 99% света може да прочита мој портфељ у течном језику.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Повезати четири",
                "text": "Масивна породица од преко 50+ имплементација Цоннецт Фоур игри. Овај пројекат укључује имплементације у преко 30 различитих програмских језика, укључујући Јава, Ц ++, Питхон, ЈаваСцрипт и још много тога. Поред тога, укључује и преко 20+ различитих оквира или других формата, укључујући Реацт.ЈС, Руби на шине, АСП.НЕТ и још много тога.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "Гроцери Апп",
                "text": "Комплетна апликација Фулл-Стацк .НЕТ 9 Блазор сервера за управљање прехрамбеним артиклима. Апликација прати контролу / услугу / спремиште са ентитетским оквиром језгра за упорност и укључује свеобухватни тест пакет.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Интероп Пројецт",
                "text": "Пројекат који документује интероперабилност између различитих програмских језика. Тренутно укључује 15 различитих програмских језика и 18 обрасца извршења.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Регистар залиха",
                "text": "Резервишите регистар са продајом у целокупном месту са системом управљања залихама са угаоним 17+ и чворовима.јс. Ова апликација показује професионални равни ПОС систем са аутентификацијом корисника, контролом приступа заснованом у улози, праћењу залиха и обраду плаћања.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "ЈСОН & ИАМЛ АУТО АСТОАТТХЕР",
                "text": "ЛИНТЕР & АУТОФОРМАТТЕР за ЈСОН & ИАМЛ датотеке. Овај пројекат се користи за форматирање ЈСОН & Иамл датотека, што је веома корисно за вођење кода чисто и организовано. Изграђен са Иди, састављен са ВебаСтембли и уграђен је у мој портфељ као пројекат веб странице. Више формата који долазе у будућности.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "МИНЕЦРАФТ ЈСОН ГЕНЕРАТОР",
                "text": "Лаган ЈСОН Генератор изграђен у Питхон-у за Минецрафт Ресоурце и пакета података. Овај пројекат се користи за генерисање ЈСОН датотека за Минецрафт Модс, укључујући прилагођене ставке, блокове и ентитете. Врло корисно за не само да се креирају прилагођене датаПацкс, већ и за мод, и преко функције пребацивања модног имена.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Моје образовно искуство",
                "text": "Упоредо са мојим личним пројектима, такође сам стекао бројне вештине од образовног искуства. Кликните овде да бисте видели мој ЛинкедИн профил за више информација.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Моје професионално искуство",
                "text": "Поред мојих личних пројеката, такође сам стекао бројне вештине од професионалног искуства. Кликните овде да бисте видели мој ЛинкедИн профил за више информација.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Патрицк Гоодвин Портфолио Вебсите",
                "text": "Ова веб страница је моја лична веб локација портфеља, изграђена са Реацт.ЈС. Овај пројекат се користи за приказивање мојих вештина и пројеката, као и да пружи платформу потенцијалним послодавцима да ме контактирају. Овај пројекат се користи за креирање професионалног присуства на мрежи.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Патрицк'с Луа Сцрипт Библиотека",
                "text": "Корисна библиотека ЛУА скрипти за будуће референце. Ова библиотека се користи за аутоматизацију задатака у Скриптима ЛуА, што може да приступи за задатке за обављање перформанси, јер је Луа обично бржи скриптни језик него Питхон и Руби.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Скрипте за простирке за прорачунске таблице Патрицков Мицрософт Екцел (ВБА)",
                "text": "Корисна библиотека ВБА скрипти за Мицрософт Екцел. Ова библиотека се користи за аутоматизацију задатака у Екцел прорачунским темама.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Патрицк'с Неовим Цонфиг",
                "text": "Моја лична неовим конфигурација. Овај пројекат се користи за конфигурирање неовима на моју симпатију, укључујући прилагођене таблице, теме и додатке. Овај пројекат користи се за прављење неовима прилагођених и ефикасним за моју личну употребу.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Патрицк'с Мап Генератор",
                "text": "Агрегати са округа Сједињених Држава и државни мапе, изграђен са Питхон-ом користећи ГЕОПАНДАС и МАТПЛОТБ библиотеке. Овај пројекат се користи за генерисање мапа Сједињених Држава, укључујући окружне и државне мапе. Овај пројекат се користи за креирање прилагођених мапа за визуелизацију и анализу података.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Патрицк'с ПоверСхелл Сцрипт Либрари",
                "text": "Корисна библиотека ПоверСхелл скрипти за будуће референце. Корисно са функцијом Сцрипт профила, сматрам да је то неизмерно корисно за аутоматизационе задатке са Виндовс терминала, јер сам чест корисник Виндовс ОС-а.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Патрицк'с Руби Сцрипт Либрари",
                "text": "Корисна библиотека рубинских скрипти за будуће референце. Корисно за будуће рубинске појмове раза.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "ПДФ Скиллс Буилдер",
                "text": "Прилагођени ПДФ Буилдер изграђен је са Питхон-ом преко ПДФКит и Јиња2 проширења, заједно са ХТМЛ и ЈСОН форматирањем. Овај пројекат се користи за генерисање ПДФ датотека са листе вештина и пројеката. Овај пројекат се може користити за креирање прилагођеног ПДФ резиме-а, што је веома корисно за апликације за посао.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "РИЈАНДЕЛ пројекат енкрипције",
                "text": "Породица од 10+ имплементација алгоритама шифрирања Ријандела у 128, 192 и 256 бита. Овај пројекат се користи за демонстрирање алгоритама шифрирања Ријандела у различитим програмским језицима. Овај пројекат се користи за стварање породице имплементација алгоритама шифрирања Ријанд-а.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "СупремеМЦ МИНЕЦРАФТ МОД",
                "text": "МИНЕЦРАФТ МОД који додаје прилагођене алате, оклоп, мафије, блокове, димензије и многе више функција у игру. Изграђена са Јава верзијама 8-17 за одабир минецрафт верзија између 1.16 и 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Тигер програмски језик",
                "text": "Прилагођени програм програмирања уграђен и у Иди и Хурду да експериментише са преводом дизајном и перформансама. Имплементиран на веб локацији Портфолио користећи веб склоп.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Веб локација Тигер ТАИЛГИНГА",
                "text": "Веб локација коју сам саградио 2024. за предности тигра за пртљажњу, компанију за пртљажњу у Цлемсон-у, СЦ. Изграђен са Реацт.ЈС.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Пројект Туринг Мацхине",
                "text": "Породица од преко 30+ имплементација Туринг машине. Користи се за демонстрирање туринг комплетности за различите програмирање језика за истраживање, посебно за језик за програмирање тигра.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Тигер програмски језик"
    },
    "contact": {
        "title": "Контактирајте ме",
        "header": "Контакт информације",
        "email": "паттигсоциалс@гмаил.цом",
        "description": "Одговарам на упите из е-поште, ЛинкедИн порука и Инстаграм порука. Такође ћу се назвати ако се мој број обезбеди преко животописа или на неки други начин, мада више волим да свој телефонски број чувам приватни број."
    },
    "formatter": {
        "title": "Јсон & иамл форматтер",
        "description": "ЈСОН & ИАМЛ Форматтер је алат који вам омогућава форматирање ЈСОН и ИАМЛ датотека. Саграђена је са Иди и ВебАСМБЛИ-ом и дизајнирана је да буде брза и ефикасна. Форматтер је дизајниран да буде једноставан за употребу, једноставним интерфејсом који вам омогућава да залепите у свој ЈСОН или Иамл код и форматирате га кликом на дугме.",
        "more_info1": "За више информација погледајте Реадме у",
        "more_info2": "ЈСОН / ИАМЛ Форматтер спремишта.",
        "format_as": "Формат као:",
        "auto_detect": "Аутоматско откривање",
        "format": "Формат"
    },
    "cube_solver": {
        "title": "Рубик Цубе Солвер",
        "start": "Решити"
    },
    "tiger": {
        "title": "Језик тигра",
        "description": "Тигер програмски језик је прилагођени програмски језик који је изграђен у и ГО и РУСТ-у да експериментише са дизајном и перформансама преводиоца. Имплементиран на веб локацији Портфолио користећи веб склоп. Тигер програмски језик је прилагођени програмски језик који је изграђен у и ГО и РУСТ-у да експериментише са дизајном и перформансама преводиоца. Имплементиран на веб локацији Портфолио користећи веб склоп.",
        "more_info1": "За више информација погледајте Реадме у",
        "more_info2": "ТИГЕР ПРОГРАММИНГ ЛИГУБ ГИТХУБ СТОЗИОР.",
        "select_engine": "Изаберите Мотор:",
        "tiger_code": "Тигер Шифра:",
        "run_tiger": "Трчати тигра",
        "output": "Излаз:"
    },
    "tab": {
        "title": "Патрицк Гоодвин",
        "description": "Комплетан софтверски инжењер софтвера са седиштем на централној Флориди"
    },
    "copy": {
        "text": "Копија",
        "copied": "Копирано!"
    },
    "social_media": {
        "github": "Гитхуб",
        "instagram": "Инстаграм",
        "linkedin": "ЛинкедИн",
        "tiktok": "Тикток",
        "youtube": "Иоутубе",
        "text_strip": "Прати ме"
    },
    "logotext": "Патрицк"
}