{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Hem",
        "about": "Om mig",
        "portfolio": "Portfölj",
        "projects": "Webbplatsprojekt",
        "tiger": "Tigerspråk",
        "portfolio_translator": "Portföljöversättare",
        "formatter": "JSON & YAML Formatter",
        "cube_solver": "Rubix kublösare",
        "contact": "Kontakta mig"
    },
    "home": {
        "title": "Hem",
        "animated": {
            "first": "Full Stack Software Engineer",
            "second": "Webbutvecklare",
            "third": "Spelutvecklare",
            "fourth": "Innehållsskapare"
        },
        "footer": "Webbplats nu översatt och avtalbar på 100+ språk!",
        "descriptionA": "Erfaren full-stack mjukvaruingenjör och webbutvecklare med en demonstrerad historia av framgångsrikt ledande utvecklingsprojekt, från att skapa Java-modifieringar för Minecraft till att förbättra användarupplevelsen inom React.js och implementera Secure REST API: er, samtidigt som de använder smidiga metoder och effektivt teamsamarbete.",
        "descriptionB": "Dessutom är jag en geografisk innehållsskapare som framgångsrikt har utnyttjat algoritmerna för flera sociala medieplattformar, inklusive Instagram, YouTube och Tiktok, för att få en respektabel och engagerande följare.",
        "portfolio_button": "Min portfölj",
        "contact_button": "Kontakta mig",
        "about_button": "Om mig"
    },
    "about": {
        "title": "Om mig",
        "personal_summary": {
            "title": "Personlig sammanfattning",
            "text": "Som en erfaren Full Stack -programvaruutvecklare baserad i Orlando, FL, har jag visat expertis inom olika tekniker, från Java och C ++ till React.js och Node.js. Med en meritlista av spjutspetsprojekt, inklusive utvecklingen av ett Java -modifieringsprogram för Minecraft och en givande webbplats för lastbilsförare, har jag visat ledarskap och innovation. Mitt engagemang för excellens är tydligt i min förmåga att effektivisera projektledning, lösa komplexa problem och leverera lösningar av hög kvalitet som förbättrar användarupplevelsen och driver organisatorisk framgång."
        },
        "professional_experience": {
            "title": "Arbetslivserfarenhet",
            "entries": [
                {
                    "jobtitle": "Juniorprogramvaruingenjör",
                    "where": "Orion180 försäkring",
                    "date": "2024 - närvarande"
                },
                {
                    "jobtitle": "Grundare & Full Stack Software Developer",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Full Stack Software Engineer",
                    "where": "Påskynda lärandet",
                    "date": "2023"
                },
                {
                    "jobtitle": "Lead Web Developer (Student Program)",
                    "where": "Clemson University GDI -program",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Skrivvaktare",
                    "where": "Clemson University",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Skrivledare",
                    "where": "Clemson University",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Tekniska färdigheter",
            "header1": "Programmeringsspråk",
            "header2": "Ramar och bibliotek",
            "header3": "Verktyg och teknik"
        },
        "services": {
            "title": "Mina tjänster",
            "entries": [
                {
                    "title": "Fullstackteknik",
                    "text": "Jag erbjuder omfattande lösningar i både front-end och back-end-utveckling, vilket säkerställer sömlös integration och funktionalitet i hela programvarustacken."
                },
                {
                    "title": "Webbutveckling",
                    "text": "Med expertis inom HTML, CSS och JavaScript-ramar som React.js skapar jag visuellt tilltalande och användarvänliga webbplatser skräddarsydda för att möta klienternas specifika behov och preferenser."
                },
                {
                    "title": "Spelutveckling",
                    "text": "När jag utnyttjar språk som Java och C ++ är jag specialiserad på att skapa uppslukande spelupplevelser, från koncept och design till implementering och optimering, vilket säkerställer att engagera spel och smidig prestanda."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfölj",
        "filter_by": "Filterportfölj av:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca JSON",
                "text": "Ett Python -projekt som effektiviserar språköversättningar. Tillåter min webbplatsportfölj att översättas till 70+ språk, inklusive spanska, franska, kinesiska, arabiska och många andra. Detta projekt används för att skapa en flerspråkig webbplatsportfölj, som är mycket användbar för att nå en bredare publik. Med detta projekt kan över 99% av världen läsa min portfölj på ett flytande språk.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Anslut fyra",
                "text": "Massiv familj med över 50+ implementeringar av Connect Four -spelet. Detta projekt inkluderar implementeringar på över 30 olika programmeringsspråk, inklusive Java, C ++, Python, JavaScript och mer. Dessutom inkluderar den också över 20+ olika ramar eller andra format, inklusive React.js, Ruby on Rails, ASP.NET och mer.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "Livsmedelsapp",
                "text": "En komplett fullstack .NET 9 Blazor Server-applikation för hantering av livsmedelsvaror. Applikationen följer styrenheten/tjänsten/arkivmönstret med enhetens ramkärna för uthållighet och innehåller en omfattande testsvit.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Interop Project",
                "text": "Ett projekt som dokumenterar interoperabilitet mellan olika programmeringsspråk. För närvarande innehåller 15 olika programmeringsspråk och 18 exekveringsmönster.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Inventeringsregister",
                "text": "Ett fullstackdemo-försäljningspunkt (POS) -register med lagerhanteringssystem byggt med Angular 17+ och Node.js. Denna applikation visar ett POS-system med professionell kvalitet med användarverifiering, rollbaserad åtkomstkontroll, spårning av lager och hålig betalningsbehandling.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "JSON & YAML Auto Formatter",
                "text": "En Winter & AutoFormatter för JSON & YAML -filer. Detta projekt används för att formatera JSON & YAML -filer, vilket är mycket användbart för att hålla koden ren och organiserad. Byggt med Go, sammanställt med webbassemble och inbäddad i min portfölj som ett webbplatsprojekt. Fler format att komma i framtiden.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON -generator",
                "text": "Lätt JSON -generator inbyggd i Python för Minecraft Resource & Data Packs. Detta projekt används för att generera JSON -filer för Minecraft -mods, inklusive anpassade objekt, block och enheter. Mycket användbart för att inte bara skapa anpassade datapackar, utan också för mods via Funktionen Mod Name.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Min utbildningsupplevelse",
                "text": "Vid sidan av mina personliga projekt har jag också förvärvat många färdigheter från utbildningsupplevelse. Klicka här för att se min LinkedIn -profil för mer information.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Min yrkeserfarenhet",
                "text": "Vid sidan av mina personliga projekt har jag också förvärvat många färdigheter från yrkeserfarenhet. Klicka här för att se min LinkedIn -profil för mer information.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Goodwin Portfolio webbplats",
                "text": "Denna webbplats är min personliga portföljwebbplats, byggd med React.js. Detta projekt används för att visa upp mina färdigheter och projekt, samt för att tillhandahålla en plattform för potentiella arbetsgivare att kontakta mig. Detta projekt används för att skapa en professionell online -närvaro.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patrick's Lua Script Library",
                "text": "Ett användbart bibliotek med LUA -skript för framtida referens. Detta bibliotek används för att automatisera uppgifter i LUA-skript, som kan komma till nytta för prestationsn-Needy-uppgifter, eftersom Lua vanligtvis är ett snabbare skriptspråk än både Python och Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrick's Microsoft Excel -kalkylskript (VBA)",
                "text": "Ett användbart bibliotek med VBA -skript för Microsoft Excel. Detta bibliotek används för att automatisera uppgifter i Excel -kalkylblad.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Patrick's Neovim Config",
                "text": "Min personliga neovimkonfiguration. Detta projekt används för att konfigurera Neovim till min smak, inklusive anpassade nyckelbindningar, teman och plugins. Detta projekt används för att göra Neovim mer användarvänligt och effektivt för mitt personliga bruk.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patrick's Map Generator",
                "text": "En USA: s län & statliga kartgenerator, byggd med Python med hjälp av Geopandas och Matplotlib -bibliotek. Detta projekt används för att generera kartor över USA, inklusive län- och statskartor. Detta projekt används för att skapa anpassade kartor för datavisualisering och analys.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patrick's PowerShell Script Library",
                "text": "Ett användbart bibliotek med PowerShell -skript för framtida referens. Användbart med $ profilskriptfunktionen, jag tycker att detta är oerhört användbart för att automatisera uppgifter från Windows -terminalen, eftersom jag är en vanlig användare av Windows OS.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patrick's Ruby Script Library",
                "text": "Ett användbart bibliotek med rubinskript för framtida referens. Användbart för framtida Ruby on Rails utvecklingskoncept.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF -kompetensbyggare",
                "text": "En anpassad PDF -byggare byggd med Python via PDFKIT- och Jinja2 -tillägg, tillsammans med HTML- och JSON -formatering. Detta projekt används för att generera PDF -filer från en lista över färdigheter och projekt. Detta projekt kan användas för att skapa ett anpassat PDF -CV, vilket är mycket användbart för jobbansökningar.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandel krypteringsprojekt",
                "text": "En familj med 10+ implementeringar av Rijandel -krypteringsalgoritmen 128, 192 och 256 bitar. Detta projekt används för att demonstrera Rijandel -krypteringsalgoritmen på olika programmeringsspråk. Detta projekt används för att skapa en familj av implementeringar av Rijandel -krypteringsalgoritmen.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc minecraft mod",
                "text": "En minecraft -mod som lägger till anpassade verktyg, rustningar, mobbar, block, dimensioner och många fler funktioner i spelet. Byggt med Java-versioner 8-17 för utvalda Minecraft-versioner mellan 1,16 och 1,20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tigerprogrammeringsspråk",
                "text": "Anpassat programmeringsspråk byggt på både Go & Rust för att experimentera med tolkdesign och prestanda. Implementerat på portföljwebbplatsen med webbmontering.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger Tailgating Pros webbplats",
                "text": "En webbplats som jag byggde 2024 för Tiger Tailgating Pros, ett skräddarsydd företag i Clemson, SC. Byggd med react.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing Machine Project",
                "text": "Familj med över 30+ implementeringar av Turing -maskinen. Används för att demonstrera Turing -fullständighet för olika programmeringsspråk för forskning, särskilt för Tiger -programmeringsspråket.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tigerprogrammeringsspråk"
    },
    "contact": {
        "title": "Kontakta mig",
        "header": "Kontaktinformation",
        "email": "pattygsocials@gmail.com",
        "description": "Jag svarar på förfrågningar från e -post, LinkedIn -meddelanden och Instagram -meddelanden. Jag kommer också att ringa tillbaka om mitt nummer tillhandahålls via CV eller på annat sätt, även om jag föredrar att hålla mitt telefonnummer privat."
    },
    "formatter": {
        "title": "JSON & YAML Formatter",
        "description": "JSON & YAML Formatter är ett verktyg som låter dig formatera JSON- och YAML -filer. Det är byggt med Go and Webassemble, och den är utformad för att vara snabb och effektiv. Formatter är utformad för att vara enkel att använda, med ett enkelt gränssnitt som gör att du kan klistra in i din JSON- eller YAML -kod och formatera den med klick på en knapp.",
        "more_info1": "För mer information, se Readme i",
        "more_info2": "JSON/YAML Formatter Repository.",
        "format_as": "Format som:",
        "auto_detect": "Auto upptäckt",
        "format": "Formatera"
    },
    "cube_solver": {
        "title": "Rubix kublösare",
        "start": "Lösa"
    },
    "tiger": {
        "title": "Tigerspråk",
        "description": "Tiger -programmeringsspråket är ett anpassat programmeringsspråk byggt på både Go & Rust för att experimentera med tolkdesign och prestanda. Implementerat på portföljwebbplatsen med webbmontering. Tiger -programmeringsspråket är ett anpassat programmeringsspråk byggt på både Go & Rust för att experimentera med tolkdesign och prestanda. Implementerat på portföljwebbplatsen med webbmontering.",
        "more_info1": "För mer information, se Readme i",
        "more_info2": "Tiger Programming Language GitHub Repository.",
        "select_engine": "Välj motor:",
        "tiger_code": "Tigerkod:",
        "run_tiger": "Springa tiger",
        "output": "Produktion:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Full Stack Software Engineer baserad i Central Florida"
    },
    "copy": {
        "text": "Kopiera",
        "copied": "Kopierad!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "Linkedin",
        "tiktok": "Tiktok",
        "youtube": "Youtube",
        "text_strip": "Följ mig"
    },
    "languages": {
        "title": "Portföljöversättare",
        "description": "Upptäck hur min portfölj är tillgänglig för besökare från hela världen med stöd för över 100 språk.",
        "global_accessibility": {
            "title": "Global tillgänglighet",
            "description": "Min portfölj finns på över {greve} språk, vilket gör den tillgänglig för besökare från hela världen. Denna flerspråkiga strategi visar mitt engagemang för inkludering och global räckvidd inom mjukvaruutveckling.",
            "stats": {
                "languages_supported": "Språk stöds",
                "countries_represented": "Länder representerade",
                "continents_covered": "Kontinenter täckta"
            }
        },
        "features": {
            "title": "Drag",
            "items": [
                {
                    "title": "Realtidsöversättning:",
                    "description": "Byt språk direkt med språkväljaren"
                },
                {
                    "title": "URL-baserat språk:",
                    "description": "Språkpreferenser bevaras i URL: n"
                },
                {
                    "title": "Infödda skriptstöd:",
                    "description": "Korrekt rendering av skript som arabiska, kinesiska, hindi och mer"
                },
                {
                    "title": "Kulturell känslighet:",
                    "description": "Översättningar överväger kulturellt sammanhang, inte bara bokstavliga betydelser"
                },
                {
                    "title": "SEO optimerad:",
                    "description": "Varje språkvariant är optimerad för sökmotorer"
                }
            ]
        },
        "world_map": {
            "title": "Interaktiv världskarta",
            "description": "Hover över länder på kartan för att se deras stödda språk:",
            "languages_label": "Språk",
            "legend": {
                "supported": "Språk stöds",
                "not_supported": "Inget språkstöd"
            },
            "zoom_controls": {
                "zoom_in": "Zooma in",
                "zoom_out": "Zooma ut",
                "reset": "Återställningsvy"
            }
        },
        "supported_languages": {
            "title": "Stödsspråk"
        },
        "interactive_country_map": {
            "title": "Interaktiv landskarta",
            "description": "Håll dig över länder nedan för att se deras stöd som stöds:",
            "language_count": {
                "single": "språk",
                "multiple": "språk"
            }
        },
        "tooltips": {
            "no_language_support": "Inget språkstöd"
        }
    },
    "logotext": "Patrick"
}