{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Nyumbani",
        "about": "Kuhusu mimi",
        "portfolio": "Kwingineko",
        "projects": "Miradi ya wavuti",
        "tiger": "Lugha ya Tiger",
        "formatter": "JSON & Yaml Fomati",
        "cube_solver": "Rubix Cube solver",
        "contact": "Wasiliana nami"
    },
    "home": {
        "title": "Nyumbani",
        "animated": {
            "first": "Mhandisi kamili wa programu",
            "second": "Msanidi programu wa wavuti",
            "third": "Msanidi programu wa mchezo",
            "fourth": "Muumbaji wa Yaliyomo"
        },
        "footer": "Tovuti sasa imetafsiriwa & inayoweza kufikiwa katika lugha 100+!",
        "descriptionA": "Mhandisi wa programu kamili na msanidi programu wa wavuti aliye na historia iliyoonyeshwa ya miradi ya maendeleo inayoongoza kwa mafanikio, kutoka kwa kuunda marekebisho ya JAVA kwa Minecraft ili kuongeza uzoefu wa watumiaji katika React.js na kutekeleza API za REST salama, wakati unaajiri mbinu za agile na ushirikiano mzuri wa timu.",
        "descriptionB": "Kwa kuongezea, mimi ni muundaji wa maudhui ya jiografia ambaye amefanikiwa kuboresha algorithms ya majukwaa mengi ya media ya kijamii, pamoja na Instagram, YouTube, na Tiktok, kupata msingi wa wafuasi wenye heshima na wanaohusika.",
        "portfolio_button": "Kwingineko yangu",
        "contact_button": "Wasiliana nami",
        "about_button": "Kuhusu mimi"
    },
    "about": {
        "title": "Kuhusu mimi",
        "personal_summary": {
            "title": "Muhtasari wa kibinafsi",
            "text": "Kama msanidi programu kamili wa programu ya stack iliyoko Orlando, FL, nimeonyesha utaalam katika teknolojia mbali mbali, kutoka Java na C ++ hadi React.js na Node.js. Pamoja na rekodi ya miradi ya kuongea, pamoja na ukuzaji wa mpango wa kurekebisha Java kwa Minecraft na wavuti yenye thawabu kwa madereva wa lori, nimeonyesha uongozi na uvumbuzi. Kujitolea kwangu kwa ubora ni dhahiri katika uwezo wangu wa kudhibiti usimamizi wa miradi, kutatua shida ngumu, na kutoa suluhisho za hali ya juu ambazo huongeza uzoefu wa watumiaji na kuendesha mafanikio ya shirika."
        },
        "professional_experience": {
            "title": "Uzoefu wa kitaalam",
            "entries": [
                {
                    "jobtitle": "Mhandisi wa Programu ya Juni",
                    "where": "Bima ya ORION180",
                    "date": "2024 - sasa"
                },
                {
                    "jobtitle": "Mwanzilishi na Msanidi programu kamili wa programu",
                    "where": "Supremc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Mhandisi kamili wa programu",
                    "where": "Kuharakisha kujifunza",
                    "date": "2023"
                },
                {
                    "jobtitle": "Msanidi programu wa Wavuti (Programu ya Wanafunzi)",
                    "where": "Programu ya Chuo Kikuu cha Clemson GDI",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Msimamizi wa dawati",
                    "where": "Chuo Kikuu cha Clemson",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Ujuzi wa kiufundi",
            "header1": "Lugha za programu",
            "header2": "Mfumo na Maktaba",
            "header3": "Vyombo na Teknolojia"
        },
        "services": {
            "title": "Huduma zangu",
            "entries": [
                {
                    "title": "Uhandisi kamili wa stack",
                    "text": "Ninatoa suluhisho kamili katika maendeleo ya mwisho na mwisho wa nyuma, kuhakikisha ujumuishaji wa mshono na utendaji katika programu nzima ya programu."
                },
                {
                    "title": "Maendeleo ya Wavuti",
                    "text": "Na utaalam katika HTML, CSS, na mfumo wa JavaScript kama React.js, mimi hutengeneza tovuti za kupendeza na za kupendeza za watumiaji ili kukidhi mahitaji na upendeleo wa wateja."
                },
                {
                    "title": "Maendeleo ya mchezo",
                    "text": "Lugha zinazoongoza kama vile Java na C ++, nina utaalam katika kuunda uzoefu wa michezo ya kubahatisha ya ndani, kutoka kwa dhana na muundo hadi utekelezaji na utaftaji, kuhakikisha kushiriki mchezo wa michezo na utendaji laini."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Kwingineko",
        "filter_by": "Kwingineko ya chujio na:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca Json",
                "text": "Mradi wa Python ambao unasababisha tafsiri za lugha. Inaruhusu kwingineko yangu ya wavuti kutafsiriwa kwa lugha 70+, pamoja na Kihispania, Kifaransa, Kichina, Kiarabu, na wengine wengi. Mradi huu hutumiwa kuunda kwingineko ya wavuti nyingi, ambayo ni muhimu sana kwa kufikia hadhira pana. Pamoja na mradi huu, zaidi ya 99% ya ulimwengu wanaweza kusoma kwingineko yangu kwa lugha nzuri.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Unganisha nne",
                "text": "Familia kubwa ya utekelezaji zaidi ya 50+ wa mchezo wa Connect Nne. Mradi huu ni pamoja na utekelezaji katika lugha zaidi ya 30 za programu, pamoja na Java, C ++, Python, JavaScript, na zaidi. Kwa kuongeza, inajumuisha pia mifumo zaidi ya 20+ au fomati zingine, pamoja na React.js, Ruby kwenye Reli, Asp.net, na zaidi.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Mradi wa Interop",
                "text": "Mradi ambao unaandika ushirikiano kati ya lugha tofauti za programu. Hivi sasa inajumuisha lugha 15 tofauti za programu na mifumo 18 ya utekelezaji.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "JSON & Yaml Auto Fomati",
                "text": "Linter & Autoformatter ya faili za JSON & YAML. Mradi huu hutumiwa kuunda faili za JSON & YAML, ambayo ni muhimu sana kwa kuweka nambari safi na iliyoandaliwa. Imejengwa na GO, iliyojumuishwa na WebAssembly, na kuingizwa kwenye kwingineko yangu kama mradi wa wavuti. Fomati zaidi kuja katika siku zijazo.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Jenereta ya Minecraft JSON",
                "text": "Jenereta nyepesi ya JSON iliyojengwa katika Python kwa rasilimali ya Minecraft na pakiti za data. Mradi huu hutumiwa kutengeneza faili za JSON kwa mods za Minecraft, pamoja na vitu maalum, vizuizi, na vyombo. Muhimu sana kwa sio kuunda tu daftari maalum, lakini kwa mods vile vile kupitia kipengee cha kubadili jina la mod.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Uzoefu wangu wa kielimu",
                "text": "Pamoja na miradi yangu ya kibinafsi, pia nimepata ujuzi kadhaa kutoka kwa uzoefu wa kielimu. Bonyeza hapa kuona wasifu wangu wa LinkedIn kwa habari zaidi.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Uzoefu wangu wa kitaalam",
                "text": "Pamoja na miradi yangu ya kibinafsi, pia nimepata ujuzi kadhaa kutoka kwa uzoefu wa kitaalam. Bonyeza hapa kuona wasifu wangu wa LinkedIn kwa habari zaidi.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Tovuti ya Jalada la Patrick Goodwin",
                "text": "Tovuti hii ni tovuti yangu ya kibinafsi ya kwingineko, iliyojengwa na React.js. Mradi huu hutumiwa kuonyesha ustadi na miradi yangu, na pia kutoa jukwaa la waajiri wanaoweza kuwasiliana nami. Mradi huu hutumiwa kuunda uwepo wa mtandaoni mtandaoni.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Maktaba ya maandishi ya Patrick ya Lua",
                "text": "Maktaba muhimu ya maandishi ya Lua kwa kumbukumbu ya baadaye. Maktaba hii hutumiwa kurekebisha kazi katika maandishi ya Lua, ambayo inaweza kuja kwa kazi zinazohitajika, kwani Lua kawaida ni lugha ya maandishi ya haraka kuliko Python na Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Maandishi ya Lahajedwali ya Microsoft ya Patrick (VBA)",
                "text": "Maktaba muhimu ya maandishi ya VBA ya Microsoft Excel. Maktaba hii hutumiwa kurekebisha kazi katika lahajedwali za Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Usanidi wa Neovim wa Patrick",
                "text": "Usanidi wangu wa kibinafsi wa Neovim. Mradi huu hutumiwa kusanidi Neovim kwa kupenda kwangu, pamoja na vifunguo vya kawaida, mada, na programu -jalizi. Mradi huu hutumiwa kufanya Neovim kuwa ya kupendeza zaidi na bora kwa matumizi yangu ya kibinafsi.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Jenereta ya ramani ya Patrick",
                "text": "Jenereta ya Ramani ya Jimbo la Merika na Jimbo, iliyojengwa na Python kwa kutumia maktaba za Geopandas na Matplotlib. Mradi huu hutumiwa kutengeneza ramani za Merika, pamoja na ramani za kaunti na serikali. Mradi huu hutumiwa kuunda ramani maalum za taswira ya data na uchambuzi.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Maktaba ya hati ya PowerShell ya Patrick",
                "text": "Maktaba muhimu ya maandishi ya PowerShell kwa kumbukumbu ya baadaye. Inatumika na kipengee cha hati ya Profaili ya $, mimi hupata msaada mkubwa kwa kazi za kiotomatiki kutoka kwa terminal ya Windows, kwani mimi ni mtumiaji wa mara kwa mara wa Windows OS.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Maktaba ya Hati ya Ruby ya Patrick",
                "text": "Maktaba muhimu ya maandishi ya Ruby kwa kumbukumbu ya baadaye. Inatumika kwa Ruby ya baadaye kwenye dhana za maendeleo za reli.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "Mjenzi wa Ujuzi wa PDF",
                "text": "Mjenzi wa kawaida wa PDF aliyejengwa na Python kupitia upanuzi wa PDFKit na Jinja2, kando na muundo wa HTML na JSON. Mradi huu hutumiwa kutengeneza faili za PDF kutoka kwenye orodha ya ustadi na miradi. Mradi huu unaweza kutumika kuunda resume ya kawaida ya PDF, ambayo ni muhimu sana kwa matumizi ya kazi.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Mradi wa usimbuaji wa Rijandel",
                "text": "Familia ya utekelezaji wa 10+ wa algorithm ya Rijandel encryption mnamo 128, 192, na bits 256. Mradi huu hutumiwa kuonyesha algorithm ya usimbuaji wa Rijandel katika lugha tofauti za programu. Mradi huu hutumiwa kuunda familia ya utekelezaji wa algorithm ya usimbuaji wa Rijandel.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Mod ya Suprememc Minecraft",
                "text": "Mod ya Minecraft ambayo inaongeza zana maalum, silaha, umati, vizuizi, vipimo, na huduma nyingi zaidi kwenye mchezo. Imejengwa na matoleo ya Java 8-17 kwa matoleo ya Minecraft kati ya 1.16 na 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Lugha ya programu ya Tiger",
                "text": "Lugha ya programu ya kawaida iliyojengwa katika GO & RUST kujaribu muundo wa ufasiri na utendaji. Kutekelezwa kwenye wavuti ya kwingineko kwa kutumia mkutano wa wavuti.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tovuti ya faida ya Tiger",
                "text": "Tovuti niliyoijenga mnamo 2024 kwa Tiger Tailgating Pros, kampuni ya kutafakari huko Clemson, SC. Imejengwa na React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Mradi wa Mashine ya Kujaribu",
                "text": "Familia ya utekelezaji zaidi ya 30+ wa mashine ya Kujaribu. Inatumika kuonyesha ukamilifu kwa lugha tofauti za programu kwa utafiti, haswa kwa lugha ya programu ya Tiger.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Lugha ya programu ya Tiger"
    },
    "contact": {
        "title": "Wasiliana nami",
        "header": "Maelezo ya mawasiliano",
        "email": "pattygsocials@gmail.com",
        "description": "Ninajibu kuuliza kutoka kwa barua pepe, ujumbe wa LinkedIn, na ujumbe wa Instagram. Pia nitapiga simu ikiwa nambari yangu imetolewa kupitia kuanza tena au vinginevyo, ingawa napendelea kuweka nambari yangu ya simu faragha."
    },
    "formatter": {
        "title": "JSON & Yaml Fomati",
        "description": "Njia ya JSON & YAML ni zana ambayo hukuruhusu kuunda faili za JSON na YAML. Imejengwa na Go na WebAssembly, na imeundwa kuwa haraka na kwa ufanisi. Fomati imeundwa kuwa rahisi kutumia, na interface rahisi ambayo hukuruhusu kubandika kwenye nambari yako ya JSON au YAML na kuibadilisha kwa kubonyeza kitufe.",
        "more_info1": "Kwa habari zaidi, rejelea ReadMe katika",
        "more_info2": "JSON/YAML Fomati ya Fomati.",
        "format_as": "Muundo kama:",
        "auto_detect": "Kugundua kiotomatiki",
        "format": "Muundo"
    },
    "cube_solver": {
        "title": "Rubix Cube solver",
        "solve": "Tatua"
    },
    "tiger": {
        "title": "Lugha ya tiger",
        "description": "Lugha ya programu ya Tiger ni lugha ya programu ya kawaida iliyojengwa katika GO & Rust kujaribu muundo wa ufasiri na utendaji. Kutekelezwa kwenye wavuti ya kwingineko kwa kutumia mkutano wa wavuti. Lugha ya programu ya Tiger ni lugha ya programu ya kawaida iliyojengwa katika GO & Rust kujaribu muundo wa ufasiri na utendaji. Kutekelezwa kwenye wavuti ya kwingineko kwa kutumia mkutano wa wavuti.",
        "more_info1": "Kwa habari zaidi, rejelea ReadMe katika",
        "more_info2": "Kuinua kwa programu ya Tiger GitHub.",
        "select_engine": "Chagua Injini:",
        "tiger_code": "Nambari ya Tiger:",
        "run_tiger": "Run Tiger",
        "output": "Pato:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Mhandisi kamili wa programu ya stack iliyoko katikati mwa Florida"
    },
    "copy": {
        "text": "Nakala",
        "copied": "Kunakiliwa!"
    },
    "social_media": {
        "github": "GitHub",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Nifuate"
    },
    "logotext": "Patrick"
}