{
    "name": "பேட்ரிக் குட்வின்",
    "menu": {
        "home": "வீடு",
        "about": "என்னைப் பற்றி",
        "portfolio": "போர்ட்ஃபோலியோ",
        "projects": "வலைத்தள திட்டங்கள்",
        "tiger": "புலி மொழி",
        "formatter": "JSON & YAML FORMATTER",
        "cube_solver": "ரூபிக்ஸ் கியூப் தீர்வி",
        "contact": "என்னை தொடர்பு கொள்ளுங்கள்"
    },
    "home": {
        "title": "வீடு",
        "animated": {
            "first": "முழு அடுக்கு மென்பொருள் பொறியாளர்",
            "second": "வலை டெவலப்பர்",
            "third": "விளையாட்டு உருவாக்குநர்",
            "fourth": "உள்ளடக்க உருவாக்கியவர்"
        },
        "footer": "வலைத்தளம் இப்போது மொழிபெயர்க்கப்பட்டுள்ளது & 100+ மொழிகளில் கிடைக்கக்கூடியது!",
        "descriptionA": "Minecraft க்கான ஜாவா மாற்றங்களை உருவாக்குவது முதல் ரியாக்ட்.ஜே.எஸ்ஸில் பயனர் அனுபவத்தை மேம்படுத்துதல் மற்றும் பாதுகாப்பான REST API களை செயல்படுத்துதல், அதே நேரத்தில் சுறுசுறுப்பான முறைகள் மற்றும் பயனுள்ள குழு ஒத்துழைப்பைப் பயன்படுத்துதல் ஆகியவற்றைப் பயன்படுத்துதல்.",
        "descriptionB": "கூடுதலாக, நான் ஒரு புவியியல் உள்ளடக்க படைப்பாளராக இருக்கிறேன், அவர் மரியாதைக்குரிய மற்றும் ஈர்க்கக்கூடிய பின்தொடர்பவர் தளத்தைப் பெற இன்ஸ்டாகிராம், யூடியூப் மற்றும் டிக்டோக் உள்ளிட்ட பல சமூக ஊடக தளங்களின் வழிமுறைகளை வெற்றிகரமாக மேம்படுத்தியுள்ளார்.",
        "portfolio_button": "எனது போர்ட்ஃபோலியோ",
        "contact_button": "என்னை தொடர்பு கொள்ளுங்கள்",
        "about_button": "என்னைப் பற்றி"
    },
    "about": {
        "title": "என்னைப் பற்றி",
        "personal_summary": {
            "title": "தனிப்பட்ட சுருக்கம்",
            "text": "ஆர்லாண்டோ, எஃப்.எல் -ஐ தளமாகக் கொண்ட ஒரு அனுபவமிக்க முழு அடுக்கு மென்பொருள் உருவாக்குநராக, ஜாவா மற்றும் சி ++ முதல் ரியாக்ட்.ஜேஎஸ் மற்றும் நோட்.ஜே.எஸ் வரை பல்வேறு தொழில்நுட்பங்களில் நிபுணத்துவத்தை நிரூபித்துள்ளேன். மின்கிராஃப்டிற்கான ஜாவா மாற்றும் திட்டத்தின் வளர்ச்சி மற்றும் டிரக் டிரைவர்களுக்கான பலனளிக்கும் வலைத்தளம் உள்ளிட்ட முன்னேற்ற திட்டங்களின் தட பதிவுகளுடன், நான் தலைமை மற்றும் புதுமைகளை காட்சிப்படுத்தியுள்ளேன். திட்ட நிர்வாகத்தை நெறிப்படுத்துவதற்கும், சிக்கலான சிக்கல்களைத் தீர்ப்பதற்கும், பயனர் அனுபவத்தை மேம்படுத்தும் மற்றும் நிறுவன வெற்றியை அதிகரிக்கும் உயர்தர தீர்வுகளை வழங்குவதற்கும் எனது திறனில் சிறந்து விளங்குவதற்கான எனது அர்ப்பணிப்பு தெளிவாகத் தெரிகிறது."
        },
        "professional_experience": {
            "title": "தொழில்முறை அனுபவம்",
            "entries": [
                {
                    "jobtitle": "ஜூனியர் மென்பொருள் பொறியாளர்",
                    "where": "ORION180 காப்பீடு",
                    "date": "2024 - தற்போது"
                },
                {
                    "jobtitle": "நிறுவனர் மற்றும் முழு அடுக்கு மென்பொருள் உருவாக்குநர்",
                    "where": "சுப்ரெமெம்",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "முழு அடுக்கு மென்பொருள் பொறியாளர்",
                    "where": "கற்றலை விரைவுபடுத்துங்கள்",
                    "date": "2023"
                },
                {
                    "jobtitle": "முன்னணி வலை உருவாக்குநர் (மாணவர் திட்டம்)",
                    "where": "கிளெம்சன் பல்கலைக்கழக ஜி.டி.ஐ திட்டம்",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "மேசை மேற்பார்வையாளர்",
                    "where": "கிளெம்சன் பல்கலைக்கழகம்",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "மேசை மேற்பார்வையாளர்",
                    "where": "கிளெம்சன் பல்கலைக்கழகம்",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "தொழில்நுட்ப திறன்கள்",
            "header1": "நிரலாக்க மொழிகள்",
            "header2": "கட்டமைப்புகள் மற்றும் நூலகங்கள்",
            "header3": "கருவிகள் மற்றும் தொழில்நுட்பங்கள்"
        },
        "services": {
            "title": "எனது சேவைகள்",
            "entries": [
                {
                    "title": "முழு அடுக்கு பொறியியல்",
                    "text": "முன்-இறுதி மற்றும் பின்-இறுதி வளர்ச்சி இரண்டிலும் விரிவான தீர்வுகளை நான் வழங்குகிறேன், முழு மென்பொருள் அடுக்கு முழுவதும் தடையற்ற ஒருங்கிணைப்பு மற்றும் செயல்பாட்டை உறுதி செய்கிறது."
                },
                {
                    "title": "வலை அபிவிருத்தி",
                    "text": "HTML, CSS மற்றும் Javascript கட்டமைப்பில் react.js போன்ற நிபுணத்துவத்துடன், வாடிக்கையாளர்களின் குறிப்பிட்ட தேவைகளையும் விருப்பங்களையும் பூர்த்தி செய்வதற்காக ஏற்றவாறு பார்வைக்கு ஈர்க்கும் மற்றும் பயனர் நட்பு வலைத்தளங்களை நான் வடிவமைக்கிறேன்."
                },
                {
                    "title": "விளையாட்டு வளர்ச்சி",
                    "text": "ஜாவா மற்றும் சி ++ போன்ற மொழிகளை மேம்படுத்துவதன் மூலம், கருத்து மற்றும் வடிவமைப்பு முதல் செயல்படுத்தல் மற்றும் தேர்வுமுறை வரை அதிசயமான கேமிங் அனுபவங்களை உருவாக்குவதில் நான் நிபுணத்துவம் பெற்றேன், விளையாட்டு மற்றும் மென்மையான செயல்திறனை ஈடுபடுத்துவதை உறுதிசெய்கிறேன்."
                }
            ]
        }
    },
    "portfolio": {
        "title": "போர்ட்ஃபோலியோ",
        "filter_by": "போர்ட்ஃபோலியோவை வடிகட்டவும்:",
        "entries": {
            "biblioteca": {
                "title": "பிப்லியோடெக்கா ஜோன்",
                "text": "மொழி மொழிபெயர்ப்புகளை நெறிப்படுத்தும் பைதான் திட்டம். எனது வலைத்தள போர்ட்ஃபோலியோவை ஸ்பானிஷ், பிரஞ்சு, சீன, அரபு மற்றும் பலவற்றை உள்ளடக்கிய 70+ மொழிகளில் மொழிபெயர்க்க அனுமதிக்கிறது. இந்த திட்டம் ஒரு பன்மொழி வலைத்தள போர்ட்ஃபோலியோவை உருவாக்க பயன்படுகிறது, இது பரந்த பார்வையாளர்களை அடைய மிகவும் பயனுள்ளதாக இருக்கும். இந்த திட்டத்தின் மூலம், உலகில் 99% க்கும் அதிகமானோர் எனது இலாகாவை சரளமாக மொழியில் படிக்க முடியும்.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "நான்கு இணைக்கவும்",
                "text": "கனெக்ட் ஃபோர் விளையாட்டின் 50+ க்கும் மேற்பட்ட செயலாக்கங்களின் பாரிய குடும்பம். இந்த திட்டத்தில் ஜாவா, சி ++, பைதான், ஜாவாஸ்கிரிப்ட் மற்றும் பலவற்றில் 30 க்கும் மேற்பட்ட வெவ்வேறு நிரலாக்க மொழிகளில் செயலாக்கங்கள் உள்ளன. கூடுதலாக, இது 20+ க்கும் மேற்பட்ட வெவ்வேறு கட்டமைப்புகள் அல்லது ரியாக்ட்.ஜேஎஸ், ரூபி ஆன் ரெயில்ஸ், ஏஎஸ்பி.நெட் மற்றும் பலவற்றை உள்ளடக்கியது.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "மளிகை பயன்பாடு",
                "text": "மளிகை உருப்படிகளை நிர்வகிப்பதற்கான முழுமையான முழு அடுக்கு .நெட் 9 பிளேஸர் சேவையக பயன்பாடு. பயன்பாடு கட்டுப்பாட்டாளர்/சேவை/களஞ்சிய வடிவத்தை இன்டிட்டி ஃபிரேம்வொர்க் கோருடன் விடாமுயற்சியுடன் பின்பற்றுகிறது மற்றும் ஒரு விரிவான சோதனை தொகுப்பையும் உள்ளடக்கியது.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "இடைமறிப்பு திட்டம்",
                "text": "வெவ்வேறு நிரலாக்க மொழிகளுக்கு இடையில் இயங்குதளத்தை ஆவணப்படுத்தும் ஒரு திட்டம். தற்போது 15 வெவ்வேறு நிரலாக்க மொழிகள் மற்றும் 18 செயல்படுத்தல் முறைகள் உள்ளன.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "சரக்கு பதிவு",
                "text": "கோண 17+ மற்றும் Node.js உடன் கட்டப்பட்ட சரக்கு மேலாண்மை அமைப்புடன் ஒரு முழு அடுக்கு டெமோ விற்பனை (POS) பதிவு. இந்த பயன்பாடு பயனர் அங்கீகாரம், பங்கு அடிப்படையிலான அணுகல் கட்டுப்பாடு, சரக்கு கண்காணிப்பு மற்றும் போலி கட்டண செயலாக்கம் ஆகியவற்றுடன் தொழில்முறை தர பிஓஎஸ் அமைப்பை நிரூபிக்கிறது.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "JSON & YAML ஆட்டோ ஃபார்மேட்டர்",
                "text": "JSON & YAML கோப்புகளுக்கான LINTER & AUTOFORMATTER. இந்த திட்டம் JSON & YAML கோப்புகளை வடிவமைக்கப் பயன்படுகிறது, இது குறியீட்டை சுத்தமாகவும் ஒழுங்காகவும் வைத்திருக்க மிகவும் பயனுள்ளதாக இருக்கும். GO உடன் கட்டப்பட்டது, வெபாசெம்பிளியுடன் தொகுக்கப்பட்டு, வலைத்தளத் திட்டமாக எனது போர்ட்ஃபோலியோவில் உட்பொதிக்கப்பட்டுள்ளது. எதிர்காலத்தில் வர அதிக வடிவங்கள்.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON ஜெனரேட்டர்",
                "text": "மின்கிராஃப்ட் வள மற்றும் தரவுப் பொதிகளுக்காக பைத்தானில் கட்டப்பட்ட இலகுரக JSON ஜெனரேட்டர். தனிப்பயன் உருப்படிகள், தொகுதிகள் மற்றும் நிறுவனங்கள் உட்பட Minecraft Mods க்கான JSON கோப்புகளை உருவாக்க இந்த திட்டம் பயன்படுத்தப்படுகிறது. தனிப்பயன் டேட்டாபேக்குகளை உருவாக்குவது மட்டுமல்லாமல், மோட்களுக்கும் மோட் பெயர் மாறுதல் அம்சம் வழியாக மிகவும் பயனுள்ளதாக இருக்கும்.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "எனது கல்வி அனுபவம்",
                "text": "எனது தனிப்பட்ட திட்டங்களுடன், கல்வி அனுபவத்திலிருந்து ஏராளமான திறன்களையும் பெற்றுள்ளேன். மேலும் தகவலுக்கு எனது சென்டர் சுயவிவரத்தைக் காண இங்கே கிளிக் செய்க.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "எனது தொழில்முறை அனுபவம்",
                "text": "எனது தனிப்பட்ட திட்டங்களுடன், தொழில்முறை அனுபவத்திலிருந்து ஏராளமான திறன்களையும் பெற்றுள்ளேன். மேலும் தகவலுக்கு எனது சென்டர் சுயவிவரத்தைக் காண இங்கே கிளிக் செய்க.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "பேட்ரிக் குட்வின் போர்ட்ஃபோலியோ வலைத்தளம்",
                "text": "இந்த வலைத்தளம் எனது தனிப்பட்ட போர்ட்ஃபோலியோ வலைத்தளமாகும், இது ரியாக்ட்.ஜெஸ் உடன் கட்டப்பட்டுள்ளது. இந்த திட்டம் எனது திறன்களையும் திட்டங்களையும் காண்பிப்பதற்கும், சாத்தியமான முதலாளிகள் என்னை தொடர்பு கொள்ள ஒரு தளத்தை வழங்குவதற்கும் பயன்படுத்தப்படுகிறது. தொழில்முறை ஆன்லைன் இருப்பை உருவாக்க இந்த திட்டம் பயன்படுத்தப்படுகிறது.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "பேட்ரிக்கின் லுவா ஸ்கிரிப்ட் நூலகம்",
                "text": "எதிர்கால குறிப்புக்காக LUA ஸ்கிரிப்ட்களின் பயனுள்ள நூலகம். இந்த நூலகம் லுவா ஸ்கிரிப்ட்களில் பணிகளை தானியக்கமாக்குவதற்குப் பயன்படுத்தப்படுகிறது, இது செயல்திறன்-தேவை பணிகளுக்கு கைக்கு வரக்கூடும், ஏனெனில் லுவா பொதுவாக பைதான் மற்றும் ரூபி இரண்டையும் விட வேகமான ஸ்கிரிப்டிங் மொழியாகும்.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "பேட்ரிக்கின் மைக்ரோசாஃப்ட் எக்செல் விரிதாள் ஸ்கிரிப்ட்கள் (வி.பி.ஏ)",
                "text": "மைக்ரோசாஃப்ட் எக்செல் க்கான VBA ஸ்கிரிப்ட்களின் பயனுள்ள நூலகம். எக்செல் விரிதாள்களில் பணிகளை தானியக்கமாக்க இந்த நூலகம் பயன்படுத்தப்படுகிறது.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "பேட்ரிக்கின் நியோவிம் கட்டமைப்பு",
                "text": "எனது தனிப்பட்ட நியோவிம் உள்ளமைவு. தனிப்பயன் விசைப்பலகைகள், கருப்பொருள்கள் மற்றும் செருகுநிரல்கள் உள்ளிட்ட எனது விருப்பப்படி நியோவிம் கட்டமைக்க இந்த திட்டம் பயன்படுத்தப்படுகிறது. இந்த திட்டம் நியோவிம் எனது தனிப்பட்ட பயன்பாட்டிற்கு அதிக பயனர் நட்பாகவும் திறமையாகவும் மாற்ற பயன்படுகிறது.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "பேட்ரிக்கின் வரைபட ஜெனரேட்டர்",
                "text": "யுனைடெட் ஸ்டேட்ஸ் கவுண்டி & ஸ்டேட் மேப் ஜெனரேட்டர், ஜியோபண்டாஸ் மற்றும் மேட்ப்ளோட்லிப் நூலகங்களைப் பயன்படுத்தி பைத்தானுடன் கட்டப்பட்டது. மாவட்ட மற்றும் மாநில வரைபடங்கள் உட்பட அமெரிக்காவின் வரைபடங்களை உருவாக்க இந்த திட்டம் பயன்படுத்தப்படுகிறது. தரவு காட்சிப்படுத்தல் மற்றும் பகுப்பாய்விற்கான தனிப்பயன் வரைபடங்களை உருவாக்க இந்த திட்டம் பயன்படுத்தப்படுகிறது.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "பேட்ரிக்கின் பவர்ஷெல் ஸ்கிரிப்ட் நூலகம்",
                "text": "எதிர்கால குறிப்புக்காக பவர்ஷெல் ஸ்கிரிப்ட்களின் பயனுள்ள நூலகம். $ சுயவிவர ஸ்கிரிப்ட் அம்சத்துடன் பயனுள்ளதாக இருக்கும், விண்டோஸ் டெர்மினலில் இருந்து பணிகளை தானியக்கமாக்குவதற்கு இது மிகவும் உதவியாக இருக்கும், ஏனெனில் நான் விண்டோஸ் ஓஎஸ்ஸின் அடிக்கடி பயனராக இருக்கிறேன்.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "பேட்ரிக்கின் ரூபி ஸ்கிரிப்ட் நூலகம்",
                "text": "எதிர்கால குறிப்புக்காக ரூபி ஸ்கிரிப்ட்களின் பயனுள்ள நூலகம். ரெயில்கள் மேம்பாட்டுக் கருத்துக்களில் எதிர்கால ரூபி பயனுள்ளதாக இருக்கும்.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF திறன்கள் பில்டர்",
                "text": "HTML மற்றும் JSON வடிவத்துடன் PDFKIT மற்றும் JINJA2 நீட்டிப்புகள் வழியாக பைத்தானுடன் கட்டப்பட்ட தனிப்பயன் PDF பில்டர். திறன்கள் மற்றும் திட்டங்களின் பட்டியலிலிருந்து PDF கோப்புகளை உருவாக்க இந்த திட்டம் பயன்படுத்தப்படுகிறது. தனிப்பயன் PDF விண்ணப்பத்தை உருவாக்க இந்த திட்டம் பயன்படுத்தப்படலாம், இது வேலை பயன்பாடுகளுக்கு மிகவும் பயனுள்ளதாக இருக்கும்.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "ரிஜாண்டெல் குறியாக்க திட்டம்",
                "text": "128, 192, மற்றும் 256 பிட்களில் ரிஜான்டெல் குறியாக்க வழிமுறையின் 10+ செயலாக்கங்களின் குடும்பம். வெவ்வேறு நிரலாக்க மொழிகளில் ரிஜாண்டெல் குறியாக்க வழிமுறையை நிரூபிக்க இந்த திட்டம் பயன்படுத்தப்படுகிறது. ரிஜாண்டெல் குறியாக்க வழிமுறையின் செயலாக்கங்களின் குடும்பத்தை உருவாக்க இந்த திட்டம் பயன்படுத்தப்படுகிறது.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod",
                "text": "தனிப்பயன் கருவிகள், கவசங்கள், கும்பல்கள், தொகுதிகள், பரிமாணங்கள் மற்றும் பல அம்சங்களை விளையாட்டில் சேர்க்கும் ஒரு Minecraft Mod. 1.16 மற்றும் 1.20 க்கு இடையில் தேர்ந்தெடுக்கப்பட்ட மின்கிராஃப்ட் பதிப்புகளுக்கு ஜாவா பதிப்புகள் 8-17 உடன் கட்டப்பட்டுள்ளது.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "புலி நிரலாக்க மொழி",
                "text": "மொழிபெயர்ப்பாளர் வடிவமைப்பு மற்றும் செயல்திறனுடன் பரிசோதனை செய்ய கோ & ரஸ்ட் இரண்டிலும் கட்டப்பட்ட தனிப்பயன் நிரலாக்க மொழி. வலை சட்டசபையைப் பயன்படுத்தி போர்ட்ஃபோலியோ இணையதளத்தில் செயல்படுத்தப்பட்டது.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "டைகர் டெயில்கேட்டிங் நன்மை வலைத்தளம்",
                "text": "கிளெம்சன், எஸ்சியில் உள்ள டெயில்கேட்டிங் நிறுவனமான டைகர் டெயில்கேட்டிங் ப்ரோஸிற்காக நான் 2024 இல் கட்டிய வலைத்தளம். React.js உடன் கட்டப்பட்டது.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "டூரிங் இயந்திர திட்டம்",
                "text": "டூரிங் இயந்திரத்தின் 30+ க்கும் மேற்பட்ட செயலாக்கங்களின் குடும்பம். ஆராய்ச்சிக்காக வெவ்வேறு நிரலாக்க மொழிகளுக்கு டூரிங் முழுமையை நிரூபிக்கப் பயன்படுகிறது, குறிப்பாக புலி நிரலாக்க மொழிக்கு.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "புலி நிரலாக்க மொழி"
    },
    "contact": {
        "title": "என்னை தொடர்பு கொள்ளுங்கள்",
        "header": "தொடர்பு தகவல்",
        "email": "batygsocials@gmail.com",
        "description": "மின்னஞ்சல், சென்டர் செய்திகள் மற்றும் இன்ஸ்டாகிராம் செய்திகளின் விசாரணைகளுக்கு நான் பதிலளிக்கிறேன். எனது தொலைபேசி எண்ணை தனிப்பட்டதாக வைத்திருக்க விரும்பினாலும், எனது எண் விண்ணப்பத்தை அல்லது வேறுவிதமாக வழங்கப்பட்டால் நான் திரும்ப அழைப்பேன்."
    },
    "formatter": {
        "title": "JSON & YAML FORMATTER",
        "description": "JSON & YAML FORMATTER என்பது JSON மற்றும் YAML கோப்புகளை வடிவமைக்க உங்களை அனுமதிக்கும் ஒரு கருவியாகும். இது GO மற்றும் Webassemple உடன் கட்டப்பட்டுள்ளது, மேலும் இது வேகமாகவும் திறமையாகவும் வடிவமைக்கப்பட்டுள்ளது. உங்கள் JSON அல்லது YAML குறியீட்டில் ஒட்டவும், அதை ஒரு பொத்தானைக் கிளிக் செய்யவும் அனுமதிக்கும் எளிய இடைமுகத்துடன், FORMATTER பயன்படுத்த எளிதானதாக வடிவமைக்கப்பட்டுள்ளது.",
        "more_info1": "மேலும் தகவலுக்கு, இல் உள்ள README ஐப் பார்க்கவும்",
        "more_info2": "JSON/YAML FORMATTER களஞ்சியம்.",
        "format_as": "வடிவமைப்பு:",
        "auto_detect": "ஆட்டோ கண்டறிதல்",
        "format": "வடிவம்"
    },
    "cube_solver": {
        "title": "ரூபிக்ஸ் கியூப் தீர்வி",
        "start": "தீர்க்க"
    },
    "tiger": {
        "title": "புலி மொழி",
        "description": "புலி நிரலாக்க மொழி என்பது மொழிபெயர்ப்பாளர் வடிவமைப்பு மற்றும் செயல்திறனுடன் பரிசோதனை செய்ய கோ & ரஸ்ட் இரண்டிலும் கட்டப்பட்ட தனிப்பயன் நிரலாக்க மொழியாகும். வலை சட்டசபையைப் பயன்படுத்தி போர்ட்ஃபோலியோ இணையதளத்தில் செயல்படுத்தப்பட்டது. புலி நிரலாக்க மொழி என்பது மொழிபெயர்ப்பாளர் வடிவமைப்பு மற்றும் செயல்திறனுடன் பரிசோதனை செய்ய கோ & ரஸ்ட் இரண்டிலும் கட்டப்பட்ட தனிப்பயன் நிரலாக்க மொழியாகும். வலை சட்டசபையைப் பயன்படுத்தி போர்ட்ஃபோலியோ இணையதளத்தில் செயல்படுத்தப்பட்டது.",
        "more_info1": "மேலும் தகவலுக்கு, இல் உள்ள README ஐப் பார்க்கவும்",
        "more_info2": "புலி நிரலாக்க மொழி கிட்ஹப் களஞ்சியம்.",
        "select_engine": "இயந்திரத்தைத் தேர்ந்தெடுக்கவும்:",
        "tiger_code": "புலி குறியீடு:",
        "run_tiger": "புலி ரன்",
        "output": "வெளியீடு:"
    },
    "tab": {
        "title": "பேட்ரிக் குட்வின்",
        "description": "மத்திய புளோரிடாவை தளமாகக் கொண்ட முழு அடுக்கு மென்பொருள் பொறியாளர்"
    },
    "copy": {
        "text": "நகலெடு",
        "copied": "நகலெடுக்கப்பட்டது!"
    },
    "social_media": {
        "github": "கிதப்",
        "instagram": "இன்ஸ்டாகிராம்",
        "linkedin": "சென்டர்",
        "tiktok": "டிக்டோக்",
        "youtube": "YouTube",
        "text_strip": "என்னைப் பின்தொடரவும்"
    },
    "logotext": "பேட்ரிக்"
}