{
    "name": "Патрик Гудвин",
    "menu": {
        "home": "Хона",
        "about": "Дар бораи ман",
        "portfolio": "Портфел",
        "projects": "Лоиҳаҳои вебсайт",
        "tiger": "Забони паланг",
        "formatter": "Json & yaml ташаккул",
        "contact": "Бо ман тамос гиред"
    },
    "home": {
        "title": "Хона",
        "animated": {
            "first": "Муҳандиси пурраи нармафзори нармафзор",
            "second": "Веб",
            "third": "Таҳияи бозӣ",
            "fourth": "Офаридгори мундариҷа"
        },
        "descriptionA": "Муҳандиси нармафзори пурраи нармафзор ва таҳиякунандаи таърихи лоиҳаҳои бомуваффақияти пешрафтаи лоиҳаҳои рушди бомуваффақиятро аз ҳисоби бомуваффақият аз таҷрибаи java, дар ҳоле ки пайваста методология ва ҳамкории самарабахши гурӯҳро мунтазам истифода мебаранд.",
        "descriptionB": "Ғайр аз он, ман ба мунозирае, ки эҷодкор ҳастам, ки алгоритмҳои платформаҳои гуногуни ВАО-ҳои иҷтимоӣ, аз ҷумла Instagram, YouTage, YouTube, YouTube, YouTube, YouTube, YouTube, Youtube, YouTube, YouTube, YouTube, Youtube, YouTube, YouTube, Youtube, YouTube, YouTube, YouTube, Youtube, YouTube, YouTube,",
        "portfolio_button": "Портфели ман",
        "contact_button": "Бо ман тамос гиред",
        "about_button": "Дар бораи ман"
    },
    "about": {
        "title": "Дар бораи ман",
        "personal_summary": {
            "title": "Хулосаи шахсӣ",
            "text": "Ҳамчун таҳиягари нармафзори ботаҷрибае, ки дар Орландо асос ёфтааст, дар Orlando, FL, ман дар Java ва C ++ ба технологияҳои гуногун таҷриба додам Бо сабти пайгирии лоиҳаҳои сарлавҳа, аз ҷумла рушди барномаи тағирёбии Java барои майнкрафт ва вебсайти мукофотонӣ барои ронандагони мошини боркаш, ки роҳбарӣ ва инноватсияро нишон додам. Ваъдаи ман ба некӯӣ дар қобилияти идоракунии идоракунии лоиҳа аён аст, ки мушкилоти мураккаб ва роҳҳои баландсифатро, ки таҷрибаи корбарро баланд мебардоранд, ки таҷрибаи муштариёнро тақвият медиҳанд."
        },
        "professional_experience": {
            "title": "Таҷрибаи касбӣ",
            "entries": [
                {
                    "jobtitle": "Муҳандиси нармафзори хурд",
                    "where": "Orion180 суғурта",
                    "date": "2024 - ҳозир"
                },
                {
                    "jobtitle": "Муассиса ва нармафзори нармафзори пурра",
                    "where": "Волеҳӣ",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Муҳандиси пурраи нармафзори нармафзор",
                    "where": "Суръат мегирад",
                    "date": "2023"
                },
                {
                    "jobtitle": "Веб усули пешбарӣ (Барномаи донишҷӯён)",
                    "where": "Барномаи GDI Blmansson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Роҳбари мизӣ",
                    "where": "Донишгоҳи Клемсон",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Малакаҳои техникӣ",
            "header1": "Забонҳои барномасозӣ",
            "header2": "Чаҳорчӯбаҳо ва китобхонаҳо",
            "header3": "Воситаҳо ва технологияҳо"
        },
        "services": {
            "title": "Хизматрасониҳои ман",
            "entries": [
                {
                    "title": "Тугмаи пурраи экран",
                    "text": "Ман қарорҳои ҳамаҷониба дар саросари рушди қаблии ҳам ва пас аз он, ки ҳамгироӣ ва функсионалӣ дар тӯли тамоми стекери нармафзорро таъмин мекунам."
                },
                {
                    "title": "Рушди веб",
                    "text": "Бо таҷрибаомӯзӣ дар HTML, CSS ва чаҳорчӯбаи JavaScript ба монанди VSCER.Js, ман вебсайтҳои пассажир ва истифодабарандагони истифодабаранда барои қонеъ кардани ниёзҳои мушаххас ва афзалиятҳои муштариён ҳунарнамо мекунам."
                },
                {
                    "title": "Рушди бозӣ",
                    "text": "Забонҳои фишурдашуда ба монанди Java ва C ++, ман дар эҷоди таҷрибаи бозихоҳон, аз консепсия ва тарроҳӣ барои амалисозӣ ва оптимизатсия, таъмини дастовардҳои бозӣ ва ҳамворро махсус дорост."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Портфел",
        "filter_by": "Портфели филтрро тавассути:",
        "entries": {
            "biblioteca": {
                "title": "BibloteCa Json",
                "text": "Лоиҳаи python, ки тарҷумаҳои забонро таҳрик медиҳад. Иҷозат медиҳад, ки сандуқи вебсайти ман ба 70 забон, аз ҷумла испанӣ, фаронсавӣ, чинӣ, арабӣ ва бисёр дигарон тарҷума карда шавад. Ин лоиҳа барои сохтани портфели бисёрзабиниҳои бисёрзабона, ки барои расидан ба аудитҳои васеътар муфид аст. Бо ин лоиҳа зиёда аз 99% ҷаҳон метавонад портфели маро дар забони хуб хонад.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "ЧАР-ро пайваст кунед",
                "text": "Оилаи бузурги беш аз 50+ татбиқи чор бозии пайваст. Ин лоиҳа дар зиёда аз 30 забонҳои гуногун, аз ҷумла Java, C ++, Питон, JavaScript ва ғайра дар бар мегирад. Ғайр аз он, он инчунин аз 20+ чорчӯбаи гуногун ё дигар форматҳо, аз ҷумла вокунишҳои вожакард, аз ҷумла RUS.Jс, руби ба рельт, Asp.net ва ғайра низ дар бар мегирад.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Лоиҳаи байни Интером",
                "text": "Лоиҳае, ки мутобиқати муштарак байни забонҳои гуногуни барномасозӣ дорад. Дар айни замон 15 забонҳои гуногуни барномасозӣ ва 18 намунаи қатлро дар бар мегирад.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "ФАЪОЛИЯТИ ДИГАР ВА ЯНЛЛЛ",
                "text": "Хатин ва автофорорт барои файлҳои Json & Yaml. Ин лоиҳа барои формати Json & Yaml истифода мешавад, ки барои нигоҳ доштани кодекс тоза ва муташаккилона истифода мешавад. Бо раф, бо WebSASTLELL, сохта, ба портфели ман ҳамчун лоиҳаи вебсайт ворид карда шуд. Форматҳои бештар барои оянда дар оянда.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Генератори ғайрадинратрат",
                "text": "Густаришгари json Lightwight json дар Питон барои майнкарон барои майнкрафт сохта шудааст. Ин лоиҳа барои тавлиди файлҳои JSON барои Minecraft Pers, аз ҷумла маҳсулоти фармоишӣ, блокҳо ва субъектҳо истифода мешавад. Хеле муфид барои на танҳо эҷоди маълумотҳои гумрукӣ, балки барои моддаҳо, тавассути хусусияти гузариши MOG.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Таҷрибаи таълимии ман",
                "text": "Дар баробари лоиҳаҳои шахсии ман, ман инчунин аз таҷрибаи таълимӣ малакаҳои зиёде гирифтам. Барои дидани профили LinkedIN барои маълумоти бештар ин ҷо клик кунед.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Таҷрибаи касбии ман",
                "text": "Дар баробари лоиҳаҳои шахсии ман, ман инчунин аз таҷрибаи касбӣ малакаҳои зиёде гирифтам. Барои дидани профили LinkedIN барои маълумоти бештар ин ҷо клик кунед.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Вебсайти портфели Донвин",
                "text": "Ин вебсайт вебсайти портфели шахсии ман аст, ки бо REACT.Jс сохта шудааст. Ин лоиҳа барои намоиш додани малакаҳо ва лоиҳаҳои ман, инчунин барои корфармоёни эҳтимолии тамос бо корфармо тамос гирифтан истифода мешавад. Ин лоиҳа барои эҷод кардани ҳузури онлайнии касбӣ истифода мешавад.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Китобхонаи скрипти Патрик",
                "text": "Китобхонаи муфидонаи скриптҳои Луа барои истинодҳои оянда. Ин китобхона барои автоматикии скриптҳои Луа истифода бурда мешавад, ки он метавонад дар ҳаҷми иҷроҳои иҷроиши ба даст оварда шавад, зеро Луа одатан забони тезтари тезтар нисбат ба ҳам python ва рубоист.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Скриптҳои ҷадвали PateSoft Excels (VBA)",
                "text": "Китобхонаи муфидии скриптҳои VBA барои Microsoft Excel. Ин китобхона барои автоматикунонии вазифаҳо дар ҷадвалҳои Excel истифода бурда мешавад.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Танзими Нейкс",
                "text": "Конфигуратсияи шахсии неов. Ин лоиҳа барои танзими neovim ба дӯст доштани ман, аз ҷумла калидҳои шахсӣ, мавзӯъҳо ва плагинҳо истифода мешавад. Ин лоиҳа барои истифодаи UANOVIM-ро барои истифодаи шахсии ман истифода мебарад.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Генератори харитаи Патрик",
                "text": "Генератори Шаҳристони Иёлоти Муттаҳида ва харитаи давлатӣ, ки бо Pyton бо истифода аз китобхонаҳои геопанда ва Матистлиб сохта шудааст. Ин лоиҳа барои тавлиди харитаҳои Иёлоти Муттаҳида, аз ҷумла харитаҳои шаҳрӣ ва давлатӣ истифода мешавад. Ин лоиҳа барои эҷод кардани харитаҳои фармоишӣ барои визуализатсия ва таҳлили маълумот истифода мешавад.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Патрик Китобхонаи Патрикелл",
                "text": "Китобхонаи муфидонаи скриптҳои коалерҳо барои истинодҳои оянда. Бо як хусусияти скрипти Propr State, ман ин корро барои автоматикии вазифаҳо аз терминали Windows муфид меҳисобам, зеро ман корбари тирезаи Windows OS ҳастам.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Китобхонаи Рокси Патрик",
                "text": "Китобхонаи муфиди скрипти Руби барои истинодҳои оянда. Барои рублҳои оянда дар консепсияҳои рушд муфид аст.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "Малакаҳои малакаи PDF",
                "text": "Бохтари PDF After Afficle After After Affice бо pyton тавассути PDFKIT ва Jinja2 васеъ карда мешавад, дар баробари HTML ва Jons Formatting сохта шудааст. Ин лоиҳа барои тавлиди файлҳои PDF аз рӯйхати малакаҳо ва лоиҳаҳо истифода мешавад. Ин лоиҳа метавонад барои эҷод кардани резюмеи фармоишии PDF истифода шавад, ки барои барномаҳои корӣ хеле муфид аст.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Лоиҳаи рамзгузории рамзгузории Rijandel",
                "text": "Оилаи 10+ амали алгоритми алгоривали Рижеривии Рижангел дар 128, 192 ва 256 бит. Ин лоиҳа барои нишон додани алгоритми рамзгузории Рижанит дар забонҳои мухталиф истифода мешавад. Ин лоиҳа барои эҷоди як оилаи татбиқи алгоритми рамзгузории Рижияи Рижанит истифода мешавад.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "POMECECC Minecraft Mod",
                "text": "AICRRACT MANECRATT, ки абзорҳо, зиреҳҳо, моб, блокҳо, андозагузанд ва хусусиятҳои зиёдеро ба бозӣ илова мекунад. Бо версияҳои java 8-17 сохта шудааст, ки барои майнкратҳои Майнкрафт байни 1.16 ва 1.20 сохта шудааст.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Забони барномасозии паланг",
                "text": "Забони барномасозии фармоишӣ, ки дар таҷриба бо тарҳрезӣ ва иҷрои тарҳрезӣ сохта шудаанд, сохта шудааст. Дар вебсайти Портфоло бо истифода аз Ассотсиатсияи вебсайт амалӣ карда мешавад.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Вебсайти дудияи Tigle",
                "text": "Вебсайте, ки ман дар соли 2024 сохтаам, барои ҷараёнҳои дударӯзӣ, як ширкати фармоишӣ дар Клиссон, SC. Бо REALD.Jс сохта шудааст.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Лоиҳаи мошини турк",
                "text": "Оилаи зиёда аз 30+ амалияи мошини турк. Барои намоиш додани пуррагии обҳои барномаҳо барои забонҳои гуногун барои тадқиқот, хусусан барои забони барномасозии паланг.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Забони барномасозии паланг"
    },
    "contact": {
        "title": "Бо ман тамос гиред",
        "header": "Маълумот барои тамос",
        "email": "Pattygsocials@gmail.com",
        "description": "Ман ба саволҳо аз почтаи электронӣ, паёмнависии LinkedIn ва Instagram ҷавоб медиҳам. Ман инчунин бармегардам, агар рақами ман тавассути резюме ё ба тариқи дигар пешниҳод карда шавад, ман бартарӣ медиҳам, аммо ман рақами телефони худро дӯст медорам."
    },
    "formatter": {
        "title": "Json & yaml ташаккул",
        "description": "Ширкати Json & Yaml як асбобест, ки ба шумо имкон медиҳад, ки файлҳои Json ва Yaml-ро формат кунанд. Он бо веб ва WebSASTLY сохта шудааст ва он барои рӯза ва муассир тарҳрезӣ шудааст. Фармоне, ки истифода бурдан осон аст, бо интерфейси оддӣ, ки ба шумо имкон медиҳад, ки дар JONDER ё YAML-и шумо чора гиред ва бо клик тугма формат кунед.",
        "more_info1": "Барои маълумоти иловагӣ, ба хонандагон дар",
        "more_info2": "Fultosistristication partosition.",
        "format_as": "Шакл",
        "auto_detect": "Stope Decto",
        "format": "Андоза"
    },
    "tiger": {
        "title": "Забони паланг",
        "description": "Забони барномасозии паланг як забони барномасозии фармоишӣ мебошад, ки дар таҷриба бо таҷриба ва муваффақият бо тарҳрезӣ ва иҷрои тарҳрезӣ сохта шудааст. Дар вебсайти Портфоло бо истифода аз Ассотсиатсияи вебсайт амалӣ карда мешавад. Забони барномасозии паланг як забони барномасозии фармоишӣ мебошад, ки дар таҷриба бо таҷриба ва муваффақият бо тарҳрезӣ ва иҷрои тарҳрезӣ сохта шудааст. Дар вебсайти Портфоло бо истифода аз Ассотсиатсияи вебсайт амалӣ карда мешавад.",
        "more_info1": "Барои маълумоти иловагӣ, ба хонандагон дар",
        "more_info2": "Tiger Actionming забони GITBABEDIDERИ ГИНАТ.",
        "select_engine": "Муҳимро интихоб кунед:",
        "tiger_code": "Кодекси паланг:",
        "run_tiger": "Палангро идора кунед",
        "output": "Натиҷа:"
    },
    "tab": {
        "title": "Патрик Гудвин",
        "description": "Таҷдиди нармафзори нармафзори пурраи намоишӣ дар асоси Флорида"
    },
    "copy": {
        "text": "Нусха",
        "copied": "Нусхабардорӣ!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Тобовар",
        "linkedin": "Линедин",
        "tiktok": "Тикток",
        "youtube": "YouTube",
        "text_strip": "Баъди ман"
    },
    "logotext": "Патрик"
}