{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "บ้าน",
        "about": "เกี่ยวกับฉัน",
        "portfolio": "ผลงาน",
        "projects": "โครงการเว็บไซต์",
        "tiger": "ภาษาเสือ",
        "formatter": "json & yaml formatter",
        "contact": "ติดต่อฉัน"
    },
    "home": {
        "title": "บ้าน",
        "animated": {
            "first": "วิศวกรซอฟต์แวร์สแต็กเต็มรูปแบบ",
            "second": "นักพัฒนาเว็บ",
            "third": "นักพัฒนาเกม",
            "fourth": "ผู้สร้างเนื้อหา"
        },
        "footer": "เว็บไซต์ตอนนี้แปลและมีความสามารถใน 100+ ภาษา!",
        "descriptionA": "ผู้พัฒนาซอฟต์แวร์และนักพัฒนาเว็บที่มีประสบการณ์เต็มรูปแบบพร้อมประวัติความเป็นมาของโครงการพัฒนาที่ประสบความสำเร็จจากการสร้างการปรับเปลี่ยน Java สำหรับ Minecraft เพื่อเพิ่มประสบการณ์ผู้ใช้ใน React.js และการใช้ APIs ที่ปลอดภัย",
        "descriptionB": "นอกจากนี้ฉันยังเป็นผู้สร้างเนื้อหาทางภูมิศาสตร์ที่ประสบความสำเร็จในการใช้ประโยชน์จากอัลกอริทึมของแพลตฟอร์มโซเชียลมีเดียหลายแห่งรวมถึง Instagram, YouTube และ Tiktok เพื่อให้ได้ฐานผู้ติดตามที่น่านับถือและมีส่วนร่วม",
        "portfolio_button": "ผลงานของฉัน",
        "contact_button": "ติดต่อฉัน",
        "about_button": "เกี่ยวกับฉัน"
    },
    "about": {
        "title": "เกี่ยวกับฉัน",
        "personal_summary": {
            "title": "บทสรุปส่วนตัว",
            "text": "ในฐานะนักพัฒนาซอฟต์แวร์สแต็กเต็มรูปแบบที่มีประสบการณ์ในออร์แลนโดฟลอริดาฉันได้แสดงให้เห็นถึงความเชี่ยวชาญในเทคโนโลยีต่าง ๆ ตั้งแต่ Java และ C ++ ถึง React.js และ Node.js. ด้วยประวัติของโครงการหัวหอกรวมถึงการพัฒนาโปรแกรมการปรับเปลี่ยน Java สำหรับ Minecraft และเว็บไซต์ที่คุ้มค่าสำหรับคนขับรถบรรทุกฉันได้จัดแสดงความเป็นผู้นำและนวัตกรรม ความมุ่งมั่นของฉันสู่ความเป็นเลิศนั้นเห็นได้ชัดในความสามารถของฉันในการปรับปรุงการจัดการโครงการแก้ปัญหาที่ซับซ้อนและนำเสนอโซลูชั่นคุณภาพสูงที่ช่วยเพิ่มประสบการณ์ผู้ใช้และผลักดันความสำเร็จขององค์กร"
        },
        "professional_experience": {
            "title": "ประสบการณ์ระดับมืออาชีพ",
            "entries": [
                {
                    "jobtitle": "วิศวกรซอฟต์แวร์จูเนียร์",
                    "where": "ประกัน orion180",
                    "date": "2024 - ปัจจุบัน"
                },
                {
                    "jobtitle": "ผู้ก่อตั้งและนักพัฒนาซอฟต์แวร์สแต็กเต็มรูปแบบ",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "วิศวกรซอฟต์แวร์สแต็กเต็มรูปแบบ",
                    "where": "เร่งการเรียนรู้",
                    "date": "2023"
                },
                {
                    "jobtitle": "นักพัฒนาเว็บนำ (โปรแกรมนักเรียน)",
                    "where": "โปรแกรม Clemson University GDI",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "หัวหน้างาน",
                    "where": "มหาวิทยาลัยเคลมสัน",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "ทักษะด้านเทคนิค",
            "header1": "ภาษาการเขียนโปรแกรม",
            "header2": "เฟรมเวิร์กและห้องสมุด",
            "header3": "เครื่องมือและเทคโนโลยี"
        },
        "services": {
            "title": "บริการของฉัน",
            "entries": [
                {
                    "title": "วิศวกรรมสแต็คเต็มรูปแบบ",
                    "text": "ฉันนำเสนอโซลูชั่นที่ครอบคลุมตลอดทั้งการพัฒนาส่วนหน้าและส่วนหลังเพื่อให้มั่นใจว่าการรวมและการใช้งานที่ราบรื่นตลอดทั้งสแต็คซอฟต์แวร์ทั้งหมด"
                },
                {
                    "title": "การพัฒนาเว็บ",
                    "text": "ด้วยความเชี่ยวชาญในเฟรมเวิร์ก HTML, CSS และ JavaScript เช่น React.js ฉันได้สร้างเว็บไซต์ที่ดึงดูดสายตาและใช้งานง่ายและใช้งานง่ายเพื่อตอบสนองความต้องการและความชอบเฉพาะของลูกค้า"
                },
                {
                    "title": "การพัฒนาเกม",
                    "text": "การใช้ประโยชน์จากภาษาเช่น Java และ C ++ ฉันมีความเชี่ยวชาญในการสร้างประสบการณ์การเล่นเกมที่ดื่มด่ำตั้งแต่แนวคิดและการออกแบบไปจนถึงการใช้งานและการเพิ่มประสิทธิภาพทำให้มั่นใจได้ว่าการเล่นเกมที่น่าสนใจและประสิทธิภาพที่ราบรื่น"
                }
            ]
        }
    },
    "portfolio": {
        "title": "ผลงาน",
        "filter_by": "ตัวกรองผลงานโดย:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca Json",
                "text": "โครงการ Python ที่ปรับปรุงการแปลภาษา อนุญาตให้พอร์ตโฟลิโอเว็บไซต์ของฉันแปลเป็น 70 ภาษารวมถึงภาษาสเปนฝรั่งเศสจีนอาหรับและอื่น ๆ อีกมากมาย โครงการนี้ใช้ในการสร้างพอร์ตโฟลิโอเว็บไซต์หลายภาษาซึ่งมีประโยชน์มากสำหรับการเข้าถึงผู้ชมที่กว้างขึ้น ด้วยโครงการนี้มากกว่า 99% ของโลกสามารถอ่านพอร์ตโฟลิโอของฉันในภาษาที่คล่องแคล่ว",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "เชื่อมต่อสี่",
                "text": "ครอบครัวขนาดใหญ่ที่มีการใช้งานมากกว่า 50 เกมของ Connect Four Game โครงการนี้รวมถึงการใช้งานในภาษาการเขียนโปรแกรมที่แตกต่างกันมากกว่า 30 ภาษารวมถึง Java, C ++, Python, JavaScript และอื่น ๆ นอกจากนี้ยังมีเฟรมเวิร์กที่แตกต่างกันมากกว่า 20 เฟรมหรือรูปแบบอื่น ๆ รวมถึง React.js, Ruby on Rails, ASP.NET และอื่น ๆ",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "โครงการระหว่างกัน",
                "text": "โครงการที่จัดทำเอกสารการทำงานร่วมกันระหว่างภาษาการเขียนโปรแกรมที่แตกต่างกัน ปัจจุบันมีภาษาการเขียนโปรแกรมที่แตกต่างกัน 15 ภาษาและ 18 รูปแบบการดำเนินการ",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "JSON & YAML Auto Formatter",
                "text": "linter & autoformatter สำหรับไฟล์ JSON & YAML โครงการนี้ใช้ในการจัดรูปแบบไฟล์ JSON & YAML ซึ่งมีประโยชน์มากสำหรับการรักษารหัสให้สะอาดและเป็นระเบียบ สร้างขึ้นด้วย GO รวบรวมด้วย WebAssembly และฝังลงในพอร์ตโฟลิโอของฉันเป็นโครงการเว็บไซต์ รูปแบบเพิ่มเติมที่จะมาในอนาคต",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "เครื่องกำเนิดไฟฟ้า Minecraft JSON",
                "text": "เครื่องกำเนิดไฟฟ้า JSON ที่มีน้ำหนักเบาสร้างขึ้นใน Python สำหรับแพ็คทรัพยากรและข้อมูล Minecraft โครงการนี้ใช้เพื่อสร้างไฟล์ JSON สำหรับ Minecraft Mods รวมถึงรายการที่กำหนดเองบล็อกและเอนทิตี มีประโยชน์มากสำหรับการสร้างฐานข้อมูลที่กำหนดเอง แต่สำหรับ mods เช่นกันผ่านคุณสมบัติการสลับชื่อ mod",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "ประสบการณ์การศึกษาของฉัน",
                "text": "นอกเหนือจากโครงการส่วนตัวของฉันฉันยังได้รับทักษะมากมายจากประสบการณ์การศึกษา คลิกที่นี่เพื่อดูโปรไฟล์ LinkedIn ของฉันสำหรับข้อมูลเพิ่มเติม",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "ประสบการณ์ระดับมืออาชีพของฉัน",
                "text": "นอกเหนือจากโครงการส่วนตัวของฉันฉันยังได้รับทักษะมากมายจากประสบการณ์ระดับมืออาชีพ คลิกที่นี่เพื่อดูโปรไฟล์ LinkedIn ของฉันสำหรับข้อมูลเพิ่มเติม",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "เว็บไซต์ Patrick Goodwin Portfolio",
                "text": "เว็บไซต์นี้เป็นเว็บไซต์พอร์ตโฟลิโอส่วนตัวของฉันที่สร้างด้วย React.js โครงการนี้ใช้เพื่อแสดงทักษะและโครงการของฉันรวมทั้งจัดหาแพลตฟอร์มสำหรับนายจ้างที่มีศักยภาพในการติดต่อฉัน โครงการนี้ใช้เพื่อสร้างสถานะออนไลน์ระดับมืออาชีพ",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Lua Script Library ของ Patrick",
                "text": "ห้องสมุดที่มีประโยชน์ของสคริปต์ Lua สำหรับการอ้างอิงในอนาคต ไลบรารีนี้ใช้ในการทำงานอัตโนมัติในสคริปต์ Lua ซึ่งมีประโยชน์สำหรับงานที่ต้องการประสิทธิภาพเนื่องจาก Lua มักจะเป็นภาษาสคริปต์ที่เร็วกว่าทั้ง Python และ Ruby",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "สคริปต์สเปรดชีต Microsoft Excel ของ Patrick (VBA)",
                "text": "ห้องสมุดที่มีประโยชน์ของสคริปต์ VBA สำหรับ Microsoft Excel ไลบรารีนี้ใช้ในการทำงานโดยอัตโนมัติในสเปรดชีต Excel",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "การกำหนดค่า NeoVim ของ Patrick",
                "text": "การกำหนดค่า NeoVim ส่วนตัวของฉัน โครงการนี้ใช้ในการกำหนดค่า NeoVim ตามความชอบของฉันรวมถึงการกำหนดคีย์แบบกำหนดเองธีมและปลั๊กอิน โครงการนี้ใช้เพื่อให้ NeoVim ใช้งานง่ายและมีประสิทธิภาพมากขึ้นสำหรับการใช้งานส่วนตัวของฉัน",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "เครื่องกำเนิดแผนที่ของ Patrick",
                "text": "เครื่องกำเนิดแผนที่ของสหรัฐอเมริกาและรัฐที่สร้างขึ้นด้วย Python โดยใช้ห้องสมุด Geopandas และ Matplotlib โครงการนี้ใช้เพื่อสร้างแผนที่ของสหรัฐอเมริการวมถึงแผนที่ของเคาน์ตีและรัฐ โครงการนี้ใช้เพื่อสร้างแผนที่ที่กำหนดเองสำหรับการสร้างภาพข้อมูลและการวิเคราะห์",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "ห้องสมุดสคริปต์ PowerShell ของ Patrick",
                "text": "ห้องสมุดที่มีประโยชน์ของสคริปต์ PowerShell สำหรับการอ้างอิงในอนาคต มีประโยชน์กับคุณสมบัติสคริปต์ $ โปรไฟล์ฉันพบว่าสิ่งนี้มีประโยชน์อย่างมากสำหรับงานอัตโนมัติจากเทอร์มินัล Windows เนื่องจากฉันเป็นผู้ใช้ Windows OS บ่อยครั้ง",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "ห้องสมุดสคริปต์ทับทิมของแพทริค",
                "text": "ห้องสมุดที่มีประโยชน์ของสคริปต์ทับทิมสำหรับการอ้างอิงในอนาคต มีประโยชน์สำหรับแนวคิดการพัฒนาทับทิมบนรางในอนาคต",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "ตัวสร้างทักษะ PDF",
                "text": "ตัวสร้าง PDF ที่กำหนดเองที่สร้างขึ้นด้วย Python ผ่านส่วนขยาย PDFKIT และ JINJA2 ควบคู่ไปกับการจัดรูปแบบ HTML และ JSON โครงการนี้ใช้เพื่อสร้างไฟล์ PDF จากรายการทักษะและโครงการ โครงการนี้สามารถใช้เพื่อสร้างประวัติย่อ PDF ที่กำหนดเองซึ่งมีประโยชน์มากสำหรับแอปพลิเคชันงาน",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "โครงการเข้ารหัส Rijandel",
                "text": "ครอบครัวของการใช้งานอัลกอริทึมการเข้ารหัส Rijandel 10 ครั้งใน 128, 192 และ 256 บิต โครงการนี้ใช้เพื่อแสดงอัลกอริทึมการเข้ารหัส Rijandel ในภาษาการเขียนโปรแกรมที่แตกต่างกัน โครงการนี้ใช้เพื่อสร้างครอบครัวของการใช้งานอัลกอริทึมการเข้ารหัส Rijandel",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "suprememc minecraft mod",
                "text": "Minecraft mod ที่เพิ่มเครื่องมือที่กำหนดเองเกราะ, mobs, บล็อก, มิติและคุณสมบัติอื่น ๆ อีกมากมายในเกม สร้างขึ้นด้วยเวอร์ชัน Java 8-17 สำหรับรุ่น Minecraft ที่เลือกระหว่าง 1.16 ถึง 1.20",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "ภาษาการเขียนโปรแกรมไทเกอร์",
                "text": "ภาษาการเขียนโปรแกรมแบบกำหนดเองที่สร้างขึ้นทั้งใน GO & Rust เพื่อทดสอบด้วยการออกแบบล่ามและประสิทธิภาพ นำไปใช้กับเว็บไซต์พอร์ตโฟลิโอโดยใช้เว็บแอสเซมบลี",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "เว็บไซต์ข้อดี Tiger Tailgating",
                "text": "เว็บไซต์ที่ฉันสร้างขึ้นในปี 2024 สำหรับ Tiger Tailgating Pros ซึ่งเป็น บริษัท tailgating ใน Clemson, SC สร้างด้วย react.js",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "โครงการเครื่องทัวริง",
                "text": "ครอบครัวของเครื่องทัวริงมากกว่า 30 คน ใช้เพื่อแสดงให้เห็นถึงความสมบูรณ์ของทัวริงสำหรับภาษาการเขียนโปรแกรมที่แตกต่างกันสำหรับการวิจัยโดยเฉพาะอย่างยิ่งสำหรับภาษาการเขียนโปรแกรมไทเกอร์",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "ภาษาการเขียนโปรแกรมไทเกอร์"
    },
    "contact": {
        "title": "ติดต่อฉัน",
        "header": "ข้อมูลติดต่อ",
        "email": "pattygsocials@gmail.com",
        "description": "ฉันตอบคำถามจากอีเมลข้อความ LinkedIn และข้อความ Instagram ฉันจะโทรกลับหากหมายเลขของฉันได้รับผ่านทางเรซูเม่หรืออย่างอื่นแม้ว่าฉันต้องการให้หมายเลขโทรศัพท์ของฉันเป็นส่วนตัว"
    },
    "formatter": {
        "title": "json & yaml formatter",
        "description": "Formatter JSON & YAML เป็นเครื่องมือที่ช่วยให้คุณสามารถจัดรูปแบบไฟล์ JSON และ YAML มันถูกสร้างขึ้นด้วย GO และ WebAssembly และได้รับการออกแบบให้รวดเร็วและมีประสิทธิภาพ Formatter ได้รับการออกแบบให้ใช้งานง่ายด้วยอินเทอร์เฟซแบบง่าย ๆ ที่ช่วยให้คุณสามารถวางในรหัส JSON หรือ YAML ของคุณและจัดรูปแบบด้วยการคลิกเพียงปุ่มเดียว",
        "more_info1": "สำหรับข้อมูลเพิ่มเติมโปรดดู readMe ในไฟล์",
        "more_info2": "JSON/YAML Formatter ที่เก็บ",
        "format_as": "รูปแบบเป็น:",
        "auto_detect": "ตรวจจับอัตโนมัติ",
        "format": "รูปแบบ"
    },
    "tiger": {
        "title": "ภาษาเสือ",
        "description": "ภาษาการเขียนโปรแกรม Tiger เป็นภาษาการเขียนโปรแกรมที่กำหนดเองที่สร้างขึ้นในทั้ง GO & Rust เพื่อทดสอบด้วยการออกแบบล่ามและประสิทธิภาพ นำไปใช้กับเว็บไซต์พอร์ตโฟลิโอโดยใช้เว็บแอสเซมบลี ภาษาการเขียนโปรแกรม Tiger เป็นภาษาการเขียนโปรแกรมที่กำหนดเองที่สร้างขึ้นในทั้ง GO & Rust เพื่อทดสอบด้วยการออกแบบล่ามและประสิทธิภาพ นำไปใช้กับเว็บไซต์พอร์ตโฟลิโอโดยใช้เว็บแอสเซมบลี",
        "more_info1": "สำหรับข้อมูลเพิ่มเติมโปรดดู readMe ในไฟล์",
        "more_info2": "การเขียนโปรแกรม Tiger ภาษา GitHub ที่เก็บข้อมูล",
        "select_engine": "เลือกเครื่องยนต์:",
        "tiger_code": "รหัสเสือ:",
        "run_tiger": "วิ่งเสือ",
        "output": "เอาท์พุท:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "วิศวกรซอฟต์แวร์สแต็กเต็มรูปแบบใน Central Florida"
    },
    "copy": {
        "text": "สำเนา",
        "copied": "คัดลอก"
    },
    "social_media": {
        "github": "คนอื่น ๆ",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "tiktok",
        "youtube": "YouTube",
        "text_strip": "ติดตามฉัน"
    },
    "logotext": "แพทริค"
}