{
    "name": "Patrik Gudwin",
    "menu": {
        "home": "Öý",
        "about": "Men hakda",
        "portfolio": "Portfolio",
        "projects": "Web sahypasy taslamalary",
        "tiger": "Ýolbarjiresi",
        "portfolio_translator": "Portfoliio",
        "formatter": "JSON & IAML formaty",
        "cube_solver": "Rubiks Cub çözüji",
        "contact": "Meniň bilen habarlaşyň"
    },
    "home": {
        "title": "Öý",
        "animated": {
            "first": "Doly programma üpjünçiligi inereneri",
            "second": "Web Education",
            "third": "Oýun dörediji",
            "fourth": "Mazmuny döredijilikli"
        },
        "footer": "Häzirki wagtda web sahypasy häzirki wagtda 100+ dillerde terjime edildi!",
        "descriptionA": "Öňünidän öňdebaryjy başlangyç möhüm taslamalaryň döredilen \"FreeCreed\" -ne gönükdirilen ösüş taslamalary bolan \"Mardcter\" üçin \"Java\" fabrigi bolan Java üýtgetmelerini döretmek; barjyrdaňur usulyýetleri we täsirli topar hyzmatdaşlygyny yzygiderli ulanmagy yzygiderli ulanmagy artdyrdy.",
        "descriptionB": "Mundan başga-da, men Instagram, YouTube-da, YouTube we Tiktok gazanmak üçin birnäçe sosial media popografiýasynyň algoritlerini üstünlikli ýaşlandyran geografiýa mazmun Civeraneri gaýtadan dikelten geografiýa mazmunly Maztyurly döredijiniň.",
        "portfolio_button": "Portfelimo",
        "contact_button": "Meniň bilen habarlaşyň",
        "about_button": "Men hakda"
    },
    "about": {
        "title": "Men hakda",
        "personal_summary": {
            "title": "Şahsy mazmun",
            "text": "Orlando, Finde ýerleşýän tejribeli doly programma öndüriji bolan maksat hökmünde, Java we C ++ rele.+ Reoment.+ Reakt.js-den geçirilen tejribeden tapawutly, men dürli tehnologiýalardan we C ++ tejribe görkezenim gelýär. Asstanyň ajaýyp sürüjileri üçin Java üýtgetmesini ösdürmek, şol sanda Jua üýtgetmeki Düwänlik maksatnamasyny düzmek, liderlik we innowasiýa barlygym ýaly serkerde boljak taslamalaryň ýazgysy bilen. Inly bolmak üçin ygrarlylygym standartlaşdyrylyşy meniň çözmek, çylşyrymly problemalary çözmek we guramaçylyk üstünligi hereket etmek ukyby barada aýdyň görünýär."
        },
        "professional_experience": {
            "title": "Hünär tejribesi",
            "entries": [
                {
                    "jobtitle": "\"Junic\" programma üpjünçiligi inereneri",
                    "where": "Oron180 ätiýaçlandyryş",
                    "date": "2024 - Häzirki"
                },
                {
                    "jobtitle": "Esaslandyryjy we doly programma öndürijisi",
                    "where": "Makrememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Doly programma üpjünçiligi inereneri",
                    "where": "Öwrenmegi çaltlaşdyryň",
                    "date": "2023"
                },
                {
                    "jobtitle": "Gurşun web döredijisi (talyp programmasy)",
                    "where": "Klemson uniwersitetiniň GDI FORIT",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Stol gözegçisi",
                    "where": "Relmson uniwersiteti",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Stol gözegçisi",
                    "where": "Relmson uniwersiteti",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Tehniki endikler",
            "header1": "Programma programmalary Programma programmirleme sözleri",
            "header2": "Çarçuwalar we kitaphanalar",
            "header3": "Gurallar we tehnologiýalar"
        },
        "services": {
            "title": "Meniň hyzmatlarym",
            "entries": [
                {
                    "title": "Doly stakan in engineeringenerçilik",
                    "text": "Öň ujundaky we daşarky ösüşiň iki ösen çözgütlerini, tutuş programma üpjünçiligindäki sumkanyň üstünde teňligi ösdürmäge, tutuş programma üpjünçiliginde ýakymly integrasiýa we işleýşini üpjün etmek."
                },
                {
                    "title": "Web ösüşi",
                    "text": "HTML-de HTML, CSS we JavaScript çarçuwalary bilen tejribe bilen, reaksiýa.js, görlen ses bermek we islegler müşderileriň aýratyn zerurlyklaryny we isleglerini kanagatlandyrmak üçin taýýarlyk gördi."
                },
                {
                    "title": "Oýun üçin tejribe",
                    "text": "Java we C ++ ýaly lagerlere ünsi we ýerine ýetirilmegine we optuslizasiýa etmekden, oýunyp, süýümliligi amala aşyrmaga rugsat berýärin."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfolio",
        "filter_by": "Süzgüç bukjasyny süzgüç boýunça:",
        "entries": {
            "biblioteca": {
                "title": "BiblioTeCA JSON",
                "text": "Dil terjimelerini düzýän Piton taslamasy. \"Litport Portfeli\" programmamyzy $ 7++ dildä terjime etmek üçin 70+ dile terjime etmek üçin girmäge mümkinçilik berýär, şol sanda 7+ dilden 7+ dilden terjime edilmäge mümkinçilik berýär, şol ýaly-da köp sanly adam. Bu taslama, has giň tomaşaçylara ýetmek üçin örän oňat webdex adaty web sahypasy bukjasyny döretmek üçin ulanylýar. Bu taslama bilen dünýäniň 99% -den gowragy portfelimi erkin dilde okap biler.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Dört birikdiriň",
                "text": "50+-dan gowrak oýunda uly durmuşa geçirişiň uly maşgalasy. Bu taslama Java, C ++, Puşassiýada 30-dan gowrak dürli programma programmasy dillerini öz içine alýar. Mundan başga-da, Relsler, Assp.Rener boýunça beýleki çarçuwalar bar we şondan soň reachme.N-leri goşmak bilen beýleki formateriýalaryň, şondan soň reach.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "Azyk önümleri",
                "text": "Azyk önümlerini dolandyrmak üçin \"PackS 9t 9 Blazor serweri\" programmasy. Programma dowamlylygy bilen guramaçylyk çarçuwasy / hyzmat / ammar / habary dolandyrýar we giňişleýin synag toplumyny öz içine alýar.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Interrop Taslamasy",
                "text": "Dürli programmirleme dilleriniň arasynda özara baglanyşyk baradaky taslama. Häzirki wagtda 15 dürli programma dilini düzüň we 18 ýerine ýetiriş nagyşlaryny öz içine alýar.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Inwentar sanawy",
                "text": "\"Perdular 17+\" bilen gurulýan \"POST\" -iň doly satuw nokady (POS) sanaw nokady (POS) hasaba alyş ulgamy bilen hasaba alyş merkezi Bu programma, ulanyjy tanylygy, rol esasly giriş gözegçiligi, inwentasiýanyň yzarlamagy we masgarygyny gaýtadan işlemek bilen hünärmen-maliýe guramasynyň görkezmesini görkezýär.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "JSON & IAMLL AWORTER FORITER",
                "text": "JSON & INAML faýllary üçin giriş we awtoformatter. Bu taslama, kod arassalamak we tertipli saklamak üçin örän peýdaly JSON & OAML faýllaryny formatlamak üçin ulanylýar. Git bilen düzülen, açyl, jemlenen we portfeliniň web sahypasy hökmünde ýerleşdirilen portfelini ýerleşdirdi. Geljekde gelmek üçin has köp forma.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "MINECRAFT JSON generatory",
                "text": "Pitfet üçin pitfon çeşmesinde ýeňil JONS generatory pitografiýada gurdular. Bu taslama, goşmaçalar, bloklar we guramalar ýaly midecraft modlary üçin ulanylýar. Diňe dini maglumatlary döretmek däl-de, modlaryň ady we mo mnosean saýlamak aýratynlygy üçin gaty peýdaly.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Bilim tejribäm",
                "text": "Şahsy taslamalarym bilen bir hatarda, bilim tejribäsinden köp sanly üstünlik ätdim. Has giňişleýin maglumat üçin LinkedIn profilimi görmek üçin şu ýere basyň.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Meniň hünär tejribäm",
                "text": "Şahsy taslamalarym bilen bir hatarda, bilimli tejribeden köp sanly hünär aldylar. Has giňişleýin maglumat üçin LinkedIn profilimi görmek üçin şu ýere basyň.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrik Gudwin Portfolio web sahypasy",
                "text": "Bu web sahypa, reaksiýa bilen gurlan meniň şahsy portffolio web sahypamdyr. Bu taslama meniň başarnykmlarymy we taslamalarymy görkezmek, şeýle hem meniň bilen habarlaşmak üçin platformal üpjün etmek üçin ulanylýar. Bu taslama, professional onlaýn barlyga eýe bolmak üçin ulanylýar.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patrikiň lua skript kitaphanasy",
                "text": "Geljekdäki salgylanma üçin Lua skriptleriniň peýdaly kitaphanasy. Bu kitaphana, öndürilenleriň presi ýaly öndürijilikli mätäç öndürip boljak Luýa skriptlerinde işlemegi üçin ulanylýar, Lua köplenç pteron we ýakasyndan has çalt skripka dilidir.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrikiň Microsoft Excel elektron tabletkalary (VBA)",
                "text": "Microsoft Excels üçin VBA scriptleriniň peýdaly kitaphanasy. Bu kitaphana Excel elektron tablisalarynda meseleleri awtomatiki awtomatlaşdyrmak üçin ulanylýar.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Patrikiň nowowim konfigurasiýasy",
                "text": "Şahsy nowimim konfigurasiýasy. Bu taslama, adatça ýörite düwmelerime düzetmek üçin, däbi düwmeleri, mowzugy we püplük. Bu taslama, Nowimi üçin has dost dostum üçin has dost dosty we täsirli bolmagy üçin ulanylýar.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patrikiň kartasy generatory",
                "text": "ABŞ-nyň Geopands we Matplotliib kartlaryny ulanyp, piton bilen gurlan ABŞ-nyň kartatory we Döwlet kartasy Will we Döwlet kartasy Will we Döwlet kartasy Will we Döwlet kartasy Will we Döwlet kartatory. Bu taslama, uniwersitetiň we döwlet kartoçkalaryny öz içine alýan ABŞ-nyň kartalaryny döretmek üçin ulanylýar. Bu taslama maglumat wizuallaşdyrmagy we derňewi üçin ýörite kartalary döretmek üçin ulanylýar.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patrikiň güýç skript skript kitaphanasy",
                "text": "Geljekki salgylanma üçin güýçler üçin güýç skriptleriniň peýdaly kitaphanasy. $ Profil tarnamary bilen peýdaly aýratynlygy, sebäbi Windowser-iň ýygy-ýygydan işleýän ýaly Windows terminalynda işlemäge peýdaly tapýaryn.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patrikiň rubiýa skript kitaphanasy",
                "text": "Geljekdäki salgylanma üçin ýakut skriptleriniň peýdaly kitaphanasy. Reels Relinal düşünjeleri rubiýa üçin peýdaly.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF başarnyk guraly",
                "text": "PDFKIT we Jinja2 arkaly PDML we Jinja2 giňeltmeleri, HTML we JSM FORTINGINE BIRINJI GEÇIP BOLANOK Bu taslama, PDF faýllaryny başarnyklaryň sanawyndan we taslamalardan has başarnyk goşmak üçin ulanylýar. Bu taslama, iş goşunlary üçin gaty peýdaly, adaty pdf rezýume döretmek üçin ulanylyp bilner.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rigangel şifrlemek taslamasy",
                "text": "10 ýaşly Ribandel bilen şypylan algoritmi 128, 192-nji we 256 bitiň bir maşgalasy we 256 bit. Bu taslama dürli programmalaryň dillerinde Ribandeliň şertiat beriş algoritmi görkezmek üçin ulanylýar. Bu taslama Rigligelipififinal weporitmiň ýerine ýetiriji okuwçy maşgalasyny döretmek üçin ulanylýar.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Sudrememc minecraft mod",
                "text": "Adsigrigratly gurallar, ýarag, ýarag, mob, kobs, ekinleri, ölçegleri, ölçegleri we oýunda köp aýratynlyklary goşýan mätärlik modeli. MINECRAFT WEBECERNELARYNY 1,16-njy we 1.20 aralygyndaky miras galan görnüşlerini saýlaň.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Igerleşiş formaly dil",
                "text": "Tertipli dizaýn we öndürijilik bilen gurlan tokaý-daky hem güman edilýän adaty programmirleme dili. Web ýygnan portfolio web sahypasynda amala aşyrylýar.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger guýrukly kömek web sahypasy",
                "text": "Relemonyň guýrukan kompaniýasy, sylon ýaly guýruk tiger tigr zäherlenen Tiger tiger tigr zäherlenen Tiger tiger tiger tiger tiger tiger tiger tigr tiger tiger tigr tiger tiger tigr tiger tigr tiger tigr tiger tigr tiger tiger tigr tiger tiger tigr tiger tigr tigr tiggringaz taýýarlygy üçin 2024-nji ýylda gurdum. Reaksiýa bilen gurlan.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing Torport taslamasy",
                "text": "30++ LINGING enjamynyň maşgalasy. Dürli programmirlemek üçin dürli programmalar üçin, esasanam ýolbars programmirleme diline gözleg üçin dürli programmalar üçin turbany görkezmek üçin ulanyldy.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Igerleşiş formaly dil"
    },
    "contact": {
        "title": "Meniň bilen habarlaşyň",
        "header": "Habarlaşanyş maglumat",
        "email": "pattogSoction@gmail.com",
        "description": "E-poçta ýa-da Instagram habarlary we Instagram habarlaryndan soramak üçin jogap berýärin. Menem meniň nomerim rezýume ýa-da başga bir belgimi saklamagy makul bilsem, jaň ederin"
    },
    "formatter": {
        "title": "JSON & IAML formaty",
        "description": "JSON & YAMML Formater, JSON we Yamle faýllaryny formatlamaga mümkinçilik berýän guraldyr. Go Go we Webastebebels bilen gurulýar we çalt we netijeli bolmak üçin niýetlenendir. Faýly jonsyň ýa-da \"USMIL koduňyza çümmäge mümkinçilik berýän ýönekeý interfeýs ulanmak aňsat, ulanyp, ýönekeý interfeýs ulanmak aňsat, ulanmak aňsat, ulanmak aňsat.",
        "more_info1": "Has giňişleýin maglumat üçin okalma serediň",
        "more_info2": "JSON / YAMAML Formatlaýjy ammar.",
        "format_as": "ÜPJÜNÇILIGI:",
        "auto_detect": "Awto tapyndy",
        "format": "Format"
    },
    "cube_solver": {
        "title": "Rubiks Cub çözüji",
        "start": "Çözmek"
    },
    "tiger": {
        "title": "Ýolbarjiresi",
        "description": "Igerolbaşçyslyk dili diline, terjimeçiniň dizaýny we öndürijiligi eksperatşi üçin \"-de\" dürtülip duralgasynda gurulýar. Web ýygnan portfolio web sahypasynda amala aşyrylýar. Igerolbaşçyslyk dili diline, terjimeçiniň dizaýny we öndürijiligi eksperatşi üçin \"-de\" dürtülip duralgasynda gurulýar. Web ýygnan portfolio web sahypasynda amala aşyrylýar.",
        "more_info1": "Has giňişleýin maglumat üçin okalma serediň",
        "more_info2": "Igoldaş programmirlemek manyly GitHub ammarlary.",
        "select_engine": "Motory saýlaň:",
        "tiger_code": "Igerolbars kody:",
        "run_tiger": "Igere işlediň",
        "output": "Çykyş:"
    },
    "tab": {
        "title": "Patrik Gudwin",
        "description": "Merkezi Florida esasly \"Florida\" -da doly programma inereneri"
    },
    "copy": {
        "text": "Göçürmek",
        "copied": "Göçürildi!"
    },
    "social_media": {
        "github": "Gitub",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Meni yzarla"
    },
    "languages": {
        "title": "Portfoliio",
        "description": "Portfelimiziň 100-den gowrak dile goldaw bilen dünýäniň dürli künjegine gelýänleri tapyň.",
        "global_accessibility": {
            "title": "Global elýeterliligi",
            "description": "Portfelim meniň dünýäniň dürli künjeginden gelenlere baryp bolýar. Bu köp enjamly çemeleşme, programma üpjünçiligini ýokarlandyrmak esasynda öz borçnamam bilen öz borçnamam görkezýär.",
            "stats": {
                "languages_supported": "Gol bilen goldanýar",
                "countries_represented": "Wekilçilik edýän ýurtlar",
                "continents_covered": "Konteýnerler ýapyldy"
            }
        },
        "features": {
            "title": "Aýratynlyklary",
            "items": [
                {
                    "title": "Hakyky terjime:",
                    "description": "Dil saýlawçysyna derrew daglary ýakyň"
                },
                {
                    "title": "URL-da esasly dil:",
                    "description": "Dil saýlawlary URL-de saklanýar"
                },
                {
                    "title": "Ýerli skript goldawy:",
                    "description": "Skriptleri arap, hytaý, hindi we şonça-da skriptleri dogry tassyklamak we ş.m."
                },
                {
                    "title": "Medeni duýgurlyk:",
                    "description": "Totalgalar diňe bir sözme-söz ýok diýmek, medeni kontekst barada medeni ünsi göz öňünde tutýar"
                },
                {
                    "title": "Seo optimallaşdyryldy:",
                    "description": "Her diliň görnüşi gözleg motorlary üçin optimallaşdyrylýar"
                }
            ]
        },
        "world_map": {
            "title": "Interaktiw dünýä kartasy",
            "description": "Goldawly dillerini görmek üçin kartadaky ýurtlarda ýurtlarda aýlanýar:",
            "languages_label": "Diller",
            "legend": {
                "supported": "Gol bilen goldanýar",
                "not_supported": "Dil goldawy ýok"
            },
            "zoom_controls": {
                "zoom_in": "Ulaltmak",
                "zoom_out": "Ulaltmak",
                "reset": "Täzeden düzmek"
            }
        },
        "supported_languages": {
            "title": "Goldanýan diller"
        },
        "interactive_country_map": {
            "title": "Interaktiw ýurt kartasy",
            "description": "Goldaw berýän dillerini görmek üçin aşakdaky ýurtlaryň üstünden geçiň:",
            "language_count": {
                "single": "dili",
                "multiple": "diller"
            }
        },
        "tooltips": {
            "no_language_support": "Dil goldawy ýok"
        }
    },
    "logotext": "Patrik"
}