{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Home",
        "about": "Tungkol sa akin",
        "portfolio": "Portfolio",
        "projects": "Mga proyekto sa website",
        "tiger": "Tiger Language",
        "portfolio_translator": "Tagasalin ng Portfolio",
        "formatter": "JSON & YAML formatter",
        "cube_solver": "Rubix Cube Solver",
        "contact": "Makipag -ugnay sa akin"
    },
    "home": {
        "title": "Home",
        "animated": {
            "first": "Buong Stack Software Engineer",
            "second": "Web developer",
            "third": "Developer ng laro",
            "fourth": "Lumikha ng Nilalaman"
        },
        "footer": "Ang website ngayon ay isinalin at avaliable sa 100+ wika!",
        "descriptionA": "Nakaranas ng full-stack software engineer at web developer na may isang ipinakita na kasaysayan ng matagumpay na nangungunang mga proyekto sa pag-unlad, mula sa paglikha ng mga pagbabago sa Java para sa Minecraft upang mapahusay ang karanasan ng gumagamit sa React.js at pagpapatupad ng mga Secure REST API, habang patuloy na gumagamit ng mga maliksi na pamamaraan at epektibong pakikipagtulungan ng koponan.",
        "descriptionB": "Bilang karagdagan, ako ay isang tagalikha ng nilalaman ng heograpiya na matagumpay na na -leverage ang mga algorithm ng maraming mga platform ng social media, kabilang ang Instagram, YouTube, at Tiktok, upang makakuha ng isang kagalang -galang at nakakaakit na base ng tagasunod.",
        "portfolio_button": "Ang aking portfolio",
        "contact_button": "Makipag -ugnay sa akin",
        "about_button": "Tungkol sa akin"
    },
    "about": {
        "title": "Tungkol sa akin",
        "personal_summary": {
            "title": "Personal na buod",
            "text": "Bilang isang nakaranas na buong developer ng software na nakabase sa Orlando, FL, ipinakita ko ang kadalubhasaan sa iba't ibang mga teknolohiya, mula sa Java at C ++ hanggang sa React.js at Node.js. Sa pamamagitan ng isang track record ng mga nangungunang mga proyekto, kabilang ang pagbuo ng isang programa ng pagbabago ng Java para sa Minecraft at isang reward na website para sa mga driver ng trak, ipinakita ko ang pamumuno at pagbabago. Ang aking pangako sa kahusayan ay maliwanag sa aking kakayahang mag-streamline ng pamamahala ng proyekto, malutas ang mga kumplikadong problema, at maghatid ng mga de-kalidad na solusyon na nagpapaganda ng karanasan ng gumagamit at magmaneho ng tagumpay sa organisasyon."
        },
        "professional_experience": {
            "title": "Propesyonal na karanasan",
            "entries": [
                {
                    "jobtitle": "Engineer ng Junior Software",
                    "where": "Orion180 Insurance",
                    "date": "2024 - Kasalukuyan"
                },
                {
                    "jobtitle": "Tagapagtatag at Buong Stack Software Developer",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Buong Stack Software Engineer",
                    "where": "Pabilisin ang pag -aaral",
                    "date": "2023"
                },
                {
                    "jobtitle": "Lead Web Developer (Program ng Mag -aaral)",
                    "where": "CLEMSON UNIVERSITY GDI Program",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Superbisor ng desk",
                    "where": "Clemson University",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Superbisor ng desk",
                    "where": "Clemson University",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Mga kasanayan sa teknikal",
            "header1": "Mga wika sa programming",
            "header2": "Frameworks & Libraries",
            "header3": "Mga tool at teknolohiya"
        },
        "services": {
            "title": "Ang aking mga serbisyo",
            "entries": [
                {
                    "title": "Buong stack engineering",
                    "text": "Nag-aalok ako ng mga komprehensibong solusyon sa buong front-end at back-end na pag-unlad, tinitiyak ang walang tahi na pagsasama at pag-andar sa buong buong stack ng software."
                },
                {
                    "title": "Pag -unlad ng Web",
                    "text": "Sa kadalubhasaan sa HTML, CSS, at mga frameworks ng JavaScript tulad ng React.js, gumawa ako ng biswal na nakakaakit at mga website na madaling gamitin upang matugunan ang mga tiyak na pangangailangan at kagustuhan ng mga kliyente."
                },
                {
                    "title": "Pag -unlad ng laro",
                    "text": "Ang mga wika ng pag -agaw tulad ng Java at C ++, dalubhasa ko sa paglikha ng mga nakaka -engganyong karanasan sa paglalaro, mula sa konsepto at disenyo hanggang sa pagpapatupad at pag -optimize, tinitiyak ang nakakaakit na gameplay at maayos na pagganap."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portfolio",
        "filter_by": "Filter Portfolio ni:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca Json",
                "text": "Isang proyekto ng Python na nag -streamline ng mga pagsasalin ng wika. Pinapayagan para sa aking portfolio ng website na isalin sa 70+ na wika, kabilang ang Espanyol, Pranses, Intsik, Arabe, at marami pang iba. Ang proyektong ito ay ginagamit upang lumikha ng isang portfolio ng multilingual website, na kung saan ay kapaki -pakinabang para maabot ang isang mas malawak na madla. Sa proyektong ito, higit sa 99% ng mundo ang mababasa ang aking portfolio sa isang matatas na wika.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Ikonekta ang apat",
                "text": "Napakalaking pamilya ng higit sa 50+ pagpapatupad ng Connect Apat na laro. Kasama sa proyektong ito ang mga pagpapatupad sa higit sa 30 iba't ibang mga wika sa programming, kabilang ang Java, C ++, Python, JavaScript, at marami pa. Bilang karagdagan, kasama rin dito ang higit sa 20+ iba't ibang mga frameworks o iba pang mga format, kabilang ang React.js, Ruby sa Riles, ASP.NET, at marami pa.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "Grocery app",
                "text": "Isang kumpletong full-stack .NET 9 Blazor Server application para sa pamamahala ng mga item sa groseri. Ang application ay sumusunod sa pattern ng controller/service/repositoryo na may core ng balangkas ng entidad para sa pagtitiyaga at may kasamang isang komprehensibong suite ng pagsubok.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Interop Project",
                "text": "Isang proyekto na dokumento ng interoperability sa pagitan ng iba't ibang mga wika ng programming. Kasalukuyan kasama ang 15 iba't ibang mga wika ng programming at 18 pattern ng pagpapatupad.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Rehistro ng imbentaryo",
                "text": "Ang isang buong-stack na Demo Point of Sale (POS) ay nagparehistro sa sistema ng pamamahala ng imbentaryo na binuo gamit ang Angular 17+ at Node.js. Ang application na ito ay nagpapakita ng isang propesyonal na grade POS system na may pagpapatunay ng gumagamit, control na batay sa pag-access sa papel, pagsubaybay sa imbentaryo, at pagproseso ng pagbabayad sa pagbabayad.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "JSON & YAML Auto Formatter",
                "text": "Isang Linter & Autoformatter para sa JSON & YAML Files. Ang proyektong ito ay ginagamit upang i -format ang mga file ng JSON & YAML, na kung saan ay kapaki -pakinabang para sa pagpapanatiling malinis at maayos ang code. Itinayo gamit ang Go, naipon sa WebAssembly, at naka -embed sa aking portfolio bilang isang proyekto sa website. Higit pang mga format na darating sa hinaharap.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON Generator",
                "text": "Magaan ang generator ng JSON na itinayo sa Python para sa Minecraft Resource & Data Packs. Ang proyektong ito ay ginagamit upang makabuo ng mga file ng JSON para sa mga Minecraft Mods, kabilang ang mga pasadyang item, bloke, at mga nilalang. Tunay na kapaki -pakinabang para sa hindi lamang paglikha ng mga pasadyang datapacks, ngunit para sa mga mod pati na rin sa pamamagitan ng tampok na paglipat ng pangalan ng mod.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Ang aking karanasan sa edukasyon",
                "text": "Sa tabi ng aking mga personal na proyekto, nakakuha din ako ng maraming mga kasanayan mula sa karanasan sa edukasyon. Mag -click dito upang tingnan ang aking profile sa LinkedIn para sa karagdagang impormasyon.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Ang aking propesyonal na karanasan",
                "text": "Sa tabi ng aking mga personal na proyekto, nakakuha din ako ng maraming mga kasanayan mula sa propesyonal na karanasan. Mag -click dito upang tingnan ang aking profile sa LinkedIn para sa karagdagang impormasyon.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Goodwin Portfolio Website",
                "text": "Ang website na ito ay ang aking personal na portfolio website, na binuo gamit ang React.js. Ang proyektong ito ay ginagamit upang ipakita ang aking mga kasanayan at proyekto, pati na rin upang magbigay ng isang platform para sa mga potensyal na employer na makipag -ugnay sa akin. Ang proyektong ito ay ginagamit upang lumikha ng isang propesyonal na pagkakaroon ng online.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Lua Script Library ni Patrick",
                "text": "Isang kapaki -pakinabang na aklatan ng mga script ng LUA para sa sanggunian sa hinaharap. Ang library na ito ay ginagamit upang i-automate ang mga gawain sa mga script ng LUA, na maaaring madaling gamitin para sa mga gawain na nangangailangan ng pagganap, dahil ang LUA ay karaniwang isang mas mabilis na wika ng script kaysa sa parehong Python at Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrick's Microsoft Excel Spreadsheet Scripts (VBA)",
                "text": "Isang kapaki -pakinabang na library ng mga script ng VBA para sa Microsoft Excel. Ang library na ito ay ginagamit upang i -automate ang mga gawain sa mga spreadsheet ng Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Neovim config ni Patrick",
                "text": "Ang aking personal na pagsasaayos ng Neovim. Ang proyektong ito ay ginagamit upang i -configure ang Neovim ayon sa gusto ko, kabilang ang mga pasadyang keybindings, tema, at plugin. Ang proyektong ito ay ginagamit upang gawing mas madaling gamitin ang Neovim at mahusay para sa aking personal na paggamit.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Generator ng mapa ni Patrick",
                "text": "Isang generator ng mapa ng Estados Unidos at estado, na binuo gamit ang Python gamit ang mga aklatan ng Geopandas at Matplotlib. Ang proyektong ito ay ginagamit upang makabuo ng mga mapa ng Estados Unidos, kabilang ang mga mapa ng county at estado. Ang proyektong ito ay ginagamit upang lumikha ng mga pasadyang mga mapa para sa visualization at pagsusuri ng data.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Library ng PowerShell Script ng Powershell",
                "text": "Isang kapaki -pakinabang na aklatan ng mga script ng PowerShell para sa sanggunian sa hinaharap. Kapaki -pakinabang sa tampok na $ profile script, nalaman ko ang napakalaking kapaki -pakinabang para sa pag -automate ng mga gawain mula sa windows terminal, dahil madalas akong gumagamit ng Windows OS.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Ruby Script Library ni Patrick",
                "text": "Isang kapaki -pakinabang na library ng mga script ng ruby ​​para sa sanggunian sa hinaharap. Kapaki -pakinabang para sa hinaharap na Ruby sa mga konsepto sa pag -unlad ng riles.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF Skills Builder",
                "text": "Ang isang pasadyang tagabuo ng PDF na binuo kasama ang Python sa pamamagitan ng mga extension ng Pdfkit at Jinja2, kasama ang pag -format ng HTML at JSON. Ang proyektong ito ay ginagamit upang makabuo ng mga file ng PDF mula sa isang listahan ng mga kasanayan at proyekto. Ang proyektong ito ay maaaring magamit upang lumikha ng isang pasadyang resume ng PDF, na kung saan ay kapaki -pakinabang para sa mga aplikasyon ng trabaho.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandel encryption Project",
                "text": "Isang pamilya ng 10+ pagpapatupad ng Rijandel encryption algorithm noong 128, 192, at 256 bits. Ang proyektong ito ay ginagamit upang ipakita ang Rijandel encryption algorithm sa iba't ibang mga wika ng programming. Ang proyektong ito ay ginagamit upang lumikha ng isang pamilya ng pagpapatupad ng algorithm ng Rijandel encryption.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod",
                "text": "Ang isang Minecraft mod na nagdaragdag ng mga pasadyang tool, nakasuot ng sandata, mob, bloke, sukat, at marami pang mga tampok sa laro. Itinayo gamit ang mga bersyon ng Java 8-17 para sa mga piling bersyon ng Minecraft sa pagitan ng 1.16 at 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Tiger Programming Language",
                "text": "Pasadyang wika ng programming na binuo sa parehong Go & Rust upang mag -eksperimento sa disenyo ng tagasalin at pagganap. Ipinatupad sa portfolio website gamit ang web assembly.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger Tailgating Pros Website",
                "text": "Ang isang website na itinayo ko noong 2024 para sa Tiger Tailgating Pros, isang tailgating company sa Clemson, SC. Itinayo gamit ang React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing Machine Project",
                "text": "Pamilya ng higit sa 30+ pagpapatupad ng Turing machine. Ginamit upang ipakita ang pagkumpleto ng turing para sa iba't ibang mga wika ng programming para sa pananaliksik, lalo na para sa wika ng Tiger programming.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Tiger Programming Language"
    },
    "contact": {
        "title": "Makipag -ugnay sa akin",
        "header": "Makipag -ugnay sa Impormasyon",
        "email": "pattygsocials@gmail.com",
        "description": "Tumugon ako sa mga pagtatanong mula sa email, mga mensahe ng LinkedIn, at mga mensahe sa Instagram. Tatawagan din ako kung ang aking numero ay ibinibigay sa pamamagitan ng resume o kung hindi man, kahit na mas gusto kong panatilihing pribado ang numero ng aking telepono."
    },
    "formatter": {
        "title": "JSON & YAML formatter",
        "description": "Ang JSON & YAML formatter ay isang tool na nagbibigay -daan sa iyo upang i -format ang mga file ng JSON at YAML. Ito ay itinayo gamit ang Go at WebAssembly, at ito ay dinisenyo upang maging mabilis at mahusay. Ang formatter ay idinisenyo upang madaling gamitin, na may isang simpleng interface na nagbibigay -daan sa iyo upang i -paste sa iyong JSON o YAML code at i -format ito gamit ang pag -click ng isang pindutan.",
        "more_info1": "Para sa karagdagang impormasyon, sumangguni sa readme sa",
        "more_info2": "JSON/YAML Formatter Repository.",
        "format_as": "Format bilang:",
        "auto_detect": "Auto detect",
        "format": "Format"
    },
    "cube_solver": {
        "title": "Rubix Cube Solver",
        "start": "Malutas"
    },
    "tiger": {
        "title": "Tiger Language",
        "description": "Ang Tiger Programming Language ay isang pasadyang wika ng programming na binuo sa parehong Go & Rust upang mag -eksperimento sa disenyo ng tagasalin at pagganap. Ipinatupad sa portfolio website gamit ang web assembly. Ang Tiger Programming Language ay isang pasadyang wika ng programming na binuo sa parehong Go & Rust upang mag -eksperimento sa disenyo ng tagasalin at pagganap. Ipinatupad sa portfolio website gamit ang web assembly.",
        "more_info1": "Para sa karagdagang impormasyon, sumangguni sa readme sa",
        "more_info2": "Tiger Programming Language GitHub Repository.",
        "select_engine": "Piliin ang Engine:",
        "tiger_code": "Tiger Code:",
        "run_tiger": "Patakbuhin ang Tiger",
        "output": "Output:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Buong Stack Software Engineer na nakabase sa Central Florida"
    },
    "copy": {
        "text": "Kopyahin",
        "copied": "Kinopya!"
    },
    "social_media": {
        "github": "Github",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Sundan mo ako"
    },
    "languages": {
        "title": "Tagasalin ng Portfolio",
        "description": "Tuklasin kung paano naa -access ang aking portfolio sa mga bisita mula sa buong mundo na may suporta para sa higit sa 100 mga wika.",
        "global_accessibility": {
            "title": "Pag -access sa Global",
            "description": "Ang aking portfolio ay magagamit sa higit sa {count} na wika, ginagawa itong ma -access sa mga bisita mula sa buong mundo. Ang pamamaraang ito ng multilingual ay nagpapakita ng aking pangako sa pagiging inclusivity at pandaigdigang pag -abot sa pag -unlad ng software.",
            "stats": {
                "languages_supported": "Suportado ang mga wika",
                "countries_represented": "Kinakatawan ng mga bansa",
                "continents_covered": "Sakop ang mga kontinente"
            }
        },
        "features": {
            "title": "Mga tampok",
            "items": [
                {
                    "title": "Pagsasalin sa real-time:",
                    "description": "Lumipat agad ang mga wika sa tagapili ng wika"
                },
                {
                    "title": "Wika na nakabase sa URL:",
                    "description": "Ang mga kagustuhan sa wika ay napanatili sa URL"
                },
                {
                    "title": "Suporta sa Native Script:",
                    "description": "Wastong pag -render ng mga script tulad ng Arabic, Intsik, Hindi, at marami pa"
                },
                {
                    "title": "Sensitibo sa kultura:",
                    "description": "Isinasaalang -alang ng mga pagsasalin ang konteksto ng kultura, hindi lamang mga literal na kahulugan"
                },
                {
                    "title": "SEO na -optimize:",
                    "description": "Ang bawat variant ng wika ay na -optimize para sa mga search engine"
                }
            ]
        },
        "world_map": {
            "title": "Interactive na mapa ng mundo",
            "description": "Mag -hover sa mga bansa sa mapa upang makita ang kanilang mga suportadong wika:",
            "languages_label": "Mga Wika",
            "legend": {
                "supported": "Suportado ang mga wika",
                "not_supported": "Walang suporta sa wika"
            },
            "zoom_controls": {
                "zoom_in": "Mag -zoom in",
                "zoom_out": "Mag -zoom out",
                "reset": "I -reset ang view"
            }
        },
        "supported_languages": {
            "title": "Mga suportadong wika"
        },
        "interactive_country_map": {
            "title": "Interactive na mapa ng bansa",
            "description": "Mag -hover sa mga bansa sa ibaba upang makita ang kanilang mga suportadong wika:",
            "language_count": {
                "single": "Wika",
                "multiple": "Mga Wika"
            }
        },
        "tooltips": {
            "no_language_support": "Walang suporta sa wika"
        }
    },
    "logotext": "Patrick"
}