{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Ev",
        "about": "Hakkımda",
        "portfolio": "Portföy",
        "projects": "Web sitesi projeleri",
        "tiger": "Kaplan dili",
        "formatter": "JSON & YAML FORMATER",
        "contact": "Benimle iletişime geç"
    },
    "home": {
        "title": "Ev",
        "animated": {
            "first": "Tam Yığın Yazılım Mühendisi",
            "second": "Web Geliştiricisi",
            "third": "Oyun geliştiricisi",
            "fourth": "İçerik Yaratıcısı"
        },
        "footer": "Web sitesi şimdi 100+ dilde tercüme edildi ve Avalable!",
        "descriptionA": "Minecraft için Java modifikasyonları oluşturmaktan React.js'de kullanıcı deneyimini geliştirmeye ve güvenli dinlenme API'lerini uygulamaya kadar başarılı bir şekilde önde gelen geliştirme projeleri geçmişine sahip tam yığın yazılım mühendisi ve web geliştiricisi deneyimli, sürekli olarak çevik metodolojiler ve etkili ekip işbirliği kullanır.",
        "descriptionB": "Buna ek olarak, saygın ve ilgi çekici bir takipçi tabanı kazanmak için Instagram, YouTube ve Tiktok da dahil olmak üzere birden fazla sosyal medya platformunun algoritmalarından başarılı bir şekilde yararlanan bir coğrafya içerik yaratıcısıyım.",
        "portfolio_button": "Portföyüm",
        "contact_button": "Benimle iletişime geç",
        "about_button": "Hakkımda"
    },
    "about": {
        "title": "Hakkımda",
        "personal_summary": {
            "title": "Kişisel özet",
            "text": "Orlando, FL merkezli deneyimli bir tam yığın yazılımı geliştiricisi olarak, Java ve C ++ 'dan React.js ve Node.js.'ye kadar çeşitli teknolojilerde uzmanlık gösterdim. Minecraft için bir Java modifikasyon programının geliştirilmesi ve kamyon şoförleri için ödüllendirici bir web sitesi de dahil olmak üzere öncü projelerin bir sicili ile liderlik ve yeniliği sergiledim. Mükemmelliğe olan bağlılığım, proje yönetimini kolaylaştırma, karmaşık sorunları çözme ve kullanıcı deneyimini geliştiren ve organizasyonel başarıyı artıran yüksek kaliteli çözümler sunma yeteneğimde belirgindir."
        },
        "professional_experience": {
            "title": "Mesleki Deneyim",
            "entries": [
                {
                    "jobtitle": "Genç yazılım mühendisi",
                    "where": "Orion180 Sigorta",
                    "date": "2024 - Mevcut"
                },
                {
                    "jobtitle": "Kurucu ve Full Stack Yazılım Geliştiricisi",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Tam Yığın Yazılım Mühendisi",
                    "where": "Öğrenmeyi hızlandır",
                    "date": "2023"
                },
                {
                    "jobtitle": "Lider Web Geliştiricisi (Öğrenci Programı)",
                    "where": "Clemson Üniversitesi GDI programı",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Masa süpervizörü",
                    "where": "Clemson Üniversitesi",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Teknik beceriler",
            "header1": "Programlama Dilleri",
            "header2": "Çerçeveler ve Kütüphaneler",
            "header3": "Araçlar ve Teknolojiler"
        },
        "services": {
            "title": "Hizmetlerim",
            "entries": [
                {
                    "title": "Tam Yığın Mühendisliği",
                    "text": "Tüm yazılım yığını boyunca kesintisiz entegrasyon ve işlevsellik sağlayarak hem ön uç hem de arka uç geliştirmede kapsamlı çözümler sunuyorum."
                },
                {
                    "title": "Web Geliştirme",
                    "text": "React.js gibi HTML, CSS ve JavaScript çerçevelerinde uzmanlıkla, müşterilerin özel ihtiyaçlarını ve tercihlerini karşılamak için tasarlanmış görsel olarak çekici ve kullanıcı dostu web siteleri hazırlıyorum."
                },
                {
                    "title": "Oyun geliştirme",
                    "text": "Java ve C ++ gibi dillerden yararlanarak, konsept ve tasarımdan uygulama ve optimizasyona kadar sürükleyici oyun deneyimleri yaratma konusunda uzmanlaşıyorum, ilgi çekici oyun ve sorunsuz performans sağlıyor."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Portföy",
        "filter_by": "Filtre portföyü:",
        "entries": {
            "biblioteca": {
                "title": "Biblioteca Json",
                "text": "Dil çevirilerini kolaylaştıran bir Python projesi. Web sitemin portföyümün İspanyolca, Fransızca, Çince, Arapça ve diğerleri de dahil olmak üzere 70'den fazla dile çevrilmesine izin veriyor. Bu proje, daha geniş bir kitleye ulaşmak için çok yararlı olan çok dilli bir web sitesi portföyü oluşturmak için kullanılır. Bu proje ile dünyanın% 99'undan fazlası portföyümü akıcı bir dilde okuyabilir.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Dörtlü Bağlayın",
                "text": "Connect Four Game'in 50'den fazla uygulamadan oluşan büyük bir aile. Bu proje, Java, C ++, Python, JavaScript ve daha fazlası dahil olmak üzere 30'dan fazla farklı programlama dilindeki uygulamaları içerir. Ayrıca, React.js, Ruby On Rails, ASP.NET ve daha fazlası dahil olmak üzere 20'den fazla farklı çerçeve veya diğer formatları da içerir.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Interop Proje",
                "text": "Farklı programlama dilleri arasında birlikte çalışabilirliği belgeleyen bir proje. Şu anda 15 farklı programlama dili ve 18 yürütme paterni içermektedir.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "JSON & YAML AUTO FORMATER",
                "text": "JSON & YAML dosyaları için bir Linter & Autoformatter. Bu proje, kodu temiz ve düzenli tutmak için çok yararlı olan JSON & YAML dosyalarını biçimlendirmek için kullanılır. Go ile inşa edilmiş, WebAssembly ile derlenmiş ve bir web sitesi projesi olarak portföyüme gömülmüştür. Gelecekte daha fazla format gelecek.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft JSON Jeneratörü",
                "text": "Minecraft Kaynak ve Veri Paketleri için Python'da inşa edilmiş hafif JSON Jeneratörü. Bu proje, özel öğeler, bloklar ve varlıklar dahil olmak üzere Minecraft modları için JSON dosyaları oluşturmak için kullanılır. Sadece özel veri paketleri oluşturmak için değil, modlar için de MOD adı anahtarlama özelliği aracılığıyla çok kullanışlıdır.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Eğitim deneyimim",
                "text": "Kişisel projelerimin yanı sıra, eğitim deneyiminden çok sayıda beceri kazandım. Daha fazla bilgi için LinkedIn profilimi görüntülemek için buraya tıklayın.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Mesleki deneyimim",
                "text": "Kişisel projelerimin yanı sıra, mesleki deneyimlerden çok sayıda beceri kazandım. Daha fazla bilgi için LinkedIn profilimi görüntülemek için buraya tıklayın.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick Goodwin portföy web sitesi",
                "text": "Bu web sitesi React.js ile inşa edilmiş kişisel portföy web sitem. Bu proje, becerilerimi ve projelerimi sergilemek ve potansiyel işverenlerin benimle iletişime geçmesi için bir platform sağlamak için kullanılır. Bu proje profesyonel bir çevrimiçi varlık yaratmak için kullanılır.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patrick'in Lua Script Kütüphanesi",
                "text": "Gelecekteki referans için LUA senaryolarının kullanışlı bir kütüphanesi. Bu kütüphane, Lua genellikle hem Python hem de Ruby'den daha hızlı bir komut dosyası dili olduğu için, performans ihtiyatlı görevler için kullanışlı olabilen LUA komut dosyalarındaki görevleri otomatikleştirmek için kullanılır.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Patrick'in Microsoft Excel Elektronik Tablo Komut Dosyaları (VBA)",
                "text": "Microsoft Excel için VBA komut dosyalarının kullanışlı bir kütüphanesi. Bu kütüphane, Excel elektronik tablolarındaki görevleri otomatikleştirmek için kullanılır.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Patrick'in Neovim Config",
                "text": "Kişisel Neovim yapılandırmam. Bu proje, özel anahtarbindings, temalar ve eklentiler de dahil olmak üzere Neovim'i beğenime göre yapılandırmak için kullanılır. Bu proje, Neovim'i kişisel kullanımım için daha kullanıcı dostu ve verimli hale getirmek için kullanılır.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patrick'in Harita Üreticisi",
                "text": "Geopandas ve Matplotlib kütüphaneleri kullanılarak Python ile inşa edilen bir Birleşik Devletler İlçe ve Eyalet Haritası Jeneratörü. Bu proje, ilçe ve eyalet haritaları da dahil olmak üzere Amerika Birleşik Devletleri haritalarını oluşturmak için kullanılır. Bu proje, veri görselleştirme ve analiz için özel haritalar oluşturmak için kullanılır.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Patrick'in PowerShell Script Kütüphanesi",
                "text": "Gelecekteki referans için yararlı bir PowerShell betiği kütüphanesi. $ Profil Komut Dosyası özelliği ile faydalı olan, Windows işletim sisteminin sık kullanıcısı olduğum için Windows terminalinden görevleri otomatikleştirmek için son derece yararlı buluyorum.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Patrick's Ruby Script Kütüphanesi",
                "text": "Gelecekteki referans için yararlı bir yakut komut dosyası kütüphanesi. Gelecekteki Ruby on Rails gelişim kavramları için kullanışlıdır.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF Skills Builder",
                "text": "HTML ve JSON biçimlendirmesinin yanı sıra PDFKIT ve Jinja2 uzantıları aracılığıyla Python ile inşa edilmiş özel bir PDF oluşturucu. Bu proje, beceri ve projeler listesinden PDF dosyaları oluşturmak için kullanılır. Bu proje, iş uygulamaları için çok yararlı olan özel bir PDF özgeçmişi oluşturmak için kullanılabilir.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Rijandel Şifreleme Projesi",
                "text": "128, 192 ve 256 bitte Rijandel şifreleme algoritmasının 10+ uygulaması olan bir aile. Bu proje, farklı programlama dillerinde Rijandel şifreleme algoritmasını göstermek için kullanılır. Bu proje, Rijandel şifreleme algoritmasının bir uygulama ailesi oluşturmak için kullanılır.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Modu",
                "text": "Oyuna özel araçlar, zırh, çeteler, bloklar, boyutlar ve daha birçok özellik ekleyen bir Minecraft modu. 1.16 ile 1.20 arasında seçkin Minecraft sürümleri için Java sürümleri 8-17 ile inşa edilmiştir.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Kaplan Programlama Dili",
                "text": "Tercüman tasarımı ve performansını denemek için GO & Rust'ta inşa edilmiş özel programlama dili. Web Assembly kullanarak portföy web sitesinde uygulanır.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger Bagaj Kaplama Artıları Web Sitesi",
                "text": "2024 yılında Clemson, SC'de bir bagaj kapısı şirketi olan Tiger Taggating Pros için inşa ettiğim bir web sitesi. React.js ile inşa edildi.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Turing Makinesi Projesi",
                "text": "Turing makinesinin 30'dan fazla uygulamanın ailesi. Araştırma için, özellikle Tiger programlama dili için farklı programlama dilleri için Turing bütünlüğünü göstermek için kullanılır.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Kaplan Programlama Dili"
    },
    "contact": {
        "title": "Benimle iletişime geç",
        "header": "İletişim bilgileri",
        "email": "pattygsocials@gmail.com",
        "description": "E -posta, LinkedIn mesajları ve Instagram mesajlarından gelen sorulara yanıt veriyorum. Telefon numaramı özel tutmayı tercih etsem de, numaram özgeçmiş yoluyla veya başka bir şekilde sağlanırsa da geri arayacağım."
    },
    "formatter": {
        "title": "JSON & YAML FORMATER",
        "description": "JSON & YAML Formatter, JSON ve YAML dosyalarını biçimlendirmenizi sağlayan bir araçtır. Go ve Webassembly ile inşa edilmiştir ve hızlı ve verimli olacak şekilde tasarlanmıştır. Formatter, JSON veya YAML kodunuza yapıştırmanıza ve bir düğmeye tıklamayla biçimlendirmenizi sağlayan basit bir arayüzle kullanımı kolay olacak şekilde tasarlanmıştır.",
        "more_info1": "Daha fazla bilgi için,",
        "more_info2": "JSON/YAML FORMATER DEVLİĞİ.",
        "format_as": "AS format:",
        "auto_detect": "Otomatik algılama",
        "format": "Biçim"
    },
    "tiger": {
        "title": "Kaplan dili",
        "description": "Tiger programlama dili, tercüman tasarımı ve performansını denemek için Go & Rust'ta inşa edilmiş özel bir programlama dilidir. Web Assembly kullanarak portföy web sitesinde uygulanır. Tiger programlama dili, tercüman tasarımı ve performansını denemek için Go & Rust'ta inşa edilmiş özel bir programlama dilidir. Web Assembly kullanarak portföy web sitesinde uygulanır.",
        "more_info1": "Daha fazla bilgi için,",
        "more_info2": "Tiger Programlama Dili GitHub Deposu.",
        "select_engine": "Motor seçin:",
        "tiger_code": "Kaplan Kodu:",
        "run_tiger": "Tiger Run",
        "output": "Çıktı:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Central Florida merkezli tam yığın yazılım mühendisi"
    },
    "copy": {
        "text": "Kopya",
        "copied": "Kopyalı!"
    },
    "social_media": {
        "github": "Gitithub",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Beni takip et"
    },
    "logotext": "Patrick"
}