{
    "name": "Патрік Гудвін",
    "menu": {
        "home": "Домашній",
        "about": "Про мене",
        "portfolio": "Портфоліо",
        "projects": "Проекти веб -сайтів",
        "tiger": "Тигрова мова",
        "portfolio_translator": "Перекладач портфоліо",
        "formatter": "JSON & YAML Форматер",
        "cube_solver": "Rubix Cube Solver",
        "contact": "Зв’яжіться зі мною"
    },
    "home": {
        "title": "Домашній",
        "animated": {
            "first": "Повний інженер програмного забезпечення Stack",
            "second": "Веб -розробник",
            "third": "Розробник гри",
            "fourth": "Творець вмісту"
        },
        "footer": "Зараз веб -сайт перекладений та доступний на 100+ мовами!",
        "descriptionA": "Досвідчений інженер з програмного забезпечення та веб-розробника з продемонстрованою історією успішних провідних проектів з розвитку-від створення модифікацій Java для Minecraft до покращення досвіду користувачів у react.js та впровадження безпечних API відпочинку, одночасно використовуючи гнучкі методології та ефективну співпрацю в команді.",
        "descriptionB": "Крім того, я є творцем вмісту географії, який успішно використовував алгоритми декількох платформ соціальних медіа, включаючи Instagram, YouTube та Tiktok, щоб отримати поважну та захоплюючу базу послідовників.",
        "portfolio_button": "Моє портфоліо",
        "contact_button": "Зв’яжіться зі мною",
        "about_button": "Про мене"
    },
    "about": {
        "title": "Про мене",
        "personal_summary": {
            "title": "Особистий підсумок",
            "text": "Як досвідчений розробник програмного забезпечення повного стека, що базується в Орландо, штат Флорида, я продемонстрував досвід у різних технологіях, від Java та C ++ до React.js та Node.js. Завдяки досвіду проектів, що очолюють, включаючи розробку програми модифікації Java для Minecraft та корисний веб -сайт для водіїв вантажних автомобілів, я демонстрував лідерство та інновації. Моя прихильність до досконалості очевидна в моїй здатності впорядкувати управління проектами, вирішувати складні проблеми та надавати якісні рішення, що покращують досвід користувачів та досягають організаційного успіху."
        },
        "professional_experience": {
            "title": "Професійний досвід",
            "entries": [
                {
                    "jobtitle": "Молодший інженер програмного забезпечення",
                    "where": "Orion180 страхування",
                    "date": "2024 - Присутній"
                },
                {
                    "jobtitle": "Засновник та розробник програмного забезпечення Full Stack",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Повний інженер програмного забезпечення Stack",
                    "where": "Прискорення навчання",
                    "date": "2023"
                },
                {
                    "jobtitle": "Провідний веб -розробник (студентська програма)",
                    "where": "Програма GDI університету Клемсона",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Наглядач настільних",
                    "where": "Університет Клемсона",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Наглядач настільних",
                    "where": "Університет Клемсона",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Технічні навички",
            "header1": "Мови програмування",
            "header2": "Рамки та бібліотеки",
            "header3": "Інструменти та технології"
        },
        "services": {
            "title": "Мої послуги",
            "entries": [
                {
                    "title": "Повна інженерія",
                    "text": "Я пропоную комплексні рішення як на передній, так і на задній розробці, забезпечуючи безшовну інтеграцію та функціональність у всьому стеку програмного забезпечення."
                },
                {
                    "title": "Веб -розробка",
                    "text": "Маючи досвід роботи в рамках HTML, CSS та JavaScript, таких як React.js, я створюю візуально привабливі та зручні веб-сайти, пристосовані для задоволення конкретних потреб та уподобань клієнтів."
                },
                {
                    "title": "Розробка ігор",
                    "text": "Використовуючи такі мови, як Java та C ++, я спеціалізуюся на створенні занурених ігор, від концепції та дизайну до впровадження та оптимізації, забезпечуючи залучення геймплея та плавної продуктивності."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Портфоліо",
        "filter_by": "Портфоліо фільтрів:",
        "entries": {
            "biblioteca": {
                "title": "Json Biblioteca",
                "text": "Проект Python, який впорядковує мовні переклади. Дозволяє перекладати портфоліо мого веб -сайту на 70+ мов, включаючи іспанську, французьку, китайську, арабську та багато інших. Цей проект використовується для створення багатомовного портфоліо веб -сайтів, що дуже корисно для досягнення широкої аудиторії. За допомогою цього проекту понад 99% світу можуть прочитати моє портфоліо вільною мовою.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Підключіть чотири",
                "text": "Масивна родина з понад 50+ реалізацій Connect Four Game. Цей проект включає реалізації в понад 30 різних мовах програмування, включаючи Java, C ++, Python, JavaScript тощо. Крім того, він також включає понад 20+ різних рамок або інших форматів, включаючи React.js, Ruby на Rails, ASP.NET тощо.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "Продуктовий додаток",
                "text": "Повна додаткова програма .NET 9 Blazor Server для управління продуктами. Додаток дотримується схеми контролера/служби/сховища з основним ядром сутності для стійкості та включає всебічний тестовий набір.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Проект Interop",
                "text": "Проект, який документує сумісність між різними мовами програмування. В даний час включає 15 різних мов програмування та 18 моделей виконання.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Реєстр інвентаризації",
                "text": "Повна стекла демонстраційна точка продажу (POS) Зареєструйтесь із системою управління запасами, побудованою з Angular 17+ та Node.js. Цей додаток демонструє POS-систему професійного класу з автентифікацією користувачів, контролем доступу на основі ролей, відстеженням запасів та макетною обробкою платежів.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "JSON & YAML Auto Formatter",
                "text": "Підкладка та автофордатер для файлів JSON та YAML. Цей проект використовується для формування файлів JSON та YAML, що дуже корисно для збереження чистого та організованого коду. Побудований з GO, складеного з WebAssembly, і вбудований у мій портфоліо як проект веб -сайту. Більше форматів, що надходять у майбутньому.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Generator Minecraft JSON",
                "text": "Легкий генератор JSON, вбудований у Python для пакетів ресурсів та даних Minecraft. Цей проект використовується для створення файлів JSON для модів Minecraft, включаючи власні елементи, блоки та об'єкти. Дуже корисно не лише для створення спеціальних даних DataPacks, але і для мод, а також функцією комутації імен мод.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Мій навчальний досвід",
                "text": "Поряд з моїми особистими проектами, я також здобув численні навички з навчального досвіду. Клацніть тут, щоб переглянути мій профіль LinkedIn для отримання додаткової інформації.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Мій професійний досвід",
                "text": "Поряд зі своїми особистими проектами, я також здобув численні навички з професійного досвіду. Клацніть тут, щоб переглянути мій профіль LinkedIn для отримання додаткової інформації.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Веб -сайт портфоліо Патріка Гудвіна",
                "text": "Цей веб -сайт - це мій веб -сайт особистого портфоліо, побудований з react.js. Цей проект використовується для демонстрації моїх навичок та проектів, а також для надання платформи для потенційних роботодавців, щоб зв’язатися зі мною. Цей проект використовується для створення професійної присутності в Інтернеті.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Бібліотека сценаріїв Патріка Луа",
                "text": "Корисна бібліотека сценаріїв LUA для подальшої довідки. Ця бібліотека використовується для автоматизації завдань у сценаріях LUA, які можуть стати в нагоді для завдань на бездоганні, оскільки LUA, як правило, є швидшою мовою сценаріїв, ніж і Python, і Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Сценарії електронних таблиць Microsoft Excel Patrick (VBA)",
                "text": "Корисна бібліотека сценаріїв VBA для Microsoft Excel. Ця бібліотека використовується для автоматизації завдань у електронних таблицях Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Конфігурація Neovim Patrick",
                "text": "Моя особиста конфігурація Neovim. Цей проект використовується для налаштування Neovim на мій смак, включаючи власні клавіші, теми та плагіни. Цей проект використовується для того, щоб зробити Neovim більш зручним та ефективним для мого особистого використання.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Генератор карт Патріка",
                "text": "Генератор карт округу та державних карт США, побудований з Python, використовуючи бібліотеки Geopandas та Matplotlib. Цей проект використовується для створення карт США, включаючи графські та державні карти. Цей проект використовується для створення спеціальних карт для візуалізації та аналізу даних.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Бібліотека сценаріїв Патріка PowerShell",
                "text": "Корисна бібліотека сценаріїв PowerShell для подальшої довідки. Корисно з функцією $ профілю, я вважаю це надзвичайно корисним для автоматизації завдань з терміналу Windows, оскільки я є частим користувачем ОС Windows.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Бібліотека сценаріїв Патріка Рубі",
                "text": "Корисна бібліотека сценаріїв Ruby для подальшої довідки. Корисно для майбутніх концепцій розвитку Raby на Rails.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "PDF навичок будівельника",
                "text": "Спеціальний будівельник PDF, побудований з Python через розширення PDFKIT та Jinja2, поряд із форматуванням HTML та JSON. Цей проект використовується для створення PDF -файлів зі списку навичок та проектів. Цей проект може бути використаний для створення спеціального резюме PDF, що дуже корисно для додатків для роботи.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Проект шифрування Rijandel",
                "text": "Сім'я з 10+ реалізацій алгоритму шифрування Ріджанда в 128, 192 та 256 бітах. Цей проект використовується для демонстрації алгоритму шифрування Rijandel в різних мовах програмування. Цей проект використовується для створення сім'ї реалізації алгоритму шифрування Ріданделя.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod",
                "text": "Minecraft Mod, який додає спеціальні інструменти, броні, моби, блоки, розміри та багато інших функцій гри. Побудований з версіями Java 8-17 для вибраних версій Minecraft між 1,16 та 1,20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Мова програмування тигра",
                "text": "Спеціальна мова програмування, побудована як в Go & rust, для експерименту з дизайном та продуктивністю інтерпретатора. Реалізовано на веб -сайті портфоліо за допомогою веб -зборів.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Веб -сайт тигрів хвостів",
                "text": "Веб -сайт, який я створив у 2024 році для Tiger Tailgating Pro, компанія, що займається хвостом у Клемсоні, штат Каліфорнія. Побудований з react.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Проект Turing Machine",
                "text": "Сім'я з понад 30+ реалізацій машини Тьюрінга. Використовується для демонстрації повноти Turing для різних мов програмування для досліджень, особливо для мови програмування тигра.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Мова програмування тигра"
    },
    "contact": {
        "title": "Зв’яжіться зі мною",
        "header": "Контактна інформація",
        "email": "pattygsocials@gmail.com",
        "description": "Я відповідаю на запити з електронної пошти, повідомлень LinkedIn та Instagram -повідомлень. Я також передзвоню, якщо мій номер буде наданий через резюме чи іншим чином, хоча я вважаю за краще тримати свій номер телефону приватним."
    },
    "formatter": {
        "title": "JSON & YAML Форматер",
        "description": "Formatter JSON & YAML - це інструмент, який дозволяє форматувати файли JSON та YAML. Він побудований з GO та WebAssembly, і він призначений для швидкого та ефективного. Форматер призначений для простих у використанні, за допомогою простого інтерфейсу, який дозволяє вставити свій код JSON або YAML та форматувати його за допомогою кнопки кнопки.",
        "more_info1": "Для отримання додаткової інформації див. Readme у",
        "more_info2": "Сховище форматеріалів JSON/YAML.",
        "format_as": "Формат як:",
        "auto_detect": "Автоматичне виявлення",
        "format": "Формат"
    },
    "cube_solver": {
        "title": "Rubix Cube Solver",
        "start": "Вирішити"
    },
    "tiger": {
        "title": "Тигрова мова",
        "description": "Мова програмування тигра - це спеціальна мова програмування, побудована як в Go & rust, для експерименту з дизайном та продуктивністю інтерпретатора. Реалізовано на веб -сайті портфоліо за допомогою веб -зборів. Мова програмування тигра - це спеціальна мова програмування, побудована як в Go & rust, для експерименту з дизайном та продуктивністю інтерпретатора. Реалізовано на веб -сайті портфоліо за допомогою веб -зборів.",
        "more_info1": "Для отримання додаткової інформації див. Readme у",
        "more_info2": "Мова програмування тигра Гітубу.",
        "select_engine": "Виберіть Двигун:",
        "tiger_code": "Тигровий код:",
        "run_tiger": "Бігати тигр",
        "output": "Вихід:"
    },
    "tab": {
        "title": "Патрік Гудвін",
        "description": "Повний інженер програмного забезпечення, що базується в Центральній Флориді"
    },
    "copy": {
        "text": "Копіювати",
        "copied": "Скопіюється!"
    },
    "social_media": {
        "github": "Гітб",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Тикток",
        "youtube": "YouTube",
        "text_strip": "Слідуйте за мною"
    },
    "languages": {
        "title": "Перекладач портфоліо",
        "description": "Дізнайтеся, як моє портфоліо доступне для відвідувачів з усього світу з підтримкою понад 100 мов.",
        "global_accessibility": {
            "title": "Глобальна доступність",
            "description": "Моє портфоліо доступний на мові понад {count}, що робить його доступним для відвідувачів з усього світу. Цей багатомовний підхід демонструє мою прихильність до інклюзивності та глобального охоплення в розробці програмного забезпечення.",
            "stats": {
                "languages_supported": "Мови, що підтримуються",
                "countries_represented": "Представлені країни",
                "continents_covered": "Покриті континенти"
            }
        },
        "features": {
            "title": "Особливості",
            "items": [
                {
                    "title": "Переклад у режимі реального часу:",
                    "description": "Миттєво перемикайте мови за допомогою вибору мови"
                },
                {
                    "title": "На основі URL-адреси:",
                    "description": "Мовні переваги зберігаються в URL -адресі"
                },
                {
                    "title": "Підтримка рідного сценарію:",
                    "description": "Належне візуалізація таких сценаріїв, як арабська, китайська, хінді та багато іншого"
                },
                {
                    "title": "Культурна чутливість:",
                    "description": "Переклади розглядають культурний контекст, а не лише буквальні значення"
                },
                {
                    "title": "SEO оптимізований:",
                    "description": "Кожен мовний варіант оптимізований для пошукових систем"
                }
            ]
        },
        "world_map": {
            "title": "Інтерактивна карта світу",
            "description": "Наведіть курсор над країнами на карті, щоб побачити їх підтримувані мови:",
            "languages_label": "Мови",
            "legend": {
                "supported": "Мови, що підтримуються",
                "not_supported": "Немає мовної підтримки"
            },
            "zoom_controls": {
                "zoom_in": "Збільшувати",
                "zoom_out": "Масштабувати",
                "reset": "Скидання перегляду"
            }
        },
        "supported_languages": {
            "title": "Підтримувані мови"
        },
        "interactive_country_map": {
            "title": "Інтерактивна карта країни",
            "description": "Наведіть курсор над країнами нижче, щоб побачити їх підтримувані мови:",
            "language_count": {
                "single": "мова",
                "multiple": "мови"
            }
        },
        "tooltips": {
            "no_language_support": "Немає мовної підтримки"
        }
    },
    "logotext": "Патрік"
}