{
    "name": "Patrick Goodwin",
    "menu": {
        "home": "Trang chủ",
        "about": "Về tôi",
        "portfolio": "Danh mục đầu tư",
        "projects": "Dự án trang web",
        "tiger": "Ngôn ngữ hổ",
        "portfolio_translator": "Danh mục đầu tư dịch",
        "formatter": "Json & Yaml định dạng",
        "cube_solver": "Bộ giải Rubix Cube",
        "contact": "Liên hệ với tôi"
    },
    "home": {
        "title": "Trang chủ",
        "animated": {
            "first": "Kỹ sư phần mềm Stack đầy đủ",
            "second": "Nhà phát triển web",
            "third": "Nhà phát triển trò chơi",
            "fourth": "Người tạo nội dung"
        },
        "footer": "Trang web hiện được dịch & có giá trị bằng hơn 100 ngôn ngữ!",
        "descriptionA": "Kỹ sư phần mềm và nhà phát triển web đầy đủ kinh nghiệm với lịch sử đã được chứng minh về các dự án phát triển hàng đầu thành công, từ việc tạo sửa đổi Java cho Minecraft để nâng cao trải nghiệm người dùng trong React.js và triển khai API REST an toàn, đồng thời sử dụng các phương pháp Agile và hợp tác nhóm hiệu quả.",
        "descriptionB": "Ngoài ra, tôi là một người tạo nội dung địa lý, người đã tận dụng thành công các thuật toán của nhiều nền tảng truyền thông xã hội, bao gồm Instagram, YouTube và Tiktok, để có được một cơ sở người theo dõi đáng kính và hấp dẫn.",
        "portfolio_button": "Danh mục đầu tư của tôi",
        "contact_button": "Liên hệ với tôi",
        "about_button": "Về tôi"
    },
    "about": {
        "title": "Về tôi",
        "personal_summary": {
            "title": "Tóm tắt cá nhân",
            "text": "Là một nhà phát triển phần mềm Stack có kinh nghiệm có trụ sở tại Orlando, FL, tôi đã thể hiện chuyên môn về các công nghệ khác nhau, từ Java và C ++ đến React.js và Node.js. Với hồ sơ theo dõi các dự án dẫn đầu, bao gồm cả việc phát triển chương trình sửa đổi Java cho Minecraft và một trang web bổ ích cho các tài xế xe tải, tôi đã trình diễn sự lãnh đạo và đổi mới. Cam kết của tôi về sự xuất sắc là rõ ràng trong khả năng hợp lý hóa quản lý dự án, giải quyết các vấn đề phức tạp và cung cấp các giải pháp chất lượng cao giúp nâng cao trải nghiệm người dùng và thúc đẩy thành công của tổ chức."
        },
        "professional_experience": {
            "title": "Kinh nghiệm chuyên môn",
            "entries": [
                {
                    "jobtitle": "Kỹ sư phần mềm Junior",
                    "where": "Bảo hiểm Orion180",
                    "date": "2024 - hiện tại"
                },
                {
                    "jobtitle": "Người sáng lập & Nhà phát triển phần mềm Full Stack",
                    "where": "Suprememc",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Kỹ sư phần mềm Stack đầy đủ",
                    "where": "Tăng tốc học tập",
                    "date": "2023"
                },
                {
                    "jobtitle": "Nhà phát triển web chính (Chương trình sinh viên)",
                    "where": "Chương trình GDI của Đại học Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Giám sát bàn",
                    "where": "Đại học Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Giám sát bàn",
                    "where": "Đại học Clemson",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Kỹ năng kỹ thuật",
            "header1": "Ngôn ngữ lập trình",
            "header2": "Khung & Thư viện",
            "header3": "Công cụ & Công nghệ"
        },
        "services": {
            "title": "Dịch vụ của tôi",
            "entries": [
                {
                    "title": "Kỹ thuật ngăn xếp đầy đủ",
                    "text": "Tôi cung cấp các giải pháp toàn diện trên cả phát triển mặt trước và đầu cuối, đảm bảo tích hợp và chức năng liền mạch trong toàn bộ ngăn xếp phần mềm."
                },
                {
                    "title": "Phát triển web",
                    "text": "Với chuyên môn về các khung HTML, CSS và JavaScript như React.js, tôi tạo ra các trang web trực quan và thân thiện với người dùng phù hợp để đáp ứng nhu cầu và sở thích cụ thể của khách hàng."
                },
                {
                    "title": "Phát triển trò chơi",
                    "text": "Tận dụng các ngôn ngữ như Java và C ++, tôi chuyên tạo ra trải nghiệm chơi game nhập vai, từ khái niệm và thiết kế đến thực hiện và tối ưu hóa, đảm bảo chơi trò chơi hấp dẫn và hiệu suất suôn sẻ."
                }
            ]
        }
    },
    "portfolio": {
        "title": "Danh mục đầu tư",
        "filter_by": "Lọc danh mục đầu tư bằng cách:",
        "entries": {
            "biblioteca": {
                "title": "BIBLIOTECA JSON",
                "text": "Một dự án Python hợp lý hóa các bản dịch ngôn ngữ. Cho phép danh mục trang web của tôi được dịch sang hơn 70 ngôn ngữ, bao gồm tiếng Tây Ban Nha, tiếng Pháp, tiếng Trung, tiếng Ả Rập và nhiều ngôn ngữ khác. Dự án này được sử dụng để tạo ra một danh mục trang web đa ngôn ngữ, rất hữu ích cho việc tiếp cận đối tượng rộng hơn. Với dự án này, hơn 99% thế giới có thể đọc danh mục đầu tư của tôi bằng ngôn ngữ thông thạo.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Kết nối bốn",
                "text": "Gia đình lớn hơn hơn 50 triển khai của Bốn kết nối. Dự án này bao gồm các triển khai trong hơn 30 ngôn ngữ lập trình khác nhau, bao gồm Java, C ++, Python, JavaScript, v.v. Ngoài ra, nó cũng bao gồm hơn 20 khung hình khác nhau hoặc các định dạng khác, bao gồm React.js, Ruby on Rails, ASP.NET, v.v.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "grocery_app": {
                "title": "Ứng dụng tạp hóa",
                "text": "Một ứng dụng máy chủ Blazor đầy đủ đầy đủ .NET 9 để quản lý các mặt hàng tạp hóa. Ứng dụng tuân theo mẫu bộ điều khiển/dịch vụ/kho lưu trữ với lõi khung thực thể cho sự kiên trì và bao gồm bộ thử nghiệm toàn diện.",
                "link": "https://github.com/pattygcoding/Grocery-App-Blazor"
            },
            "interop": {
                "title": "Dự án Interop",
                "text": "Một dự án có khả năng tương tác giữa các ngôn ngữ lập trình khác nhau. Hiện tại bao gồm 15 ngôn ngữ lập trình khác nhau và 18 mẫu thực thi.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "inventory_register": {
                "title": "Đăng ký kiểm kê",
                "text": "Đăng ký Demo Point of Bán hàng (POS) đầy đủ với hệ thống quản lý hàng tồn kho được xây dựng với Angular 17+ và Node.js. Ứng dụng này cho thấy một hệ thống POS cấp chuyên nghiệp với xác thực người dùng, kiểm soát truy cập dựa trên vai trò, theo dõi hàng tồn kho và xử lý thanh toán giả.",
                "link": "https://github.com/pattygcoding/Restaurant-Inventory-Register"
            },
            "formatter": {
                "title": "Json & Yaml Auto Formatter",
                "text": "Một linter & autoformatter cho các tệp json & yaml. Dự án này được sử dụng để định dạng các tệp JSON & YAML, rất hữu ích để giữ cho mã sạch sẽ và được tổ chức. Được xây dựng với GO, được biên dịch với WebAssugging và được nhúng vào danh mục đầu tư của tôi như một dự án trang web. Nhiều định dạng sẽ đến trong tương lai.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Máy phát điện JSON Minecraft",
                "text": "Trình tạo JSON nhẹ được xây dựng trong Python cho các gói dữ liệu & tài nguyên Minecraft. Dự án này được sử dụng để tạo các tệp JSON cho các mod Minecraft, bao gồm các mục tùy chỉnh, khối và thực thể. Rất hữu ích cho việc không chỉ tạo dữ liệu tùy chỉnh mà còn cho các mod thông qua tính năng chuyển đổi tên mod.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Kinh nghiệm giáo dục của tôi",
                "text": "Bên cạnh các dự án cá nhân của tôi, tôi cũng đã có được nhiều kỹ năng từ kinh nghiệm giáo dục. Nhấn vào đây để xem hồ sơ LinkedIn của tôi để biết thêm thông tin.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Kinh nghiệm chuyên môn của tôi",
                "text": "Bên cạnh các dự án cá nhân của tôi, tôi cũng đã có được nhiều kỹ năng từ kinh nghiệm chuyên nghiệp. Nhấn vào đây để xem hồ sơ LinkedIn của tôi để biết thêm thông tin.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Trang web danh mục đầu tư của Patrick Goodwin",
                "text": "Trang web này là trang web danh mục đầu tư cá nhân của tôi, được xây dựng với React.js. Dự án này được sử dụng để giới thiệu các kỹ năng và dự án của tôi, cũng như để cung cấp một nền tảng cho các nhà tuyển dụng tiềm năng liên hệ với tôi. Dự án này được sử dụng để tạo ra một sự hiện diện trực tuyến chuyên nghiệp.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Thư viện kịch bản Lua của Patrick",
                "text": "Một thư viện hữu ích của các tập lệnh Lua để tham khảo trong tương lai. Thư viện này được sử dụng để tự động hóa các tác vụ trong các tập lệnh LUA, có thể có ích cho các nhiệm vụ gây người và người da đen, vì Lua thường là ngôn ngữ kịch bản nhanh hơn cả Python và Ruby.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Các tập lệnh bảng tính Microsoft Excel của Patrick (VBA)",
                "text": "Một thư viện hữu ích của các tập lệnh VBA cho Microsoft Excel. Thư viện này được sử dụng để tự động hóa các tác vụ trong bảng tính Excel.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Cấu hình Neovim của Patrick",
                "text": "Cấu hình Neovim cá nhân của tôi. Dự án này được sử dụng để định cấu hình Neovim theo ý thích của tôi, bao gồm các khóa, chủ đề và plugin tùy chỉnh. Dự án này được sử dụng để làm cho Neovim thân thiện hơn và hiệu quả cho việc sử dụng cá nhân của tôi.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Trình tạo bản đồ của Patrick",
                "text": "Một trình tạo bản đồ của Hạt Hoa Kỳ & Nhà nước, được xây dựng bằng Python bằng các thư viện địa lý và matplotlib. Dự án này được sử dụng để tạo bản đồ của Hoa Kỳ, bao gồm các bản đồ của quận và tiểu bang. Dự án này được sử dụng để tạo bản đồ tùy chỉnh để trực quan hóa và phân tích dữ liệu.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Thư viện kịch bản PowerShell của Patrick",
                "text": "Một thư viện hữu ích của các tập lệnh PowerShell để tham khảo trong tương lai. Hữu ích với tính năng Script Script, tôi thấy điều này vô cùng hữu ích để tự động hóa các tác vụ từ thiết bị đầu cuối Windows, vì tôi là người dùng thường xuyên của HĐH Windows.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Thư viện Ruby Script của Patrick",
                "text": "Một thư viện hữu ích của các tập lệnh Ruby để tham khảo trong tương lai. Hữu ích cho Ruby trong tương lai trên các khái niệm phát triển đường ray.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "Trình tạo kỹ năng PDF",
                "text": "Một nhà xây dựng PDF tùy chỉnh được xây dựng với Python thông qua các phần mở rộng PDFKit và Jinja2, cùng với định dạng HTML và JSON. Dự án này được sử dụng để tạo các tệp PDF từ danh sách các kỹ năng và dự án. Dự án này có thể được sử dụng để tạo sơ yếu lý lịch PDF tùy chỉnh, rất hữu ích cho các ứng dụng công việc.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Dự án mã hóa Rijandel",
                "text": "Một gia đình gồm hơn 10 lần triển khai thuật toán mã hóa Rijandel trong 128, 192 và 256 bit. Dự án này được sử dụng để chứng minh thuật toán mã hóa Rijandel trong các ngôn ngữ lập trình khác nhau. Dự án này được sử dụng để tạo ra một gia đình triển khai thuật toán mã hóa Rijandel.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Suprememc Minecraft Mod",
                "text": "Một mod Minecraft bổ sung các công cụ tùy chỉnh, áo giáp, mob, khối, kích thước và nhiều tính năng khác cho trò chơi. Được xây dựng với các phiên bản Java 8-17 cho các phiên bản Minecraft chọn trong khoảng từ 1.16 đến 1,20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Ngôn ngữ lập trình hổ",
                "text": "Ngôn ngữ lập trình tùy chỉnh được xây dựng trong cả Go & Rust để thử nghiệm với thiết kế và hiệu suất phiên dịch. Được triển khai trên trang web danh mục đầu tư bằng cách sử dụng lắp ráp web.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Trang web của Tiger Tailgating PRES",
                "text": "Một trang web tôi đã xây dựng vào năm 2024 cho Tiger Tailgating Pros, một công ty điều chỉnh ở Clemson, SC. Được xây dựng với React.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Dự án máy Turing",
                "text": "Gia đình của hơn hơn 30 lần triển khai máy Turing. Được sử dụng để chứng minh tính đầy đủ của Turing cho các ngôn ngữ lập trình khác nhau cho nghiên cứu, đặc biệt là đối với ngôn ngữ lập trình Tiger.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Ngôn ngữ lập trình hổ"
    },
    "contact": {
        "title": "Liên hệ với tôi",
        "header": "Thông tin liên hệ",
        "email": "pattygsocials@gmail",
        "description": "Tôi trả lời các câu hỏi từ email, tin nhắn LinkedIn và tin nhắn Instagram. Tôi cũng sẽ gọi lại nếu số của tôi được cung cấp qua sơ yếu lý lịch hoặc nếu không, mặc dù tôi thích giữ số điện thoại của mình."
    },
    "formatter": {
        "title": "Json & Yaml định dạng",
        "description": "JSON & YAML Formatter là một công cụ cho phép bạn định dạng các tệp JSON và YAML. Nó được xây dựng với Go và Webassugging, và nó được thiết kế để nhanh chóng và hiệu quả. Formatter được thiết kế để dễ sử dụng, với giao diện đơn giản cho phép bạn dán mã JSON hoặc YAML của mình và định dạng nó chỉ bằng một nút bấm.",
        "more_info1": "Để biết thêm thông tin, hãy tham khảo readme trong",
        "more_info2": "Kho lưu trữ định dạng JSON/YAML.",
        "format_as": "Định dạng như:",
        "auto_detect": "Tự động phát hiện",
        "format": "Định dạng"
    },
    "cube_solver": {
        "title": "Bộ giải Rubix Cube",
        "start": "Gỡ rối"
    },
    "tiger": {
        "title": "Ngôn ngữ hổ",
        "description": "Ngôn ngữ lập trình Tiger là một ngôn ngữ lập trình tùy chỉnh được xây dựng trong cả Go & Rust để thử nghiệm thiết kế và hiệu suất phiên dịch. Được triển khai trên trang web danh mục đầu tư bằng cách sử dụng lắp ráp web. Ngôn ngữ lập trình Tiger là một ngôn ngữ lập trình tùy chỉnh được xây dựng trong cả Go & Rust để thử nghiệm thiết kế và hiệu suất phiên dịch. Được triển khai trên trang web danh mục đầu tư bằng cách sử dụng lắp ráp web.",
        "more_info1": "Để biết thêm thông tin, hãy tham khảo readme trong",
        "more_info2": "Kho lưu trữ ngôn ngữ Tiger Lập trình.",
        "select_engine": "Chọn Động cơ:",
        "tiger_code": "Mã hổ:",
        "run_tiger": "Chạy hổ",
        "output": "Đầu ra:"
    },
    "tab": {
        "title": "Patrick Goodwin",
        "description": "Kỹ sư phần mềm Full Stack có trụ sở tại Trung tâm Florida"
    },
    "copy": {
        "text": "Sao chép",
        "copied": "Đã sao chép!"
    },
    "social_media": {
        "github": "GitHub",
        "instagram": "Instagram",
        "linkedin": "LinkedIn",
        "tiktok": "Tiktok",
        "youtube": "YouTube",
        "text_strip": "Theo tôi"
    },
    "languages": {
        "title": "Danh mục đầu tư dịch",
        "description": "Khám phá cách danh mục đầu tư của tôi có thể truy cập được cho khách truy cập từ khắp nơi trên thế giới với sự hỗ trợ cho hơn 100 ngôn ngữ.",
        "global_accessibility": {
            "title": "Khả năng tiếp cận toàn cầu",
            "description": "Danh mục đầu tư của tôi có sẵn bằng các ngôn ngữ {Count}, giúp khách truy cập từ khắp nơi trên thế giới có thể truy cập được. Cách tiếp cận đa ngôn ngữ này thể hiện cam kết của tôi về tính bao gồm và phạm vi toàn cầu trong phát triển phần mềm.",
            "stats": {
                "languages_supported": "Ngôn ngữ được hỗ trợ",
                "countries_represented": "Các quốc gia đại diện",
                "continents_covered": "Các lục địa được bảo hiểm"
            }
        },
        "features": {
            "title": "Đặc trưng",
            "items": [
                {
                    "title": "Bản dịch thời gian thực:",
                    "description": "Chuyển ngôn ngữ ngay lập tức với bộ chọn ngôn ngữ"
                },
                {
                    "title": "Ngôn ngữ dựa trên URL:",
                    "description": "Sở thích ngôn ngữ được bảo tồn trong URL"
                },
                {
                    "title": "Hỗ trợ tập lệnh gốc:",
                    "description": "Kết xuất đúng các kịch bản như tiếng Ả Rập, tiếng Trung, tiếng Hindi, và nhiều hơn nữa"
                },
                {
                    "title": "Sự nhạy cảm về văn hóa:",
                    "description": "Bản dịch xem xét bối cảnh văn hóa, không chỉ ý nghĩa theo nghĩa đen"
                },
                {
                    "title": "SEO được tối ưu hóa:",
                    "description": "Mỗi biến thể ngôn ngữ được tối ưu hóa cho các công cụ tìm kiếm"
                }
            ]
        },
        "world_map": {
            "title": "Bản đồ thế giới tương tác",
            "description": "Di chuột qua các quốc gia trên bản đồ để xem các ngôn ngữ được hỗ trợ của họ:",
            "languages_label": "Ngôn ngữ",
            "legend": {
                "supported": "Ngôn ngữ được hỗ trợ",
                "not_supported": "Không hỗ trợ ngôn ngữ"
            },
            "zoom_controls": {
                "zoom_in": "Phóng to",
                "zoom_out": "Thu phóng ra",
                "reset": "Đặt lại chế độ xem"
            }
        },
        "supported_languages": {
            "title": "Ngôn ngữ được hỗ trợ"
        },
        "interactive_country_map": {
            "title": "Bản đồ quốc gia tương tác",
            "description": "Di chuột qua các quốc gia dưới đây để xem các ngôn ngữ được hỗ trợ của họ:",
            "language_count": {
                "single": "ngôn ngữ",
                "multiple": "ngôn ngữ"
            }
        },
        "tooltips": {
            "no_language_support": "Không hỗ trợ ngôn ngữ"
        }
    },
    "logotext": "Patrick"
}