{
    "name": "Patrick goodwin",
    "menu": {
        "home": "Ile",
        "about": "Nipa mi",
        "portfolio": "HanorFolio",
        "projects": "Oju opo wẹẹbu",
        "tiger": "Ede Tiger",
        "formatter": "JonS & Yuml Role",
        "cube_solver": "Rubix Cube Soube",
        "contact": "Kan si mi"
    },
    "home": {
        "title": "Ile",
        "animated": {
            "first": "Iboju sọfitiwia akopọ ni kikun",
            "second": "Onidipọ wẹẹbu",
            "third": "Olugbe idagbasoke",
            "fourth": "Akiyesi akoonu"
        },
        "footer": "Oju opo wẹẹbu & Valible ni awọn ede 100 +!",
        "descriptionA": "Ti o ni iriri ebi ẹrọ akopọ ni kikun pẹlu itan-akọọlẹ ti o ṣafihan ti ṣaṣeyọri ni aṣeyọri awọn iṣẹ idagbasoke, lakoko ṣiṣe ni ibamu pẹlu awọn ọna imudarasi pupọ ati ifowosowopo ẹgbẹ ti o munadoko.",
        "descriptionB": "Ni afikun, Mo jẹ Eleda akoonu akoonu iletography ti o ni aṣeyọri awọn algorithms ti ọpọ awọn ile-iṣẹ media awujọ, pẹlu awọn aṣẹ onisẹyin ati ilowosi onisẹyin.",
        "portfolio_button": "Mi si ile-iṣẹ mi",
        "contact_button": "Kan si mi",
        "about_button": "Nipa mi"
    },
    "about": {
        "title": "Nipa mi",
        "personal_summary": {
            "title": "Lakotan ti ara ẹni",
            "text": "Gẹgẹbi olugbe idagbasoke ni kikun ti o ni iriri ninu Orelando, FL, Mo ti ṣafihan imọ-jinlẹ ninu awọn imọ-ẹrọ lọpọlọpọ, lati Java ati NETES ATI Pẹlu igbasilẹ orin ti awọn iṣẹ ṣiṣe ọkọ ofurufu, pẹlu idagbasoke ti eto Iyipada Java fun Minecraft ati oju opo wẹẹbu ti o ni ere fun awọn awakọ nla, Mo ti sọ ààrándá àlùdárayè. Ideju mi ​​si didara julọ ni ẹri ni agbara mi si Streate Prosectline, yan awọn iṣoro giga, ati fi awọn solusan to gaju ti o jẹ aṣeyọri olumulo olumulo ati aṣeyọri olumulo."
        },
        "professional_experience": {
            "title": "Iriri ọjọgbọn",
            "entries": [
                {
                    "jobtitle": "Ẹlẹgún sọfitiwia kekere",
                    "where": "Orion180 iṣeduro",
                    "date": "2024 - lọwọlọwọ"
                },
                {
                    "jobtitle": "Oludasile & Afowoye sọfitiwia akopọ",
                    "where": "Ile giga",
                    "date": "2020 - 2024"
                },
                {
                    "jobtitle": "Iboju sọfitiwia akopọ ni kikun",
                    "where": "Yara si ẹkọ",
                    "date": "2020"
                },
                {
                    "jobtitle": "Didi Alùgbédáyè wẹẹbu (eto ọmọ ile-iwe)",
                    "where": "Eto Eto Ile-iṣẹ GIDI Clemson",
                    "date": "2021 - 2022"
                },
                {
                    "jobtitle": "Opo tabili",
                    "where": "Climen University",
                    "date": "2021 - 2022"
                }
            ]
        },
        "technical_skills": {
            "title": "Awọn ọgbọn imọ-ẹrọ",
            "header1": "Awọn ede siseto",
            "header2": "Awọn ilana & Awọn ile-ikawe",
            "header3": "Awọn irinṣẹ & Awọn Imọ-ẹrọ"
        },
        "services": {
            "title": "Awọn iṣẹ mi",
            "entries": [
                {
                    "title": "Incaming ni kikun",
                    "text": "Mo nse awọn solusan didara kọja mejeeji-ipari ati idagbasoke ipari, aridaju isọdọkan Sheamyless ati iṣẹ jakejado gbogbo akopọ sọfitiwia."
                },
                {
                    "title": "Idagbasoke wẹẹbu",
                    "text": "Pẹlu imọ-jinlẹ ninu HTML, CSS, ati JavaScrit Framews Bi Dábàájú ati Awọn ọmọ-iwe Oju-iwe Olumulo fẹran lati pade awọn iwulo Awọn alabara pato ati awọn ifẹ."
                },
                {
                    "title": "Ere idagbasoke",
                    "text": "Awọn ede Iwoye bii Java ati C ++, Mo amọja ni ṣiṣẹda awọn iriri ere ere ati apẹrẹ si imuse ati iṣapeye, ṣe idaniloju iṣẹ akanṣe ati iṣe daradara."
                }
            ]
        }
    },
    "portfolio": {
        "title": "HanorFolio",
        "filter_by": "Àlẹmọ àlẹmọ nipasẹ:",
        "entries": {
            "biblioteca": {
                "title": "Bibliteca json",
                "text": "Ise agbese Python ti awọn itumọ èni èkè ṣiṣan. Ngbanilaaye fun Portfolio oju opo wẹẹbu mi lati tumọ si awọn ede 70 +, pẹlu Spani, Faranse, Arabic, ati ọpọlọpọ awọn miiran. A nlo iṣẹ yii lati ṣẹda aaye ayelujara Oju-iwe ayelujara ti loga, eyiti o wulo pupọ fun de ọdọ awọn olugbo ti o wa. Pẹlu iṣẹ yii, ju 99% ti agbaye le ka portfolio mi ni ede kan ti o ga.",
                "link": "https://github.com/pattygcoding/Biblioteca-JSON"
            },
            "connect_four": {
                "title": "Sopọ mẹrin",
                "text": "Idile idile ti o ju 50+ awọn imuse ti ere mẹrin ti Sopọ. Ise agbese yii pẹlu awọn imuse ni awọn ede ti o ju ọgbọn ọdun mẹta to yatọ, pẹlu Java, C ++, Python, JavaScript, ati diẹ sii. Ni afikun, o tun pẹlu awọn ilana awọn oriṣiriṣi 20+ tabi awọn ọna kika miiran, pẹlu fesi .Js, Rub.Ne, ati diẹ sii.",
                "link": "https://github.com/pattygcoding/Connect-Four-Language-Tree"
            },
            "interop": {
                "title": "Amusese Incerop",
                "text": "Ise agbese kan ti o ṣe awọn iwe iṣiro interoperability laarin awọn ede siseto oriṣiriṣi oriṣiriṣi. Lọwọlọwọ pẹlu awọn ede siseto 15 oriṣiriṣi ati awọn ilana ipaniyan 18.",
                "link": "https://github.com/pattygcoding/Interop-Samples"
            },
            "formatter": {
                "title": "Jsson & Yaml aifọwọyi",
                "text": "Ẹkọ kan & Autoferortor fun awọn faili Json & Yml. Iṣẹ yii ni a lo si awọn faili Json & Ysn, eyiti o wulo pupọ fun fifi koodu mimọ ati ṣeto. Ti a ti mọ pẹlu lọ, ṣe akopọ pẹlu karasalmuble, ati fi sii sinu portfolio mi bi iṣẹ oju opo wẹẹbu kan. Awọn ọna diẹ sii lati wa ni ọjọ iwaju.",
                "link": "https://github.com/pattygcoding/JSON-YAML-Auto-Formatter"
            },
            "minecraft_json_generator": {
                "title": "Minecraft Jonnelator",
                "text": "Commonda Lightweight Json Commanda ti a kọ ni Python fun awọn orisun orisun minecraft & data. Ise agbese yii ni a lo lati ṣe ina awọn faili Json fun awọn Mods Minecraft, pẹlu awọn ohun aṣa, awọn bulọọki, ati awọn nkan. Pupọ pupọ fun ko ṣiṣẹda data aṣa nikan, ṣugbọn fun awọn Mods daradara nipasẹ ẹya ti o ti n yipada ti orukọ ti o yipada.",
                "link": "https://github.com/pattygcoding/Minecraft-JSON-Generator"
            },
            "educational_experience": {
                "title": "Iriri ẹkọ mi",
                "text": "Lẹgbẹẹ awọn iṣẹ mi ti ara mi, Mo tun ti gba ọpọlọpọ awọn ọgbọn lati iriri ẹkọ. Tẹ ibi lati wo profaili to sopọ mọ fun alaye diẹ sii.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "professional_experience": {
                "title": "Iriri ọjọgbọn mi",
                "text": "Lẹgbẹẹ awọn iṣẹ mi ti ara mi, Mo tun ti gba ọpọlọpọ awọn ọgbọn lati iriri ọjọgbọn. Tẹ ibi lati wo profaili to sopọ mọ fun alaye diẹ sii.",
                "link": "https://www.linkedin.com/in/patrickgoodwin7"
            },
            "portfolio_website": {
                "title": "Patrick GoodWWWWEN Oju opo wẹẹbu Portfolio",
                "text": "Oju opo wẹẹbu yii jẹ oju opo wẹẹbu ti ara ẹni ti ara mi, ti a ṣe pẹlu rease.js. Ise agbese yii ni a lo lati ṣafihan awọn ọgbọn ati awọn iṣẹ-ṣiṣe mi, ati lati pese pẹpẹ kan fun awọn agbanisiṣẹ ti o ni agbara lati kan si mi. Ise agbese yii ni a lo lati ṣẹda wiwa ayelujara lori ayelujara.",
                "link": "https://www.pattygcoding.com"
            },
            "lua_library": {
                "title": "Patrick's Inde Iwe afọwọkọ Ni ile-ikawe",
                "text": "Ile ikawe ti o wulo ti awọn afọwọkọ Lui fun itọkasi ọjọ iwaju. Awọn iṣẹ-ikawe yii lati ṣe adaṣe iṣẹ ni awọn iwe afọwọkọ LA, eyiti o le wa ni ọwọ fun awọn iṣẹ ṣiṣe-agbara, bi Lua jẹ ede ti o rọrun ju ti Python ati Ruby lọ.",
                "link": "https://github.com/pattygcoding/Lua-Scripts"
            },
            "excel_scripts": {
                "title": "Awọn iwe afọwọkọ ti Patrick nigbagbogbo",
                "text": "Ile-ikawe ti o wulo fun awọn iwe afọwọkọ VBA fun Microsoft tayo. Ti lo ile-ikawe yii lati ṣe adaṣe awọn iṣẹ ṣiṣe ni awọn iwe karun.",
                "link": "https://github.com/pattygcoding/Spreadsheet-Scripts"
            },
            "neovim_config": {
                "title": "Patrick ká atunto atunto",
                "text": "Iṣeto ti ara ẹni neovim mi. Ise agbese yii ni a lo lati tunto Neovim si mi, pẹlu awọn Kekere Centerbintings, awọn akori, ati awọn afikun. Ise agbese yii ni a lo lati ṣe neoveim diẹ olumulo ati lilo fun lilo ara mi.",
                "link": "https://github.com/pattygcoding/Neovim-Config"
            },
            "python_maps": {
                "title": "Patrick's Map monomono",
                "text": "Ajopo Amẹrika Counter & Star Monephatorator, ti a kọ pẹlu Python lilo awọn geopirad ati awọn ile-ikawe matPlotliba. Ise agbese yii ni a lo lati ṣe ina awọn maapu ti Orilẹ Amẹrika, pẹlu County ati Awọn maapu Ipinle. A nlo iṣẹ yii lati ṣẹda awọn maapu aṣa fun wiwo data ati itupalẹ.",
                "link": "https://i.imgur.com/HxYLSXC.png"
            },
            "powershell_library": {
                "title": "Awọn ile-ikawe iwe afọwọkọ agbara Fitrick",
                "text": "Ile ikawe ti o wulo ti awọn afọwọkọ agbara agbara fun itọkasi ọjọ iwaju. Wulo pẹlu ẹya afọwọkọ ti $, Mo rii iranlọwọ pupọ fun awọn iṣẹ ṣiṣe adaṣe lati ebute mọtoto, bi emi ti wa ni olumulo loorekoore ti Windows OS.",
                "link": "https://github.com/pattygcoding/Powershell-Scripts"
            },
            "ruby_library": {
                "title": "Gba awọn ile-ikawe iwe afọwọkọ iwe afọwọkọ Patrick",
                "text": "Ile ikawe ti o wulo ti awọn iwe afọwọkọ Ruby fun itọkasi iwaju. Wulo fun ruby ​​iwaju lori awọn imọran idagbasoke.",
                "link": "https://github.com/pattygcoding/Ruby-Scripts"
            },
            "pdf_builder": {
                "title": "Olumulo ogbon ti PDF",
                "text": "Onibara PDF aṣa ti a ko pẹlu Python nipasẹ PDFkit ati awọn amugbooro jimin2 ati JONBL ati ọna kika Json. A lo iṣẹ yii lati ṣe ina awọn faili PDF lati atokọ ti awọn ọgbọn ati awọn iṣẹ akanṣe. A le lo iṣẹ yii lati ṣẹda bẹrẹ PDF aṣa kan, eyiti o wulo pupọ fun awọn ohun elo iṣẹ.",
                "link": "https://github.com/pattygcoding/PDFBuilderPublic"
            },
            "rijandel_encryption": {
                "title": "Ise agbese Ratinadel",
                "text": "Idile ti awọn imule 10+ ti fifi ẹmí Brorithm ni 128, 192, ati 256. A lo iṣẹ yii lati ṣafihan Algorithm Ifiwewe Rijel ni awọn ede siseto oriṣiriṣi oriṣiriṣi. A nlo iṣẹ yii lati ṣẹda idile ti awọn imuse ti fifi ẹnọ fun ẹrọ ti rirorithm.",
                "link": "https://github.com/pattygcoding/SupremeMC"
            },
            "suprememc": {
                "title": "Monestercraft monda",
                "text": "Ami minecraft ti o ṣafikun awọn irinṣẹ aṣa, ihamọra, awọn ọkọ oju-omi, awọn bulọọki, awọn agbegbe, awọn iwọn, ati ọpọlọpọ awọn ẹya diẹ sii si ere naa. Ti a ṣe pẹlu awọn ẹya Java 8-17 fun yan awọn ẹya Minecraft laarin 1.16 ati 1.20.",
                "link": "https://www.curseforge.com/minecraft/mc-mods/suprememc"
            },
            "tiger_programming_language": {
                "title": "Ede tiger tiger",
                "text": "Ede Eto Eto Aṣa Ti a ṣalaye ninu mejeeji Lọ & Iriri lati ṣe idanwo pẹlu apẹrẹ onitumọ ati iṣẹ. Ti a ṣe lori oju opo wẹẹbu Portfolio ni lilo Apejọ wẹẹbu.",
                "link": "https://www.pattygcoding.com/tiger"
            },
            "tiger_tailgating_pros": {
                "title": "Tiger iru oju opo wẹẹbu ti Tiger",
                "text": "Oju opo wẹẹbu kan ti Mo kọ ni 2024 fun Awọn Alejo Tiger ti Tiger, Ile-iṣẹ Ipọnju kan ni Climeston, SC. Ti a ṣe pẹlu reaase.js.",
                "link": "https://github.com/pattygcoding/TTProsBeta"
            },
            "turing_machine": {
                "title": "Ise agbese ẹrọ Turin",
                "text": "Idile ti o ju 30+ awọn imuse ẹrọ ti ẹrọ egungun. Ti a lo lati ṣafihan pipari tibajẹ fun awọn ede siseto oriṣiriṣi fun iwadii, paapaa fun ede tiger ti n ṣehinti Tiger.",
                "link": "https://github.com/pattygcoding/Turing-Machines"
            }
        }
    },
    "tiger_programming_language": {
        "title": "Ede tiger tiger"
    },
    "contact": {
        "title": "Kan si mi",
        "header": "Ibi iwifunni",
        "email": "Pattygocials@gmail.com",
        "description": "Mo dahun lati ṣe iwadii lati imeeli, Awọn ifiranṣẹ Linked, ati awọn ifiranṣẹ Instagram. Mo tun yoo pe pada ti nọmba mi ba pese nipasẹ bẹrẹ tabi bibẹẹkọ, botilẹjẹpe Mo fẹ lati tọju nọmba foonu mi ni ikọkọ."
    },
    "formatter": {
        "title": "JonS & Yuml Role",
        "description": "Ṣafihan JSSS & Yuml & Yuml ti o fun ọ laaye lati ṣe iru awọn faili Json ati awọn faili yaml. O ti kọ pẹlu lọ ati aalaye, ati pe o ṣe apẹrẹ lati yara ati lilo daradara. A ṣe apẹrẹ agbekalẹ lati rọrun lati lo, pẹlu wiwo ti o rọrun ti o fun ọ laaye lati lẹẹmọ ninu KỌRỌ JSSA tabi Kamn ati ọna kika rẹ pẹlu tẹ bọtini kan.",
        "more_info1": "Fun alaye diẹ sii, tọka si kika kika ninu",
        "more_info2": "Ibudopo Rosing Json / Yaml.",
        "format_as": "Ọna kika bi:",
        "auto_detect": "Auto rii",
        "format": "Ọna kika"
    },
    "cube_solver": {
        "title": "Rubix Cube Soube",
        "solve": "Yanju"
    },
    "tiger": {
        "title": "Ede Tiger",
        "description": "Ede ti Tiger ti Tiger jẹ ede siseto aṣa ti a ṣe ni awọn mejeeji lọ & ipata lati ni ajọ pẹlu apẹrẹ ati iṣẹ. Ti a ṣe lori oju opo wẹẹbu Portfolio ni lilo Apejọ wẹẹbu. Ede ti Tiger ti Tiger jẹ ede siseto aṣa ti a ṣe ni awọn mejeeji lọ & ipata lati ni ajọ pẹlu apẹrẹ ati iṣẹ. Ti a ṣe lori oju opo wẹẹbu Portfolio ni lilo Apejọ wẹẹbu.",
        "more_info1": "Fun alaye diẹ sii, tọka si kika kika ninu",
        "more_info2": "Ibi ipamọ ede tiger ti n ṣe agbelera.",
        "select_engine": "Yan Engé:",
        "tiger_code": "Koodu Tiger:",
        "run_tiger": "Ṣiṣe Tiger",
        "output": "Ayọ:"
    },
    "tab": {
        "title": "Patrick goodwin",
        "description": "Ilọkuro sọfitiwia iboju kikun orisun ni Clarrida"
    },
    "copy": {
        "text": "Ẹda",
        "copied": "Daakọ!"
    },
    "social_media": {
        "github": "Gitter",
        "instagram": "Ile ipamọ",
        "linkedin": "Lindedin",
        "tiktok": "Toktok",
        "youtube": "Youtube",
        "text_strip": "Tele me kalo"
    },
    "logotext": "Patrick"
}